/* 点卷商店 - 洗能力
Array(2702001,1,2000,""),
Array(2702001,10,20000,""),
 */

var itemList = Array(
	
	Array(2672068, 1, 66666, "倾斜的圆桌"),
	Array(2672067, 1, 66666, ""),// 单人布艺沙发
	Array(2672066, 1, 66666, ""),// 向日葵花盆
	Array(2672065, 1, 66666, "花盆中的小野花"),
	Array(2672064, 1, 66666, ""),// 花蘑菇玩偶
	Array(2672063, 1, 66666, ""),// 橘黄蘑菇凳
	Array(2672062, 1, 66666, ""),// 布艺奶油沙发
	Array(2672061, 1, 66666, ""),// 布艺奶油转角沙发
	Array(2672060, 1, 66666, ""),// 迷你铁制保险箱（红色）
	Array(2672059, 1, 66666, ""),// 水下世界珊瑚灯
	Array(2672058, 1, 66666, ""),// 蘑菇落地灯
	Array(2672057, 1, 66666, ""),// 射手村野花花盆
	Array(2672054, 1, 66666, ""),// DJ台
	Array(2672053, 1, 66666, ""),// 贝伦熔岩浴缸
	Array(2672052, 1, 66666, ""),// 血腥女王化妆台
	Array(2672051, 1, 66666, ""),// 皮埃尔雨伞架
	Array(2672049, 1, 66666, ""),// 卡雄吸尘器
	Array(2672048, 1, 66666, ""),// 麦格纳斯之角椅子 
	Array(2672047, 1, 66666, ""),// 乌鲁斯生命之树花盆 
	Array(2672046, 1, 66666, ""),// 扎昆之手桌子 
	Array(2672045, 1, 66666, ""),// 蝙蝠怪之角椅子 
	Array(2672044, 1, 66666, ""),// 编织隔断 
	Array(2672043, 1, 66666, ""),// 勇士部落图腾装饰 
	Array(2672042, 1, 66666, ""),// 林中之城木制洗漱台 
	Array(2672041, 1, 66666, ""),// 林中之城桑拿房 
	Array(2672040, 1, 66666, ""),// 桌上盆景 
	Array(2672039, 1, 66666, ""),// 天然藤椅 
	Array(2672038, 1, 66666, ""),// 民族花纹布艺沙发 
	Array(2672037, 1, 66666, ""),// 民族风吊床 
	Array(2672036, 1, 66666, ""),// 凯梅尔兹珊瑚鱼缸 
	Array(2672035, 1, 66666, ""),// 玛格利特白色立柜 
	Array(2672033, 1, 66666, ""),// 橡木书桌 
	Array(2672032, 1, 66666, ""),// 古老大理石壁炉 
	Array(2672031, 1, 66666, ""),// 橡木桌子 
	Array(2672030, 1, 66666, ""),// 洛可可牛皮转角沙发 
	Array(2672029, 1, 66666, ""),// 洛可可单人牛皮沙发 
	Array(2672028, 1, 66666, ""),// 洛可可天然皮革床 
	Array(2672024, 1, 66666, ""),// 燃气烤箱灶 
	Array(2672023, 1, 66666, ""),// 原木爱尔兰餐桌 
	Array(2672022, 1, 66666, ""),// 射手村产原木衣帽架 
	Array(2672018, 1, 66666, ""),// 优雅的枫木盆栽 
	Array(2672017, 1, 66666, ""),// 舒服的沙发床 
	Array(2672014, 1, 66666, ""),// 陈旧的原木单人床 
	Array(2672013, 1, 66666, ""),// 希拉方尖碑落地灯 
	Array(2672011, 1, 66666, ""),// 家用迷你铁砧 
	Array(2672010, 1, 66666, ""),// 勇士部落宠物屋 
	Array(2672009, 1, 66666, ""),// 春日橄榄花盆 
	Array(2672008, 1, 66666, ""),// 阿凯拉椰子花盆 
	Array(2672006, 1, 66666, ""),// 玛格利特饰品制作化妆台 
	Array(2672005, 1, 66666, ""),// 浪漫来访记录 
	Array(2672004, 1, 66666, ""),// 原木迷你自贩机 
	Array(2672001, 1, 66666, ""),// 夜空水晶球 
	Array(2671038, 1, 66666, ""),// 水晶吊灯 
	Array(2671037, 1, 66666, ""),// 陶瓷盘装饰 
	Array(2671036, 1, 66666, ""),// 悬挂植物 
	Array(2671035, 1, 66666, ""),// 跳跃绿水灵木相框 
	Array(2671034, 1, 66666, ""),// 跳跃漂漂猪木相框 
	Array(2671033, 1, 66666, ""),// 跳跃花蘑菇木相框 
	Array(2671006, 1, 66666, ""),// 跳跃绿水灵木相框 
	Array(2671019, 1, 66666, ""),// 帕普拉图斯挂钟 
	Array(2671016, 1, 66666, ""),// 勇士部落太阳布艺海报 
	Array(2671015, 1, 66666, ""),// 编织窗帘窗户 
	Array(2671014, 1, 66666, ""),// 冒险岛世界地图 
	Array(2671013, 1, 66666, ""),// 古老石膏相框 - 双弩精灵 
	Array(2671012, 1, 66666, ""),// 古老石膏相框 - 艾丽卡 
	Array(2671011, 1, 66666, ""),// 古老石膏相框 - 希纳斯 
	Array(2671010, 1, 66666, ""),// 拱形窗户 
	Array(2671008, 1, 66666, ""),// 闪光镜面球 
	Array(2671007, 1, 66666, ""),// 原木厨房搁板 
	Array(2671003, 1, 66666, ""),// 轻柔蕾丝窗帘窗户 
	Array(2671000, 1, 66666, ""),// 金银岛CD播放器 
	Array(2671051, 1, 66666, ""),// 陈旧的木窗 
	Array(2671050, 1, 66666, ""),// 战场上的明星 - 海报 
	Array(2671049, 1, 66666, ""),// 我们是冒险家 - 海报 
	Array(2671048, 1, 66666, ""),// 橡子侦探团 - 海报 
	Array(2671047, 1, 66666, ""),// 晓之阵 - 海报 
	Array(2671046, 1, 66666, ""),// 精灵的女王 - 海报 
	Array(2671045, 1, 66666, ""),// 骑士团长的气质！ - 海报 
	Array(2671044, 1, 66666, ""),// 冒险的开始 - 海报 
	Array(2671043, 1, 66666, ""),// 我不会忘记你 - 海报 
	Array(2671042, 1, 66666, ""),// 噢，我的女皇！- 海报 
	Array(2671041, 1, 66666, ""),// 梦境操纵者 - 海报 
	Array(2671040, 1, 66666, ""),// 太古蘑菇 - 海报 
	Array(2671039, 1, 66666, ""),// 龙神 - 海报 
	Array(2672000, 1, 66666, "")// 炼金术桌子
	

);
var selectedItem = -1;
var selequantity = -1;
var selectedCost = -1;
var epp1 = "#fEffect/ItemEff.img/2022109/1#"; //彩光
var epp2 = "#fEffect/ItemEff.img/2022109/2#"; //彩光
var selStr = "       #v3801199#\r\n请选择您希望购买的道具：";
for(var i = 0; i < itemList.length; i++) {
	selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k x " + itemList[i][1] + "  #r" + itemList[i][2] + "#k点卷 #r " + itemList[i][3] + "#l";
}
let selection = npc.askMenuS(selStr);

var item = itemList[selection];

	selectedItem = item[0];
	selequantity = item[1];
	selectedCost = item[2];

	let sel = npc.askNumberS("你选择的商品为#b#v" + selectedItem + "#售价为：" + selectedCost + "点卷/张\r\n请输入你购买的数量", 1, 1, 3000);
	//cm.askYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k x (" + selequantity + ") 需要 #r" + selectedCost + "#k 点卷？");


if(player.getCashShopCurrency(1) >= (sel * selectedCost)) {
	if(player.canGainItem(selectedItem, sel)) {
		
		var flag =player.gainGachaponItem("百货中心",selectedItem, sel,1);
		if(flag){
			player.addPQLog("家具购买",1,999);
			player.modifyCashShopCurrency(1, -(selectedCost * sel));
			npc.say("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k x (" + sel + ") 。");
		}else{
			npc.say("请清理背包哦~");
		}
		
		//npc.broadcastGachaponMsgEx("『点卷商城』 " + player.getName() + " 玩家在点卷商城购买道具： #v" + selectedItem + "# x " + selection);
		
	} else {
		npc.say("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
	}
} else {
	npc.say("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k x (" + selequantity + ") 需要 #r" + selectedCost + "#k 点卷。");
}