var status;
var useMesos = 1;
var tz15 = "#fEffect/CharacterEff/1112949/0/0#"; //花样音符
var itemList = Array(
	Array(2046111, 300, 1, 1), //周年
	Array(2046108, 300, 1, 1), //周年
	Array(2046109, 300, 1, 1), //周年
	Array(2046008, 300, 1, 1), //周年
	Array(2046009, 300, 1, 1), //周年
	Array(2046010, 300, 1, 1), //周年
	Array(2046011, 300, 1, 1), //周年
	Array(2049300, 400, 1, 1), //强化
	Array(2046578, 150, 1, 1), //100%还原
	Array(2046579, 300, 1, 1), //50%还原
	Array(5064300, 150, 1, 1), //S潜
	Array(2531005, 350, 1, 1), //防爆卷轴
	Array(5064003, 350, 1, 1), //极真保护之盾
	Array(2049419, 350, 1, 1), //开潜能100%
	Array(2048306, 350, 1, 1), //开附加100%
	Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
	Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
	Array(2046577, 200, 1, 1), //宿命正义防具力量卷轴 100%
	Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴
	Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴
	Array(2046763, 500, 1, 1), //宿命正义饰品力量卷轴 
	Array(2046914, 500, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046764, 250, 1, 1), //宿命正义饰品智力卷轴
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴
	Array(2046914, 200, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046996, 150, 1, 1), //惊人的单手武器攻击力卷轴100%
	Array(2046997, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2612059, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2047818, 150, 1, 1), //惊人的双手武器攻击力卷轴100%
	Array(2046111, 300, 1, 1), //周年
	Array(2046108, 300, 1, 1), //周年
	Array(2046109, 300, 1, 1), //周年
	Array(2046008, 300, 1, 1), //周年
	Array(2046009, 300, 1, 1), //周年
	Array(2046010, 300, 1, 1), //周年
	Array(2046011, 300, 1, 1), //周年
	Array(2049300, 400, 1, 1), //强化
	Array(2046578, 150, 1, 1), //100%还原
	Array(2046579, 300, 1, 1), //50%还原
	Array(5064300, 150, 1, 1), //S潜
	Array(2531005, 350, 1, 1), //防爆卷轴
	Array(5064003, 350, 1, 1), //极真保护之盾
	Array(2049419, 350, 1, 1), //开潜能100%
	Array(2048306, 350, 1, 1), //开附加100%
	Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
	Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
	Array(2046577, 200, 1, 1), //宿命正义防具力量卷轴 100%
	Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴
	Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴
	Array(2046763, 500, 1, 1), //宿命正义饰品力量卷轴 
	Array(2046914, 500, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046764, 250, 1, 1), //宿命正义饰品智力卷轴
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴
	Array(2046914, 200, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046996, 150, 1, 1), //惊人的单手武器攻击力卷轴100%
	Array(2046997, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2612059, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2047818, 150, 1, 1), //惊人的双手武器攻击力卷轴100%
	Array(2046111, 300, 1, 1), //周年
	Array(2046108, 300, 1, 1), //周年
	Array(2046109, 300, 1, 1), //周年
	Array(2046008, 300, 1, 1), //周年
	Array(2046009, 300, 1, 1), //周年
	Array(2046010, 300, 1, 1), //周年
	Array(2046011, 300, 1, 1), //周年
	Array(2049300, 400, 1, 1), //强化
	Array(2046578, 150, 1, 1), //100%还原
	Array(2046579, 300, 1, 1), //50%还原
	Array(5064300, 150, 1, 1), //S潜
	Array(2531005, 350, 1, 1), //防爆卷轴
	Array(5064003, 350, 1, 1), //极真保护之盾
	Array(2049419, 350, 1, 1), //开潜能100%
	Array(2048306, 350, 1, 1), //开附加100%
	Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
	Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
	Array(2046577, 200, 1, 1), //宿命正义防具力量卷轴 100%
	Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴
	Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴
	Array(2046763, 500, 1, 1), //宿命正义饰品力量卷轴 
	Array(2046914, 500, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046764, 250, 1, 1), //宿命正义饰品智力卷轴
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴
	Array(2046914, 200, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046996, 150, 1, 1), //惊人的单手武器攻击力卷轴100%
	Array(2046997, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2612059, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2047818, 150, 1, 1), //惊人的双手武器攻击力卷轴100%
	Array(2046111, 300, 1, 1), //周年
	Array(2046108, 300, 1, 1), //周年
	Array(2046109, 300, 1, 1), //周年
	Array(2046008, 300, 1, 1), //周年
	Array(2046009, 300, 1, 1), //周年
	Array(2046010, 300, 1, 1), //周年
	Array(2046011, 300, 1, 1), //周年
	Array(2049300, 400, 1, 1), //强化
	Array(2046578, 150, 1, 1), //100%还原
	Array(2046579, 300, 1, 1), //50%还原
	Array(5064300, 150, 1, 1), //S潜
	Array(2531005, 350, 1, 1), //防爆卷轴
	Array(5064003, 350, 1, 1), //极真保护之盾
	Array(2049419, 350, 1, 1), //开潜能100%
	Array(2048306, 350, 1, 1), //开附加100%
	Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
	Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
	Array(2046577, 200, 1, 1), //宿命正义防具力量卷轴 100%
	Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴
	Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴
	Array(2046763, 500, 1, 1), //宿命正义饰品力量卷轴 
	Array(2046914, 500, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046764, 250, 1, 1), //宿命正义饰品智力卷轴
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴
	Array(2046914, 200, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046996, 150, 1, 1), //惊人的单手武器攻击力卷轴100%
	Array(2046997, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2612059, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2047818, 150, 1, 1), //惊人的双手武器攻击力卷轴100%
	Array(2046111, 300, 1, 1), //周年
	Array(2046108, 300, 1, 1), //周年
	Array(2046109, 300, 1, 1), //周年
	Array(2046008, 300, 1, 1), //周年
	Array(2046009, 300, 1, 1), //周年
	Array(2046010, 300, 1, 1), //周年
	Array(2046011, 300, 1, 1), //周年
	Array(2049300, 400, 1, 1), //强化
	Array(2046578, 150, 1, 1), //100%还原
	Array(2046579, 300, 1, 1), //50%还原
	Array(5064300, 150, 1, 1), //S潜
	Array(2531005, 350, 1, 1), //防爆卷轴
	Array(5064003, 350, 1, 1), //极真保护之盾
	Array(2049419, 350, 1, 1), //开潜能100%
	Array(2048306, 350, 1, 1), //开附加100%
	Array(2046765, 200, 1, 1), //宿命正义饰品敏捷卷轴 100%
	Array(2046578, 200, 1, 1), //宿命正义防具智力卷轴 100%
	Array(2046577, 200, 1, 1), //宿命正义防具力量卷轴 100%
	Array(2046766, 200, 1, 1), //宿命正义饰品运气卷轴 100%
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046579, 200, 1, 1), //宿命正义防具敏捷卷轴
	Array(2046580, 200, 1, 1), //宿命正义防具运气卷轴
	Array(2046763, 500, 1, 1), //宿命正义饰品力量卷轴 
	Array(2046914, 500, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046764, 250, 1, 1), //宿命正义饰品智力卷轴
	Array(2046173, 200, 1, 1), //宿命正义双手武器攻击力卷轴
	Array(2046913, 200, 1, 1), //宿命正义单手武器攻击力卷轴
	Array(2046914, 200, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046996, 150, 1, 1), //惊人的单手武器攻击力卷轴100%
	Array(2046997, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2612059, 150, 1, 1), //惊人的双手武器魔力卷轴100% 
	Array(2047818, 150, 1, 1), //惊人的双手武器攻击力卷轴100%
	Array(2613051, 100, 1, 1), //X单手武器魔力卷轴
	Array(2616061, 40, 1, 1), //XFG
	Array(2616062, 40, 1, 1), //XMG
	Array(2615031, 40, 1, 1), //XSG
	Array(2615032, 40, 1, 1), //XSM
	Array(2613050, 40, 1, 1), //X单手武器攻击力卷轴
	Array(2612061, 40, 1, 1), //X双手武器攻击力卷轴
	Array(2612079, 30, 1, 1), //究极黑暗双手武器魔力
	Array(2613067, 10, 1, 1), //究极黑暗单手武器魔力
	Array(2612078, 10, 1, 1), //究极黑暗双手武器攻击
	Array(2613066, 10, 1, 1), //究极黑暗单手武器攻击
	Array(2615050, 10, 1, 1), //究极黑暗饰品魔力卷轴
	Array(2616214, 10, 1, 1), //究极黑暗防具攻击力卷轴
	Array(2615049, 10, 1, 1), //究极黑暗饰品攻击力卷轴
	Array(2616215, 10, 1, 1), //究极黑暗防具魔力卷轴
	Array(2048823, 10, 1, 1), //究极黑暗宠物装备攻击力卷轴
	Array(2048824, 10, 1, 1), //究极黑暗宠物装备魔力卷轴
	Array(2612062, 50, 1, 1) //X双手武器魔力卷轴

);
while(true){
if(player.hasItem(4032226, 1)) {
	var txt = "            #e" + tz15 + "#r『黄金猪圈』 " + tz15 + "\r\n#k\r\n\r\n        使用“#b" + useMesos + "个#v4032226##z4032226# #k”就可以进行一次抽奖....\r\n\r\n———————————————————————— \r\n#v2435824##r用黄金猪猪就可以摸奖以下卷轴!!";
	for(var i = 0; i < itemList.length; i++) {
		txt += "#v" + itemList[i] + "#";
	}
	txt+="#L1#开始抽取#l";
	let selection = npc.askMenu(txt);
	if(selection == 1) {
		if(player.getFreeSlots(1) < 1 || player.getFreeSlots(2) < 1 || player.getFreeSlots(3) < 1 || player.getFreeSlots(4) < 1 || player.getFreeSlots(5) < 1) {
			npc.say("请整理你的背包空间..");

		} else {
			var chance = Math.floor(Math.random() * 1000);
			var finalitem = Array();

			for(var i = 0; i < itemList.length; i++) {
				if(chance <= itemList[i][1]) {
					finalitem.push(itemList[i]);
				}
			}
			if(finalitem.length != 0) {
				var random = new java.util.Random();
				var finalchance = random.nextInt(finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
				var notice = finalitem[finalchance][3];

				if(notice == 1) {
					var item = player.gainGachaponItem("金猪抽奖", itemId, quantity, 3);
				}
				player.loseItem(4032226, 1);
				npc.say("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
			} else {
				
				player.loseItem(4032226, 1);
				player.gainItem(4001839, 200);
				npc.say("#r\r\n今天的运气可真差，什么都没有拿到。");

			}
		}
	}

} else {
	var txt = "            #e" + tz15 + "#r『养猪场』 " + tz15 + "\r\n#k\r\n\r\n        这需要花费“#b" + useMesos + "个#v4032226##z4032226#”                            每日泡点奖励与每日理财福利可以获得#k\r\n#v2435824##r用黄金猪猪就可以摸奖以下卷轴!!\r\n———————————————————————— ";
	for(var i = 0; i < itemList.length; i++) {
		txt += "#v" + itemList[i] + "#";
	}
	npc.say(txt);

}
}