var tz15 = "#fEffect/CharacterEff/1112949/0/0#"; //花样音符
var status = -1;
var itemList = Array(
	//------披风------
	Array(1033000, 10, 1, 1), //路西德耳环
	Array(1102174, 50, 1, 1), //工作人员披风
	//------手套------
	Array(1082144, 300, 1, 1), //幻光手套(红)
	Array(1082145, 100, 1, 1), //工地手套(黄)
	Array(1082146, 100, 1, 1), //工地手套(红)
	Array(1082147, 100, 1, 1), //工地手套(蓝)
	Array(1082148, 100, 1, 1), //工地手套(紫)
	Array(1082149, 100, 1, 1), //工地手套(褐)
	Array(1082150, 100, 1, 1), //工地手套(灰)
	//-------武器------
	Array(1302080, 300, 1, 1) //七彩霓虹灯泡
);

var itemList2 = Array(

	Array(2048752, 150, 1, 1), //温度计
	Array(2048749, 150, 1, 1), //温度计
	Array(2048731, 150, 1, 1), //温度计
	Array(2048743, 150, 1, 1), //温度计
	Array(1402014, 150, 1, 1), //温度计
	Array(2049610, 100, 1, 1), //温度计
	Array(2049376, 10, 1, 1), //温度计
	Array(2049384, 50, 1, 1), //温度计
	Array(2049116, 50, 1, 1), //温度计
	Array(2340000, 550, 1, 1), //温度计
	Array(2614078, 50, 1, 1), //温度计
	Array(2614058, 100, 1, 1), //温度计
	Array(2614068, 10, 1, 1), //温度计
	Array(2614069, 10, 1, 1), //温度计
	Array(2430893, 50, 1, 1), //温度计
	Array(1022226, 50, 1, 1), //温度计
	Array(1152087, 50, 1, 1), //温度计
	Array(1022225, 50, 1, 1), //温度计
	Array(2643129, 250, 1, 1), //温度计
	Array(4001715, 10, 1, 1), //温度计
	Array(2431509, 50, 1, 1), //温度计
	Array(2434666, 50, 1, 1), //温度计
	Array(1022246, 50, 1, 1), //米卡埃拉的新眼镜
	Array(1032104, 50, 1, 1), //温度计
	Array(1032103, 50, 1, 1), //温度计
	Array(1032102, 50, 1, 1), //温度计
	Array(1032186, 50, 1, 1), //温度计
	Array(1032101, 50, 1, 1), //温度计
	Array(1032061, 50, 1, 1), //温度计
	Array(1032060, 50, 1, 1), //温度计
	Array(1003419, 50, 1, 1), //温度计
	Array(1003418, 50, 1, 1), //温度计
	Array(1003858, 50, 1, 1), //温度计
	Array(1003857, 50, 1, 1), //温度计
	Array(1003856, 50, 1, 1), //温度计
	Array(1032100, 50, 1, 1), //温度计
	Array(1072819, 50, 1, 1), //温度计
	Array(1072510, 50, 1, 1), //温度计
	Array(1022175, 50, 1, 1), //温度计
	Array(1022164, 50, 1, 1), //温度计
	Array(1022143, 50, 1, 1), //温度计
	Array(1022123, 50, 1, 1), //温度计
	Array(1122117, 50, 1, 1), //温度计
	Array(1122116, 50, 1, 1), //温度计
	Array(1122118, 50, 1, 1), //温度计
	Array(1072872, 50, 1, 1), //温度计
	Array(1152135, 50, 1, 1), //温度计
	Array(1132098, 50, 1, 1), //科拉班·雷昂战争腰带	
	Array(1072872, 100, 1, 1) //永恒碎鼋斧
);

var itemList3 = Array(
	Array(1072872, 100, 1, 1), //重生碎鼋斧------------------------------------------------
	Array(1072872, 20, 1, 1) //重生孔雀翎
);

var itemList4 = Array(
	Array(2046110, 50, 1, 1), //粉色花边游泳圈
	Array(2046110, 50, 1, 1), //圣诞六翼天使武器(指节)
	Array(2046110, 100, 1, 1) //耳环敏捷卷轴60%
);

var itemList5 = Array(
	Array(2049116, 10, 1, 1), //黄水晶耳环
	Array(2049116, 10, 1, 1), //秋叶耳环
	Array(2049116, 10, 1, 1) //海盗头巾(绿)
);

var itemList6 = Array(
	//-----椅子-----
	Array(5062024, 100, 1, 1), //闪炫魔方
	Array(4033356, 250, 1, 1), //正义火种1
	Array(4000124, 250, 1, 1), //战甲吹泡泡鱼的内存卡
	Array(1032219, 100, 1, 1), //遗忘之神话耳环
	Array(5570000, 250, 1, 1), //金锤子
	
	Array(4001715, 100, 1, 1), //定居币1亿
	Array(4001715, 100, 1, 1), //定居币1亿
	Array(2048723, 100, 1, 1), //火花
	Array(2046110, 250, 1, 1), //周年双攻
	Array(2046010, 250, 1, 1), //周年单攻
	Array(2614002, 100, 1, 1), //百万突破
	Array(2614001, 250, 1, 1), //十万突破
	Array(2049383, 250, 1, 1), //星之力14星强化券
	Array(2049384, 250, 1, 1), //星之力15星强化券
	Array(2049385, 200, 1, 1), //星之力16星强化券
	Array(2049386, 150, 1, 1), //星之力17星强化券
	Array(1012319, 100, 1, 1), //8周年点点红
	Array(2510173, 250, 1, 1), //高级智能机器人(男)制作配方
	Array(2510174, 250, 1, 1), //高级智能机器人(女)制作配方
	Array(2046913, 100, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046914, 100, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046173, 100, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2046913, 100, 1, 1), //宿命正义单手武器攻击力卷轴 100%
	Array(2046914, 100, 1, 1), //宿命正义单手武器魔力卷轴 100%
	Array(2046173, 100, 1, 1), //宿命正义双手武器攻击力卷轴 100%
	Array(2040948, 30, 1, 1), //品克缤盾牌运气攻击卷轴
	Array(2040354, 30, 1, 1), //品克缤耳环运气攻击卷轴
	Array(2041142, 30, 1, 1), //品克缤戒指运气攻击卷轴
	Array(2041234, 30, 1, 1), //品克缤项链运气攻击卷轴
	Array(2046693, 30, 1, 1), //品克缤防具运气攻击卷轴
	Array(2040349, 250, 1, 1), //品克缤耳环敏捷攻击卷轴
	Array(2046687, 30, 1, 1), //品克缤防具敏捷攻击卷轴
	Array(2041136, 30, 1, 1), //品克缤戒指敏捷攻击卷轴
	Array(2041232, 30, 1, 1), //品克缤项链敏捷攻击卷轴
	Array(2041233, 30, 1, 1), //品克缤项链智力攻击卷轴
	Array(2046690, 30, 1, 1), //品克缤防具智力攻击卷轴
	Array(2041139, 30, 1, 1), //品克缤戒指智力攻击卷轴
	Array(2041235, 30, 1, 1), //品克缤项链力量攻击卷轴
	Array(2041145, 30, 1, 1), //品克缤戒指力量攻击卷轴
	Array(2040951, 30, 1, 1), //品克缤盾牌力量攻击卷轴
	Array(2046696, 30, 1, 1), //品克缤防具力量攻击卷轴
	Array(2040948, 30, 1, 1), //品克缤盾牌运气攻击卷轴
	Array(2040354, 30, 1, 1), //品克缤耳环运气攻击卷轴
	Array(2041142, 30, 1, 1), //品克缤戒指运气攻击卷轴
	Array(2041234, 30, 1, 1), //品克缤项链运气攻击卷轴
	Array(2046693, 30, 1, 1), //品克缤防具运气攻击卷轴
	Array(2040349, 30, 1, 1), //品克缤耳环敏捷攻击卷轴
	Array(2046687, 30, 1, 1), //品克缤防具敏捷攻击卷轴
	Array(2041136, 30, 1, 1), //品克缤戒指敏捷攻击卷轴
	Array(2041232, 30, 1, 1), //品克缤项链敏捷攻击卷轴
	Array(2041233, 30, 1, 1), //品克缤项链智力攻击卷轴
	Array(2046690, 30, 1, 1), //品克缤防具智力攻击卷轴
	Array(2041139, 30, 1, 1), //品克缤戒指智力攻击卷轴
	Array(2041235, 30, 1, 1), //品克缤项链力量攻击卷轴
	Array(2041145, 30, 1, 1), //品克缤戒指力量攻击卷轴
	Array(2040951, 30, 1, 1), //品克缤盾牌力量攻击卷轴
	Array(2046696, 30, 1, 1), //品克缤防具力量攻击卷轴
	Array(2049604, 50, 1, 1), //还原卷轴
	Array(2049603, 80, 1, 1), //还原卷轴50%
	Array(2049116, 100, 1, 1), //强化混沌卷轴
	Array(2022530, 100, 1, 1), //迎春花花语
	Array(1132171, 50, 1, 1), //诺巴凯伦腰带
	Array(1132172, 50, 1, 1), //诺巴利卡昂腰带
	Array(1132173, 50, 1, 1), //诺巴阿尔泰腰带
	Array(1132170, 50, 1, 1), //小暴君
	Array(1102480, 50, 1, 1), //小暴君
	Array(1102477, 50, 1, 1), //小暴君
	Array(1102478, 50, 1, 1), //小暴君
	Array(1102476, 50, 1, 1), //小暴君
	Array(1102479, 50, 1, 1), //小暴君
	Array(1072740, 50, 1, 1), //小暴君
	Array(1072741, 50, 1, 1), //小暴君
	Array(1072737, 50, 1, 1), //小暴君
	Array(1072738, 50, 1, 1), //小暴君
	Array(1072739, 50, 1, 1), //小暴君
	Array(1132170, 50, 1, 1), //小暴君
	Array(1102480, 50, 1, 1), //小暴君
	Array(1102477, 50, 1, 1), //小暴君
	Array(1102478, 50, 1, 1), //小暴君
	Array(1102476, 50, 1, 1), //小暴君
	Array(1102479, 50, 1, 1), //小暴君
	Array(1072740, 50, 1, 1), //小暴君
	Array(1072741, 50, 1, 1), //小暴君
	Array(1072737, 50, 1, 1), //小暴君
	Array(1072738, 50, 1, 1), //小暴君
	Array(1072739, 50, 1, 1), //小暴君
	Array(1132170, 50, 1, 1), //小暴君
	Array(1102480, 50, 1, 1), //小暴君
	Array(1102477, 50, 1, 1), //小暴君
	Array(1102478, 50, 1, 1), //小暴君
	Array(1102476, 50, 1, 1), //小暴君
	Array(1102479, 50, 1, 1), //小暴君
	Array(1072740, 50, 1, 1), //小暴君
	Array(1072741, 50, 1, 1), //小暴君
	Array(1072737, 50, 1, 1), //小暴君
	Array(1072738, 50, 1, 1), //小暴君
	Array(1072739, 50, 1, 1), //小暴君
	Array(1132170, 50, 1, 1), //小暴君
	Array(1102480, 50, 1, 1), //小暴君
	Array(1102477, 50, 1, 1), //小暴君
	Array(1102478, 50, 1, 1), //小暴君
	Array(1102476, 50, 1, 1), //小暴君
	Array(1102479, 50, 1, 1), //小暴君
	Array(1072740, 50, 1, 1), //小暴君
	Array(1072741, 50, 1, 1), //小暴君
	Array(1072737, 50, 1, 1), //小暴君
	Array(1072738, 50, 1, 1), //小暴君
	Array(1072739, 50, 1, 1), //小暴君
	Array(1132170, 50, 1, 1), //小暴君
	Array(1102480, 50, 1, 1), //小暴君
	Array(1102477, 50, 1, 1), //小暴君
	Array(1102478, 50, 1, 1), //小暴君
	Array(1102476, 50, 1, 1), //小暴君
	Array(1102479, 50, 1, 1), //小暴君
	Array(1072740, 50, 1, 1), //小暴君
	Array(1072741, 50, 1, 1), //小暴君
	Array(1072737, 50, 1, 1), //小暴君
	Array(1072738, 50, 1, 1), //小暴君
	Array(1072739, 50, 1, 1), //小暴君
	Array(4001326, 30, 1, 1), //红
	Array(4001327, 30, 1, 1), //橙
	Array(4001328, 30, 1, 1), //黄
	Array(4001329, 10, 1, 1), //绿
	Array(4001330, 10, 1, 1), //青
	Array(4001331, 10, 1, 1), //蓝
	Array(3010037, 200, 1, 1), //
	Array(1202193, 2, 1, 1), //轮回石碑
	Array(1113211, 1, 1, 1), //天堂气息
	Array(4001332, 10, 1, 1), //紫色蜡笔
	Array(1102476, 100, 1, 1) //秘密能手册

);


var txt = "            #e" + tz15 + "#r『高级转蛋机』 " + tz15 + "\r\n#k使用“#b1个#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。\r\n";
txt += "#d比普通转蛋机的几率要高200% #k现在要玩转蛋机么?\r\n";
txt += "#v3994417##v3994418##v3994419##v3994420##v3994421##v3994422##v3994423##v2048723##v1113211##v4001715##v1012319##v2614002##v2614001##v5062024##v2022530##v2431565##v1033000##v1202193##v2431559##v1132170##v2431572##v2049376#";
while(true){
	

	if(player.hasItem(5220040, 1)) {
		npc.sayNext(txt);
		
		if(player.getFreeSlots(1) < 1 || player.getFreeSlots(2) < 1 || player.getFreeSlots(3) < 1 || player.getFreeSlots(4) < 1 || player.getFreeSlots(5) < 1) {
			npc.say("请整理你的背包空间..");

		} else {
			var chance = Math.floor(Math.random() * 1000);
			var finalitem = Array();
			for(var i = 0; i < itemList.length; i++) {
				if(itemList[i][1] >= chance) {
					finalitem.push(itemList[i]);
				}
			}
			for(var i = 0; i < itemList2.length; i++) {
				if(itemList2[i][1] >= chance) {
					finalitem.push(itemList2[i]);
				}
			}
			for(var i = 0; i < itemList3.length; i++) {
				if(itemList3[i][1] >= chance) {
					finalitem.push(itemList3[i]);
				}
			}
			for(var i = 0; i < itemList4.length; i++) {
				if(itemList4[i][1] >= chance) {
					finalitem.push(itemList4[i]);
				}
			}
			for(var i = 0; i < itemList5.length; i++) {
				if(itemList5[i][1] >= chance) {
					finalitem.push(itemList5[i]);
				}
			}
			for(var i = 0; i < itemList6.length; i++) {
				if(itemList6[i][1] >= chance) {
					finalitem.push(itemList6[i]);
				}
			}
			if(finalitem.length != 0) {
				var random = new java.util.Random();
				var finalchance = random.nextInt(finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
				var notice = finalitem[finalchance][3];
				if(notice == 1) {
					var item = player.gainGachaponItem("高级转蛋机",itemId, quantity,  3);
				} else {
					player.gainItem(itemId, quantity);
				}
				player.loseItem(5220040, 1);
				npc.say("你获得了 #b#t" + itemId + "##k " + quantity + "个。");


			} else {
				player.loseItem(5220040, 1);
				player.gainItem(2614045, 1);
				npc.say("#r(获得了安慰奖：10万突破石头 50% 1颗。)\r\n今天的运气可真差，什么都没有拿到。");
				

			}
		}

	} else {
		txt += "———————————————————————— \r\n你背包里好像没有#b#t5220040##k哦!请进商城或通过其他活动获得!"
		npc.say(txt);

	}
}