/**
* 抽獎  QQ:739977676 
*
* 機制說明： 抽獎首先會生成0-100的隨機數，獎品里面幾率大于這個數的才會進入最終獎池，最終獲得的獎品將在最終獎池里面隨機獲得一個。
*
**/

let type = 1;// 1=點券 2=抵用 3=金幣 4=余額 物品ID=材料抽獎
let needNum = 200000;//需要數量
let title = "";
let haveMoney = 0;

//獎品
let laba = 99;//公告喇叭需要的幾率
let items = Array(
	//物品ID 數量 幾率(幾率請寫100以下,只有幾率在laba以下的才會喇叭公告)
	Array(3018112,1, 50), //時間掌控者
	Array(3018300,1, 98), //可妮兔沙發
	Array(3018301,1, 98), //布朗熊沙發
	Array(3018302,1, 98), //丘可沙發沙發
	Array(3018303,1, 98), //蛙里奧沙發
	Array(3010007,1, 100), //粉色海豹靠墊
	Array(3010008,1, 100), //藍色海豹靠墊
	Array(3010010,1, 100), //白色海豹靠墊
	Array(3010012,1, 100), //劍士寶座
	Array(3010019,1, 100), //壽司椅	
	Array(3010021,1, 100), //暖暖桌
	Array(3010024,1, 100), //玩具粉熊椅
	Array(3010026,1, 100), //惡靈附身的娃娃椅子
	Array(3010028,1, 100), //海盜的俘虜
	Array(3010029,1, 100), //藍環凳
	Array(3010030,1, 100), //黑環凳
	Array(3010031,1, 100), //紅環凳
	Array(3010032,1, 100), //黃環凳
	Array(3010033,1, 100), //綠環凳
	Array(3010034,1, 100), //悠長假期(紅色)
	Array(3010035,1, 100), //悠長假期(藍色)
	Array(3010036,1, 100), //浪漫秋千
	Array(3010037,1, 100), //豬豬凳
	Array(3010038,1, 100), //空氣沙發
	Array(3010039,1, 100), //黑色海狗靠墊
	Array(3010040,1, 100), //蝙蝠椅
	Array(3010041,1, 100), //骷髏王座
	Array(3010043,1, 100), //魔女的飛掃把
	Array(3010044,1, 100), //同一紅傘下
	Array(3010045,1, 100), //寒冰椅子
	Array(3010046,1, 100), //紅龍椅
	Array(3010047,1, 100), //藍龍椅
	Array(3010048,1, 100), //圣誕樹椅子
	Array(3010049,1, 100), //雪房子
	Array(3010050,1, 100), //公主凳
	Array(3010051,1, 100), //沙漠兔子1靠墊
	Array(3010052,1, 100), //沙漠兔子2靠墊
	Array(3010050,1, 100), //3兔子紀念版椅子
	Array(3010054,1, 100), //呼嚕呼嚕床
	Array(3010055,1, 100), //冰雪糕丸子椅
	Array(3010057,1, 100), //血色玫瑰
	Array(3010058,1, 100), //世界末日
	Array(3010059,1, 100), //甜甜的零食王座
	Array(3010060,1, 100), //初心凳
	Array(3010061,1, 100), //楓樹下
	Array(3010062,1, 100), //竹凳
	Array(0301006,1, 100), //3月亮星星抱枕椅
	Array(3010068,1, 100), //露水椅子
	Array(3010069,1, 100), //大黃風
	Array(3010070,1, 100), //巨無霸品克繽
	Array(3010071,1, 100), //神獸椅
	Array(3010075,1, 100), //我為音樂狂
	Array(3010077,1, 100), //貓頭鷹椅子
	Array(3010078,1, 100), //大熊貓椅子
	Array(3010079,1, 100), //肥貓貓椅子
	Array(3010080,1, 100), //柿子樹鞦韆
	Array(3010085,1, 100), //鬼娃娃椅子
	Array(3010086,1, 100), //夢境沙發
	Array(3010093,1, 100), //鮮美的火雞
	Array(3010094,1, 100), //漂漂豬椅子
	Array(3010095,1, 100), //石頭人座椅
	Array(3010096,1, 100), //恐龍化石寶座
	Array(3010097,1, 100), //堅固的木椅
	Array(3010098,1, 100), //電視宅人
	Array(3010099,1, 100), //北極熊椅子
	Array(3010100,1, 100), //財神椅子
	Array(3010106,1, 100), //雪狼戰椅
	Array(3010107,1, 100), //龍龍的蛋殼椅
	Array(3010108,1, 100), //幼龍秋千
	Array(3010110,1, 100), //舒適大白熊椅子
	Array(3010111,1, 100), //虎虎生威
	Array(3010112,1, 100), //情書柜子
	Array(3010115,1, 100), //熊寶寶床
	Array(3010116,1, 100), //搖滾之魂椅子
	Array(3010117,1, 100), //魔法書椅子
	Array(3010118,1, 100), //糖果音符椅子
	Array(3010119,1, 100), //羊羊椅子
	Array(3010120,1, 100), //彩蛋籃子
	Array(3010123,1, 100), //夏日花朵
	Array(3010124,1, 100), //都納斯噴氣椅子
	Array(3010125,1, 100), //尼貝隆戰艦椅
	Array(3010126,1, 100), //蝙蝠魔王座
	Array(3010127,1, 100), //扎昆寶座
	Array(3010128,1, 100), //黑龍王座
	Array(3010129,1, 100), //酋長寶座
	Array(3010133,1, 100), //帳篷椅
	Array(3010135,1, 100), //節日獨角獸椅子
	Array(3010136,1, 100), // 6周年怪物王座
	Array(3010137,1, 100), //神龍椅子
	Array(3010138,1, 100), //君主休憩椅
	Array(3010139,1, 100), //私密空間
	Array(3010140,1, 100), //早日康復床
	Array(3010141,1, 100), //蛋糕椅子
	Array(3010142,1, 100), //水族館椅子
	Array(3010144,1, 100), //七夕椅子
	Array(3010149,1, 100), //貓咪風扇椅
	Array(3010151,1, 100), //無人島椅子	
	Array(3010152,1, 100), //黃三角帳篷椅
	Array(3010154,1, 100), //機械椅子
	Array(3010155,1, 100), //暗影雙刀的貓頭鷹椅子
	Array(3010156,1, 100), //浮游飛行器
	Array(3010157,1, 100), //家族椅子
	Array(3010161,1, 100), //鼠鼠椅
	Array(3010162,1, 100), //果月椅子
	Array(3010163,1, 100), //滿月椅
	Array(3010166,1, 100), //雙刀同門
	Array(3010167,1, 100), //豪華鮮奶蛋糕
	Array(3010168,1, 100), //友誼萬歲椅子
	Array(3010169,1, 100), //紙箱里“求領養”
	Array(3010170,1, 100), //雪夜椅子
	Array(3010171,1, 100), //過來抱抱椅
	Array(3010172,1, 100), //星空椅子
	Array(3010173,1, 100), //萬圣節塔羅椅子
	Array(3010174,1, 100), //女巫煉藥椅
	Array(3010175,1, 100), //名畫家椅子
	Array(3010177,1, 100), //手柄座椅
	Array(3010179,1, 100), //燕尾服貓咪椅
	Array(3010180,1, 100), //血量椅子
	Array(3010181,1, 100), //MP椅子
	Array(3010182,1, 100), //兔子家族椅
	Array(3010183,1, 100), //胡蘿卜椅子
	Array(3010184,1, 100), //冰釣椅子
	Array(3010185,1, 100), //小伙伴品克繽
	Array(3010188,1, 100), //班·雷昂椅子
	Array(3010189,1, 100), //克里塞椅子
	Array(3010193,1, 100), //伊芙麗思的煉金瓶
	Array(3010194,1, 100), //野營篝火椅子
	Array(3010195,1, 100), //無價之寶椅子
	Array(3010196,1, 100), //泡泡浴缸椅
	Array(3010197,1, 100), //英雄的椅子-戰神
	Array(3010209,1, 100), //香草冰淇淋月餅椅子
	Array(3010210,1, 100), //草莓冰淇淋月餅椅子
	Array(3010211,1, 100), //精靈王座
	Array(3010212,1, 100), //藏獒椅子
	Array(3010217,1, 100), //香橙果凍布丁
	Array(3010218,1, 100), //喬克惡靈椅子
	Array(3010219,1, 100), //綿羊酋長椅子
	Array(3010220,1, 100), //我愛蛋糕椅子
	Array(3010221,1, 100), //我愛餡餅椅子
	Array(3010222,1, 100), //兔兔伴讀椅子
	Array(3010223,1, 100), //狗狗好乖椅
	Array(3010224,1, 100), //年糕冰淇淋椅子
	Array(3010225,1, 100), //品克繽椅子
	Array(3010279,1, 100), //鬼節南瓜椅子
	Array(3010280,1, 100), //水果椅子
	Array(3010281,1, 100), //猴子囚籠
	Array(3010282,1, 100), //送子仙鶴椅
	Array(3010283,1, 100), //飛毯椅
	Array(3010286,1, 100), //諾特勒斯椅子
	Array(3010287,1, 100), //精靈王座
	Array(3010288,1, 100), //珍珠蚌椅子
	Array(3010289,1, 100), //老人家讀童話椅子
	Array(3010290,1, 100), //惡魔軍團椅
	Array(3010291,1, 100), //	早日康復床（可交易）
	Array(3010292,1, 100), //暖爐椅（可交易）
	Array(3010293,1, 100), //喬克惡靈椅子（可交易）
	Array(3010294,1, 100), //黑色海豹靠墊（可交易）
	Array(3010295,1, 100), //金色海豹靠墊（可交易）
	Array(3010296,1, 100), //甜蜜的圣誕椅子
	Array(3010297,1, 100), //水晶月亮
	Array(3010298,1, 100), //白熊抱抱椅子
	Array(3010299,1, 100), //小幼龍椅子
	Array(3010300,1, 100), //橙色血量藥水椅子
	Array(3010303,1, 100), //加肥抱抱椅
	Array(3010304,1, 100), //惡魔綿羊椅子
	Array(3010305,1, 100), //玫紅手柄座椅
	Array(3010306,1, 100), //生如夏花椅子
	Array(3010308,1, 100), //四葉草
	Array(3010311,1, 100), //黑龍椅子
	Array(3010313,1, 100), //粉色扎昆椅子
	Array(3010318,1, 100), //噢我的女皇
	Array(3010354,1, 100), //與克里姆享受下午茶
	Array(3010355,1, 100), //外星鉆機椅子
	Array(3010356,1, 100), //溫馨荷花池
	Array(3010357,1, 100), //美容椅子
	Array(3010360,1, 100), //光之騎士椅子
	Array(3010361,1, 100), //購物小推車椅子
	Array(3010362,1, 100), //彩虹椅子
	Array(3010365,1, 100), //休彼德蔓的古代石掌椅子
	Array(3010400,1, 100), //水晶花園椅
	Array(3010401,1, 100), //幻影卡牌椅
	Array(3010402,1, 100), //生日派對椅
	Array(3010404,1, 100), //希拉的梳妝椅
	Array(3010405,1, 100), //擺鐘椅子
	Array(3010407,1, 100), //印第安酋長寶座
	Array(3010408,1, 100), //龍的傳人椅子
	Array(3010409,1, 100), //粽子椅子
	Array(3010410,1, 100), //艾麗莎的雙膝
	Array(3010411,1, 100), //魚尾獅椅子
	Array(3010412,1, 100), //雙子塔
	Array(3010414,1, 100), //荊棘椅子
	Array(3010415,1, 100), //熟睡鴨子椅
	Array(3010416,1, 100), //巨無霸白雪人
	Array(3010417,1, 100), //巨無霸企鵝王
	Array(3010421,1, 100), //發財椅
	Array(3010423,1, 100), //蘑菇朋友椅子
	Array(3010428,1, 100), //水晶椅子
	Array(3010432,1, 100), //仲夏可可島
	Array(3010434,1, 100), //熱帶夏日椅子
	Array(3010435,1, 100), //千年狐椅子
	Array(3010436,1, 100), //邪惡黑龍椅子	
	Array(3010437,1, 100), //魔法之書
	Array(3010440,1, 100), //尋找故鄉的月妙椅子
	Array(3010441,1, 100), //邪惡之毒椅子
	Array(3018245,1, 100), //企鵝王滑梯椅子
	Array(3018255,1, 100), //白色魔法師的記憶
	Array(3018246,1, 100), //冬夜里的我與貓椅子
	Array(3018247,1, 100), //某個圣誕節派對椅子
	Array(3018248,1, 100), //北極狐椅子
	Array(3018227,1, 100), //登上冰淇淋冰川椅子
	Array(3018228,1, 100), //箱子裡的小貓咪椅子
	Array(3018229,1, 100), //糖果雪人椅子
	Array(3018230,1, 100), //黑魔法師椅子
	Array(3010446,1, 100), //皮膚皇后椅子
	Array(3010447,1, 100), //睡覺小鳥椅子
	Array(3010448,1, 100), //泡泡浴椅子
	Array(3010449,1, 100), //痊癒10周椅子
	Array(3010450,1, 100), //艾莉珍椅子
	Array(3010453,1, 100), //兔子乘風椅
	Array(3010454,1, 100), //愛心云朵椅
	Array(3010455,1, 100), //扎昆的帝王椅子
	Array(3010456,1, 100), //杜鵑花椅子
	Array(3010457,1, 100), //拉尼婭野餐椅
	Array(3010458,1, 100), //翻滾兔子椅子
	Array(3010459,1, 100), //天使舞臺椅
	Array(3010460,1, 100), //爆竹椅子
	Array(3010461,1, 100), //賞月專用月桂樹秋千椅
	Array(3010462,1, 100), //羅曼蒂克天文臺
	Array(3010465,1, 100), //可愛音符椅子
	Array(3010490,1, 100), //紅色大象總統椅子
	Array(3010491,1, 100), //藍色毛驢總統椅子
	Array(3010492,1, 100), //首腦椅子
	Array(3010493,1, 100), //那就是我！
	Array(3010494,1, 100), // TV椅子
	Array(3010499,1, 100), //僵尸獵人座椅
	Array(3010505,1, 100), //和奧爾卡一起看棒球
	Array(3010506,1, 100), //萬圣節南瓜椅
	Array(3010510,1, 100), //貓咪針線籃椅子
	Array(3010511,1, 100), //貓咪公園椅子
	Array(3010512,1, 100), //和半半在一起
	Array(3010513,1, 100), //開心的皮埃爾
	Array(3010514,1, 100), //可怕的女王
	Array(3010515,1, 100), //奇石椅子
	Array(3010516,1, 100), //嚕嚕啦啦印第安小孩
	Array(3010517,1, 100), //印第安小孩的朋友
	Array(3010518,1, 100), //印第安元老的兄弟
	Array(3010543,1, 100), //魔力品克繽
	Array(3010544,1, 100), //熱帶夏日椅子
	Array(3010545,1, 100), //千年狐椅子
	Array(3010548,1, 100), //可愛音符椅子
	Array(3010563,1, 100), //月亮星星靠墊
	Array(3010584,1, 100), //圣誕節幻影椅
	Array(3010585,1, 100), //尖兵椅子
	Array(3010589,1, 100), //需要充電！
	Array(3010591,1, 100), //漫畫書椅子
	Array(3010592,1, 100), //布萊克繽椅子
	Array(3010593,1, 100), //新年快樂~
	Array(3010594,1, 100), //藍莓蛋糕椅
	Array(3010598,1, 100), //福袋椅子
	Array(3010599,1, 100), //偵探打字機椅子
	Array(3010600,1, 100), //福星月妙椅子
	Array(3010601,1, 100), //貓咪竹籃椅
	Array(3010603,1, 100), //雛祭娃娃1
	Array(3010604,1, 100), //雛祭娃娃2
	Array(3010605,1, 100), //雛祭娃娃3
	Array(3010609,1, 100), //不是在做夢
	Array(3010612,1, 100), //鏘鏘鏘椅子
	Array(3010620,1, 100), //怪蜀黍的泄憤桌
	Array(3010621,1, 100), //蛤蛤仙人椅
	Array(3010622,1, 100), //我的好友丹珍之椅
	Array(3010623,1, 100), //我的好友納奧之椅
	Array(3010624,1, 100), //電視椅子
	Array(3010631,1, 100), //金龍魚椅子
	Array(3010644,1, 100), //被關在鐵窗里的蒙奇
	Array(3010651,1, 100), //冒險島金剛（紅）
	Array(3010652,1, 100), //冒險島金剛（黑）
	Array(3010653,1, 100), //冒險島金剛（藍）
	Array(3010654,1, 100), //冒險島金剛（粉）
	Array(3010655,1, 100), //冒險島金剛（黃）
	Array(3010656,1, 100), //冒險島金剛（綠）
	Array(3010658,1, 100), //夏日西瓜冰椅子
	Array(3010659,1, 100), //巴士車站椅子
	Array(3010660,1, 100), //夢幻公主城堡椅子
	Array(3010662,1, 100), //章魚魚缸椅
	Array(3010664,1, 100), //進化椅子
	Array(3010670,1, 100), //絕對指環椅子
	Array(3010682,1, 100), //天文臺椅子
	Array(3010688,1, 100), //實驗室椅子
	Array(3010690,1, 100), //滑浪飛船椅子
	Array(3010700,1, 100), //大黃鴨椅子
	Array(3010703,1, 100), //彩虹椅子
	Array(3010704,1, 100), //懲戒之月妙椅子
	Array(3010705,1, 100), //月妙和水靈椅子
	Array(3010708,1, 100), //滿目韓文椅子
	Array(3010714,1, 100), //堆王冠
	Array(3010715,1, 100), //幸福9周年蛋糕氣球椅
	Array(3010716,1, 100), //超級蘑菇椅子
	Array(3010717,1, 100), //Marry me
	Array(3010718,1, 100), //初戀云朵朵沙發
	Array(3010719,1, 100), //小幽靈卡斯珀
	Array(3010720,1, 100), //勇士們，我愛你~
	Array(3010721,1, 100), //漫畫書椅子
	Array(3010722,1, 100), //僵尸獵人椅子
	Array(3010729,1, 100), //孤獨男椅子
	Array(3010732,1, 100), //翅膀自行車椅子
	Array(3010734,1, 100), //貓箱椅子
	Array(3010735,1, 100), //浪漫長椅
	Array(3010736,1, 100), //萌萌育嬰搖籃
	Array(3010737,1, 100), //動物英雄團椅子
	Array(3010738,1, 100), //閃電三人組椅子
	Array(3010739,1, 100), //雪人香波椅子
	Array(3010742,1, 100), //漢謨拉比法庭椅子
	Array(3010743,1, 100), //金字塔椅子
	Array(3010744,1, 100), //冒險島的磚頭朋友們
	Array(3010747,1, 100), //和風紙鳶椅子
	Array(3010748,1, 100), //日式拉面椅
	Array(3010750,1, 100), //焦糖布丁椅子
	Array(3010751,1, 100), //鯨魚椅子
	Array(3010752,1, 100), //玫瑰鳥籠
	Array(3010753,1, 100), //暖暖的被爐椅子
	Array(3010754,1, 100), //百鬼夜行
	Array(3010755,1, 100), //小丫丫坐便器椅子
	Array(3010756,1, 100), //新年招財貓椅子
	Array(3010757,1, 100), //你和我
	Array(3010758,1, 100), //林之靈椅子
	Array(0301076,1, 100), //0古代浴池椅子
	Array(3010761,1, 100), //古代戰車椅子
	Array(3010766,1, 100), //尖耳木椅
	Array(3010767,1, 100), //雪人椅子
	Array(3010779,1, 100), //金馬祥云轎
	Array(3010780,1, 100), //旋轉木馬
	Array(3010781,1, 100), //馬上有你
	Array(3010783,1, 100), //藍色邦尼屋
	Array(3010788,1, 100), //巨無霸年夜飯
	Array(3010789,1, 100), //爆竹聲聲
	Array(3010795,1, 100), //森林中休息處椅子
	Array(3010797,1, 100), //新春快樂椅子
	Array(3010799,1, 100), //墳墓幽靈椅子
	Array(3010806,1, 100), //桃櫻芳菲椅
	Array(3010810,1, 100), //火車旅行椅
	Array(3010811,1, 100), //嫩芽椅
	Array(3010813,1, 100), //愛情水晶球的回憶
	Array(3010814,1, 100), //粉絲抱枕椅子
	Array(3010815,1, 100), //單身部隊海報椅
	Array(3010820,1, 100), //迷你玩具別墅椅子
	Array(3010821,1, 100), //童年玩具箱椅子
	Array(3010822,1, 100), //貪吃鱷魚椅子
	Array(3010823,1, 100), //蘑菇智能手錶椅子
	Array(3010824,1, 100), //水星椅子
	Array(3010825,1, 100), //金星椅子
	Array(3010826,1, 100), //地球椅子
	Array(3010827,1, 100), //火星椅子
	Array(3010828,1, 100), //木星椅子
	Array(3010829,1, 100), //土星椅子
	Array(3010830,1, 100), //天王星椅子
	Array(3010831,1, 100), //海王星椅子
	Array(3015564,1, 100), //太陽椅
	Array(3010836,1, 100), //度假地奧拉夫椅子
	Array(3010837,1, 100), //溫泉奧拉夫椅子
	Array(3010838,1, 100), //冰城堡椅子
	Array(3010842,1, 100), //貓貓郊游房車
	Array(3010843,1, 100), //兔兔郊游房車
	Array(3010844,1, 100), //麻辣教室椅子
	Array(3010845,1, 100), //小金豬椅子
	Array(3010848,1, 100), //紅地毯主人公椅子
	Array(3010849,1, 100), //最佳新人椅子
	Array(3010850,1, 100), //潮流評論家椅子
	Array(3010851,1, 100), //夏日沁飲椅子
	Array(3010853,1, 100), //心花怒放椅子
	Array(3010854,1, 100), //神秘怪物共聚一堂！
	Array(3010863,1, 100), //憤怒的美發師椅子
	Array(3010864,1, 100), //紫色妖姬王座
	Array(3010865,1, 100), //扎昆點贊椅
	Array(3010876,1, 100), //冒險島行星椅子
	Array(3010877,1, 100), //人魚珊瑚礁
	Array(3010878,1, 100), //足球助威椅
	Array(3010879,1, 100), //繁星椅子
	Array(3010894,1, 100), //一杯咖啡的悠閑
	Array(3010895,1, 100), //阿卡伊勒童話書椅子
	Array(3010896,1, 100), //我的女皇椅子
	Array(3010898,1, 100), //迷你神獸椅子
	Array(3010935,1, 100), //狗狗酣睡椅子
	Array(3010936,1, 100), //青蛙跳樓機
	Array(3010947,1, 100), //與飛龍在天派一起
	Array(3010948,1, 100), //與虎嘯九天派一起
	Array(3010967,1, 100), //假面紳士海報椅子
	Array(3010968,1, 100), //假面紳士抱枕椅子
	Array(3010980,1, 100), //兔子箱椅子
	Array(3010983,1, 100), //家庭聚餐椅子
	Array(3010984,1, 100), //皇宮盛宴椅子
	Array(3010999,1, 100), //“主人，請用餐”椅子
	Array(3011000,1, 100), //釣魚用椅子
	Array(3012002,1, 100), //浴桶
	Array(3013000,1, 100), //櫻花樹下
	Array(3013002,1, 100), //煙花祭
	Array(3013007,1, 100), //蛇年團圓椅
	Array(3013008,1, 100), //第104期訓練兵團[小組椅子]
	Array(3013009,1, 100), //阿里山火車
	Array(3014000,1, 100), //驚人漫畫椅子
	Array(3014001,1, 100), //完美漫畫椅子
	Array(3014002,1, 100), //擊掌漫畫椅子
	Array(3014003,1, 100), //封面模特椅子
	Array(3014004,1, 100), //案件聚焦椅子
	Array(3014006,1, 100), //南國度假信息椅子
	Array(3014009,1, 100), //黑板椅子
	Array(3014010,1, 100), //捕獲僵尸拍立得
	Array(3014011,1, 100), //MVP鉆石椅子
	Array(3014012,1, 100), //富士山下椅子
	Array(3014013,1, 100), //與前來射手村兜風的怪物們合影！
	Array(3014014,1, 100), //射手村演出照
	Array(3014015,1, 100), //廢棄
	Array(3014016,1, 100), //阿里
	Array(3014017,1, 100),  //時間神殿
	Array(3014018,1, 100), //林中之城
	Array(3014019,1, 100), //V霓虹版椅子
	Array(3014020,1, 100), //決戰巔峰者
	Array(3014021,1, 100), //和你一同的春季踏青
	Array(3014022,1, 100), //和你一同密室逃脫之日
	Array(3014023,1, 100), //你還有那些怪物
	Array(3014024,1, 100), //在月色鵲橋相遇的那一天
	Array(3014027,1, 100), //小黑板椅子
	Array(3015000,1, 100), //玻璃瓶里的怪物
	Array(3015001,1, 100), //淘氣喵喵椅
	Array(3015002,1, 100), //七彩摩天輪椅子
	Array(3015006,1, 100), //圣誕禮物椅
	Array(3015007,1, 100), //花蘑菇的圣誕節
	Array(3015008,1, 100), //獻出心臟的敬禮
	Array(3015009,1, 100), //小蘋果椅子
	Array(3015011,1, 100), //與兒時伙伴同在
	Array(3015013,1, 100), //立體機動訓練中！
	Array(3015028,1, 100), //燈泡里的人魚
	Array(3015029,1, 100), //宇宙沖撞椅
	Array(3015030,1, 100), //與南哈特的回憶椅
	Array(3015031,1, 100), //閃耀冒險島椅
	Array(3015032,1, 100), //寒冰萌動火車椅
	Array(3015033,1, 100), //福袋萌動火車椅
	Array(3015034,1, 100), //和羊咩咩一起椅子
	Array(3015036,1, 100), //圣誕節椅子
	Array(3015046,1, 100), //傳說中的獅獸椅子
	Array(3015047,1, 100), //壓歲錢萬歲！
	Array(3015048,1, 100), //碧歐蕾塔莎啦啦火車椅
	Array(3015049,1, 100), //黑色天堂火車椅
	Array(3015050,1, 100), //火車頭椅
	Array(3015051,1, 100), //巨無霸國際巨星
	Array(3015053,1, 100), //松軟三重綿羊椅
	Array(3015054,1, 100), //愛之騎士椅
	Array(3015055,1, 100), //血腥瑪麗椅
	Array(3015056,1, 100), //死亡騎士椅
	Array(3015057,1, 100), //煙花綻放椅子
	Array(3015058,1, 100), //五彩繽紛花車巡游椅
	Array(3015059,1, 100), //浪漫甜心巧克力椅子
	Array(3015060,1, 100), //五彩糖罐椅子
	Array(3015061,1, 100), //單身情侶椅
	Array(3015062,1, 100), //NENE炸雞翅椅
	Array(3015064,1, 100), //冰雪箱椅子
	Array(3015075,1, 100), //鏟雪狂人椅子
	Array(3015076,1, 100), //雛祭娃娃4
	Array(3015077,1, 100), //雛祭娃娃5
	Array(3015078,1, 100), //雛祭娃娃6
	Array(3015080,1, 100), //被蛋卷椅子
	Array(3015083,1, 100), //萌動年糕湯火車椅
	Array(3015089,1, 100), //訓練師庭院椅
	Array(3015090,1, 100), //單身之王椅
	Array(3015091,1, 100), //巧克力湯椅子
	Array(3015092,1, 100), //卡卡隆與巧克力工廠椅
	Array(3015096,1, 100), //羊羊幻想牧場椅子
	Array(3015098,1, 100), //花蘑菇偽裝椅子
	Array(3015099,1, 100), //扎納羅非偽裝椅子
	Array(3015100,1, 100), //奧爾卡的布偶兔椅子
	Array(3015109,1, 100), //花花幻想曲
	Array(3015114,1, 100), //情侶部隊海報椅（女）
	Array(3015118,1, 100), //希拉和麥格納斯
	Array(3015119,1, 100), //突擊！伊莉娜樂隊椅子
	Array(3015129,1, 100), //白色天堂椅子
	Array(3015130,1, 100), //土豪嬰兒推車
	Array(3015131,1, 100), //巨大鼻涕泡椅子
	Array(3015132,1, 100), //大粽子沙發椅
	Array(3015142,1, 100), //武士精神椅子
	Array(3015143,1, 100), //巨大彩色金魚標本椅子
	Array(3015155,1, 100), //火焰之斯烏椅子
	Array(3015177,1, 100), //壽司公仔椅子
	Array(3015178,1, 100), //螢火之森椅子
	Array(3015181,1, 100), //仲夏夜之夢椅子
	Array(3015182,1, 100), //蝶戀花椅子
	Array(3015183,1, 100), //綠水靈背景椅子
	Array(3015193,1, 100), //被馴服的鯨魚椅子
	Array(3015195,1, 100), //鬼狐椅子
	Array(3015197,1, 100), //閃耀冒險島椅
	Array(3015210,1, 100), //喜歡奶酪！
	Array(3015211,1, 100), //櫻花陶醉椅子
	Array(3015224,1, 100), //夢幻水晶球椅子
	Array(3015225,1, 100), //和大象一起自拍椅子
	Array(3015227,1, 100), //與莫拉野餐椅子
	Array(3015228,1, 100), //暴力熊人偶裝椅子
	Array(3015229,1, 100), //刀疤獅王人偶裝椅子
	Array(3015234,1, 100), //少年沙灘聚會
	Array(3015236,1, 100), //粉色蛙漂流椅子
	Array(3015240,1, 100), //武陵道場縮微椅子
	Array(3015241,1, 100), //與稻草人相伴椅子
	Array(3015243,1, 100), //嬰兒車椅子
	Array(3015244,1, 100), //超能力者椅子
	Array(3015245,1, 100), //刀劍椅子
	Array(3015246,1, 100), //土豪金幣椅子
	Array(3015247,1, 100), //戰鬥吧！傳說之回歸椅子
	Array(3015248,1, 100), //孤獨旅行者椅子
	Array(3015257,1, 100), //月下庭院椅子
	Array(3015258,1, 100), //兔兒爺爺虎虎椅子
	Array(3015259,1, 100), //兔兒爺爺的腿座
	Array(3015260,1, 100), //兔兒奶奶的腿座
	Array(3015262,1, 100), //滿月清輝椅子
	Array(3015263,1, 100), //黃色蛙漂流椅子
	Array(3015264,1, 100), //今天我是主婦椅子
	Array(3015272,1, 100), //紫色蛙漂流椅子
	Array(3015273,1, 100), //羊羊疊疊樂
	Array(3015274,1, 100), //國慶節噴泉椅子
	Array(3015276,1, 100), //拳王烏魯斯椅子
	Array(3015277,1, 100), //烏魯斯打獵椅子
	Array(3015278,1, 100), //烏魯斯貪吃椅子
	Array(3015279,1, 100), //霸王的王座
	Array(3015286,1, 100), //瘋人院拘束衣
	Array(3015287,1, 100), //瘋人院手術臺
	Array(3015288,1, 100), //瘋人院治療椅
	Array(3015295,1, 100), //紳士青鳥花園
	Array(3015297,1, 100), //人生逆轉！興夫椅子
	Array(3015298,1, 100), //冒險島金剛（紅）
	Array(3015300,1, 100), //人魚的珊瑚礁
	Array(3015302,1, 100), //安德洛墨達椅子
	Array(3015303,1, 100), //幸福繡花鞋椅子
	Array(3015304,1, 100), //嘩啦啦大水車
	Array(3015309,1, 100), // I want you椅子
	Array(3015310,1, 100), //塞維利亞西班牙廣場椅子
	Array(3015316,1, 100), //突擊！伊莉娜樂隊椅子
	Array(3015317,1, 100), //國慶節噴泉椅子
	Array(3015325,1, 100), //夜晚滿月椅子
	Array(3015326,1, 100), //叮當疊羅漢椅子
	Array(3015328,1, 100), //冒險島電動纜車椅子
	Array(3015329,1, 100), //妖怪壇椅子
	Array(3015330,1, 100), //我不怕！（哼）
	Array(3015331,1, 100), //貓咪紙屋
	Array(3015332,1, 100), //魅惑九尾狐
	Array(3015333,1, 100), //降靈術毛莫
	Array(3015338,1, 100), //秘密花園椅子
	Array(3015341,1, 100), //黑貓房車
	Array(3015342,1, 100), //冬眠椅子
	Array(3015343,1, 100), //冰雪企鵝王椅子
	Array(3015344,1, 100), //僵尸獵人椅子
	Array(3015346,1, 100), //與精英南瓜僵尸相伴
	Array(3015349,1, 100), //青蛙搖搖機椅子
	Array(3015350,1, 100), //黑色天堂玩具椅
	Array(3015354,1, 100), //冒險島微博椅子
	Array(3015367,1, 100), //斯烏鐵粉椅子
	Array(3015374,1, 100), //射手村豬豬占卜椅子
	Array(3015375,1, 100), //埃德爾斯坦熔鉛占卜椅子
	Array(3015376,1, 100), //東方明珠占卦椅子
	Array(3015377,1, 100), //里恩冰川占卜椅子
	Array(3015380,1, 100), //蕉蕉仙人椅
	Array(3015382,1, 100), //飛翔吧！悟空椅子
	Array(3015383,1, 100), //泡溫泉椅子
	Array(3015384,1, 100), //金咕隆咚伸縮棒椅子
	Array(3015385,1, 100), //日式傳統茶椅子
	Array(3015386,1, 100), //英式紅茶椅子
	Array(3015394,1, 100), //雪龜島釣魚椅子
	Array(3015395,1, 100), //鮮嫩的海鮮椅子
	Array(3015401,1, 100), //來咬我呀~
	Array(3015408,1, 100), //玩具國的主人公
	Array(3015415,1, 100), //猴子椅子
	Array(3015416,1, 100), //溫暖的溫泉入場券
	Array(3015419,1, 100), //外灘爆竹椅子
	Array(3015424,1, 100), //超級餃子椅子
	Array(3015425,1, 100), //和猴子一起擊鼓椅子
	Array(3015426,1, 100), //和猴子一起面具舞椅子	
	Array(3015427,1, 100), //和猴子一起玩麻將椅子
	Array(3015428,1, 100), //和猴子一起放煙花椅子
	Array(3015429,1, 100), //享受冬季的秋千椅子
	Array(3015430,1, 100), //年獸椅子
	Array(3015431,1, 100), //冒險島電動車椅子
	Array(3015436,1, 100), //竹野子椅子
	Array(3015437,1, 100), //被吞沒的世界椅子
	Array(3015438,1, 100), //阿布拉克薩斯椅子
	Array(3015439,1, 100), //木偶戲椅子
	Array(3015440,1, 100), //錢多多椅子
	Array(3015443,1, 100), //打倒小羊駝椅子
	Array(3015447,1, 100), //怪物捕捉椅子
	Array(3015448,1, 100), //解除怨恨椅子
	Array(3015449,1, 100), //守護戰士
	Array(3015450,1, 100), //黑暗追隨者
	Array(3015451,1, 100), //呆萌兔兔靠墊椅
	Array(3015461,1, 100), //孤獨旅行者椅子
	Array(3015468,1, 100), //超越石椅子
	Array(3015473,1, 100), //搖擺種子椅子
	Array(3015474,1, 100), //花田窗戶
	Array(3015481,1, 100), //輕功箱椅子
	Array(3015482,1, 100), //沉睡的鴨子椅子
	Array(3015516,1, 100), //草莓星的主人
	Array(3015518,1, 100), // 13周年周五椅子
	Array(3015519,1, 100), //蕉蕉仙人椅
	Array(3015525,1, 100), //偵探團放大鏡椅子
	Array(3015526,1, 100), //藍天奇妙幻想椅子
	Array(3015529,1, 100),  //我和小雞雞椅子
	Array(3015538,1, 100), //露陷的粽子
	Array(3015541,1, 100), //品克繽冰淇淋雨傘
	Array(3015542,1, 100), //和超能力者在一起椅子
	Array(3015543,1, 100), //超能力者魔方椅子
	Array(3015545,1, 100), //玫瑰天使水晶瓶
	Array(3015547,1, 100), //銀色滿月椅子
	Array(3015551,1, 100), //布袋怪物扭蛋椅子
	Array(3015552,1, 100), //懸掛的景觀燈泡椅子
	Array(3015573,1, 100), // DJ吉姆的打碟臺
	Array(3015574,1, 100), //阿布拉克薩斯椅子
	Array(3015579,1, 100), //水流噴射推進器座椅
	Array(3015580,1, 100), //涼爽沙灘排球椅
	Array(3015581,1, 100), //水槍體驗椅子
	Array(3015582,1, 100), //騎士團椅子
	Array(3015583,1, 100), //反抗者椅子
	Array(3015585,1, 100), //極光白雪人椅子
	Array(3015586,1, 100), //白貝殼游泳圈椅子
	Array(3015587,1, 100), //皇后冰淇淋椅子
	Array(3015597,1, 100), //蘑菇神社賞月椅子
	Array(3015598,1, 100), //蘑菇神社蟬yu椅子
	Array(3015599,1, 100), //消防車椅子
	Array(3015600,1, 100), //努力的生意人椅子
	Array(3015604,1, 100), //音樂盛典DJ皮亞
	Array(3015605,1, 100), //音樂盛典DJ
	Array(3015606,1, 100), //音樂盛典DJ
	Array(3015607,1, 100), //音樂盛典DJ
	Array(3015608,1, 100), //音樂盛典DJ
	Array(3015609,1, 100), //音樂盛典DJ
	Array(3015610,1, 100), //妖精學院艾利涅椅子
	Array(3015611,1, 100), //地上樂園金海灘椅子
	Array(3015612,1, 100), //列娜海峽椅子
	Array(3015613,1, 100), //閉月羞花的碧歐蕾塔椅子
	Array(3015614,1, 100), //次元圖書館椅子
	Array(3015619,1, 100), //草莓城主椅子
	Array(3015620,1, 100), //黑色天堂玩具椅子
	Array(3015621,1, 100), //蘑菇神社賞花椅子
	Array(3015623,1, 100), //銀光滿月椅子
	Array(3015627,1, 100), //不死金剛棺材椅子
	Array(3015628,1, 100), //幽靈朋友椅子
	Array(3015629,1, 100), //我也是主角
	Array(3015630,1, 100), //記憶中的少女
	Array(3015631,1, 100), //尷尬的晚餐
	Array(3015632,1, 100), //和雪孩子一起
	Array(3015633,1, 100), //夢之都市椅子
	Array(3015636,1, 100), //燃情V椅
	Array(3015637,1, 100), //路西德的花
	Array(3015638,1, 100), //噴泉戲水椅子
	Array(3015643,1, 100), //啾啾島椅子
	Array(3015644,1, 100), //復古餐車椅子
	Array(3015645,1, 100), //古典餐車椅子
	Array(3015646,1, 100), //奢華餐車椅子
	Array(3015652,1, 100), //歡樂的回鄉路椅子
	Array(3015653,1, 100), //賞月椅子
	Array(3015655,1, 100), //小幽靈可可椅子
	Array(3015656,1, 100), //一個晴朗的日子
	Array(3015657,1, 100), //繽紛水果碗椅子
	Array(3015658,1, 100), //中秋煎餅椅子
	Array(3015659,1, 100), //倉鼠轉輪椅子
	Array(3015661,1, 100), //躲貓貓抽屜椅
	Array(3015662,1, 100), //烏鴉喝水椅子
	Array(3015663,1, 100), //訓民正音椅子
	Array(3015664,1, 100), //廢都塔的回憶
	Array(3015665,1, 100), //大海盜椅子
	Array(3015666,1, 100), //什麼時候長大椅子
	Array(3015667,1, 100), //秋季之湖椅子
	Array(3015670,1, 100), //饑餓的limos椅子
	Array(3015671,1, 100), //小型勇士之地椅子
	Array(3015674,1, 100), //小型童心之地椅子
	Array(3015675,1, 100), //圣誕爺爺椅子
	Array(3015687,1, 100), //不給糖就搗蛋椅子
	Array(3015688,1, 100), //萬圣節糖果大贏家椅子
	Array(3015689,1, 100), //特大萬圣節糖果椅子
	Array(3015690,1, 100), //與萬圣貓同在椅子
	Array(3015691,1, 100), //白雪人助手椅子
	Array(3015692,1, 100), //企鵝偵探椅子
	Array(3015693,1, 100), //蛋黃地震椅子
	Array(3015694,1, 100), //冰塊中的品克繽椅子
	Array(3015695,1, 100), //冰塊中的花蘑菇椅子
	Array(3015696,1, 100), //冰塊中的綠水靈椅子
	Array(3015697,1, 100), //冰塊中骷髏魚椅子
	Array(3015698,1, 100), //冰塊中的仙人掌椅子
	Array(3015699,1, 100), //冰塊中的漂漂豬
	Array(3015700,1, 100), //破蛋而出！新年快樂！
	Array(3015701,1, 100), //讓我們成為雪人吧
	Array(3015702,1, 100), //圣誕明信片椅子
	Array(3015703,1, 100), //馬卡龍甜蜜抱枕椅
	Array(3015704,1, 100), //古典手工椅子
	Array(3015705,1, 100), //古代守護兵椅子
	Array(3015706,1, 100), //露宿小雞椅子
	Array(3015707,1, 100), //小雞馬戲團椅子
	Array(3015708,1, 100), //白煙寥寥的蒸包椅子
	Array(3015710,1, 100), //喵喵塔
	Array(3015711,1, 100), //可愛的倉鼠小屋椅子
	Array(3015712,1, 100), //路西德的噩夢床
	Array(3015713,1, 100), //巧克力注入機椅子
	Array(3015714,1, 100), //好吃的巧克力面膜
	Array(3015715,1, 100), //和鵺一起巧克力派對
	Array(3015716,1, 100), //和兼信一起巧克力派對
	Array(3015717,1, 100), //情人節驚嚇箱椅子
	Array(3015721,1, 100), //貓咪們的最愛
	Array(3015725,1, 100), // 13周年回憶之樹
	Array(3015739,1, 100), //人氣爆棚的儲物柜
	Array(3015745,1, 100), //冒險島M明星
	Array(3015747,1, 100), //目標!在床上玩
	Array(3015748,1, 100), // 12月拿鐵椅子
	Array(3015749,1, 100), //冒險島5000天蛋糕椅
	Array(3015750,1, 100), //黑玫瑰秋千椅
	Array(3015753,1, 100), //大雪紛飛雪球椅
	Array(3015754,1, 100), //曉月光斬椅
	Array(3015755,1, 100), //召喚雪女椅
	Array(3015756,1, 100), //猛龍暴風椅
	Array(3015757,1, 100), //黑洞椅
	Array(3015758,1, 100), //靈獸盛宴椅
	Array(3015759,1, 100), //超星魔導椅子
	Array(3015760,1, 100), //新年森林晚會椅子
	Array(3015761,1, 100), //冒險島人氣之王
	Array(3015762,1, 100), // BEYOND椅子
	Array(3015763,1, 100), //和黃金雞蛋的回憶之椅
	Array(3015787,1, 100), //兔兔彩燈椅子
	Array(3015788,1, 100), //雪熊滑滑梯椅子
	Array(3015789,1, 100), //柿子樹椅子
	Array(3015790,1, 100), //喜鵲跳跳板椅子（女）
	Array(3015795,1, 100), //貪心的貓咪旅行車椅子
	Array(3015796,1, 100), //羊羊彈簧椅
	Array(3015797,1, 100), //我不是瓜子椅子
	Array(3015800,1, 100), // BBQ椅子
	Array(3015801,1, 100), // BEYOND之翼椅子
	Array(3015802,1, 100), //阿爾卡那精靈的木椅
	Array(3015803,1, 100), //灌籃高手椅子
	Array(3015810,1, 100), //狗狗野餐椅
	Array(3015811,1, 100), //動物救援隊椅子
	Array(3015812,1, 100), //花田里犯了錯
	Array(3015813,1, 100), //玻璃之城椅子
	Array(3015814,1, 100), //兔子巧克力椅子
	Array(3015817,1, 100), //舞動的花環椅子
	Array(3015818,1, 100), //中招了椅子
	Array(3015819,1, 100), //冒險王魅力椅
	Array(3015820,1, 100), //暗影樹的花
	Array(3015821,1, 100), //大櫻桃椅子
	Array(3015822,1, 100), //呱呱青蛙椅
	Array(3015823,1, 100), //旋轉木馬椅
	Array(3015837,1, 100), //廣告里的人是我!
	Array(3015838,1, 100), //只能看
	Array(3015840,1, 100), //粽香小童星葉船椅子
	Array(3015841,1, 100), //蝶兒飛椅子
	Array(3015842,1, 100), //宇宙光線槍椅子
	Array(3015844,1, 100), //絢爛云彩椅
	Array(3015845,1, 100), //發射星星椅子
	Array(3015846,1, 100), //石頭精靈椅子
	Array(3015847,1, 100), //探索火箭椅
	Array(3015848,1, 100), //被捕食者吞掉了！
	Array(3015849,1, 100), //埃爾露娜散步中
	Array(3015850,1, 100), //炸裂吧！間歇泉
	Array(3015857,1, 100), //冰凍星球椅
	Array(3015858,1, 100), //藍海星球椅
	Array(3015859,1, 100), // M-426椅
	Array(3015860,1, 100), //比特椅
	Array(3015861,1, 100), //米涅爾椅
	Array(3015862,1, 100), //拔蘿卜椅子
	Array(3015863,1, 100), //沙灘嬉戲椅子
	Array(3015864,1, 100), //綠水靈樂隊椅子
	Array(3015865,1, 100), //小小冒險島星球椅
	Array(3015866,1, 100), //埃爾露娜行星椅子
	Array(3015867,1, 100), //靈魂的重量椅子
	Array(3015869,1, 100), //大象蹺蹺板椅子
	Array(3015880,1, 100), //海岸秋千椅
	Array(3015886,1, 100), //在樹上搖搖欲墜
	Array(3015887,1, 100), //核心寶石椅
	Array(3015888,1, 100), //炎炎夏日椅子
	Array(3015890,1, 100), //幸福之門
	Array(3015892,1, 100), //黑玫瑰秋千椅
	Array(3015894,1, 100), //海洋安全要員椅子
	Array(3015895,1, 100), //粒粒都是精華椅子
	Array(3015899,1, 100), //擲骰大師椅
	Array(3015900,1, 100), //熊熊樂園噴泉
	Array(3015901,1, 100), //兔子星球椅子
	Array(3015902,1, 100), //泰國發佈紀念椅
	Array(3015903,1, 100), //黑暗萬圣節椅子
	Array(3015911,1, 100), //炸裂吧！間歇泉
	Array(3015913,1, 100), //絕對味覺椅子
	Array(3015934,1, 100), //和反抗者教官在海邊椅子
	Array(3015962,1, 100), //混沌莫拉斯之椅
	Array(3015965,1, 100), //胡子先森椅
	Array(3015966,1, 100), //狗狗野餐椅
	Array(3015968,1, 100), //小貓亂撞椅子
	Array(3015970,1, 100), //水晶馴鹿椅
	Array(3015971,1, 100), //雪兔椅子
	Array(3015975,1, 100), //激動特選影片椅
	Array(3015976,1, 100), //主人公椅子
	Array(3015990,1, 100), //小小冒險島星球椅
	Array(3015996,1, 100), //極限滑板椅子
	Array(3015999,1, 100), //流浪玩偶劇場
	Array(3016101,1, 100), //怪物水晶球秋千椅
	Array(3016000,1, 100), //大象蹺蹺板椅子
	Array(3015604,1, 100), //音樂盛典DJ皮亞椅子
	Array(3015605,1, 100), //音樂盛典沙子圖團椅子
	Array(3015606,1, 100), //音樂盛典后街吉姆椅子
	Array(3015607,1, 100), //音樂盛典DJ品克繽椅子
	Array(3015608,1, 100), //音樂盛典林中兄弟椅子
	Array(3015609,1, 100), //音樂盛典全明星椅子
	Array(3018002,1, 100), //非你莫屬椅子
	Array(3018308,1, 98), //黄金猪椅子	
	Array(3018307,1, 98) //猪猪椅子
	);
//展示出來的獎品
let showItems = Array(
	4000000,4000001
);

while(true){
	switch (type){
		case 1:
			title = "點券"
			haveMoney = parseInt(player.getCashShopCurrency(1));
			break;
		case 2:
			title = "抵用"
			haveMoney = parseInt(player.getCashShopCurrency(2));
			break;
		case 3:
			title = "金幣"
			haveMoney = "查閱背包";
			break;
		case 4:
			title = "余額"
			haveMoney = parseInt(getHyPay(1));
			break;
		default:
			title = "獎券";
			haveMoney = parseInt(player.getAmountOfItem(type));
			break;
	}
	let str = "\t\t\t\t\t#fs16##r#e"+title+"抽獎#fs12##n\r\n";
	str += type==3?"#b每次需要 #r"+needNum+" #b金幣":type>4?("#b擁有獎券 #v"+type+"##r "+haveMoney+" #b個,每次需要 #r"+needNum+" #b個"):("#b剩余 #r"+haveMoney+" #b"+title+" 每次需要 #r"+needNum+" #b"+title);
	str += "\r\n#e#r如果裡面沒有你想抽的椅子，歡迎回報\r\n"
	str += "\r\n#e#r獎品列表:\r\n"
	for(let i = 0;i<items.length;i++){
		str += "#v"+items[i][0]+"# "
	}
	str += "\r\n\t\t\t\t\t\t\t\t 是否抽獎？"
	let YN = npc.askYesNo(str);
	if(YN == 1){
		let canGet = false;
		if(type != 3 && haveMoney >= needNum){
			canGet = true;
		}else if(type == 3 && player.hasMesos(needNum)){
				canGet= true;
			}
		if(canGet){
			//抽獎
			let random = Math.floor(Math.random()*100);
			let finalItems = Array();
			for(let i = 0;i<items.length;i++){
				if(random < items[i][2]) finalItems.push(items[i]);
			}
			var random1 = Math.floor(Math.random()*finalItems.length);
			
			if(player.canGainItem(finalItems[random1][0],finalItems[random1][1])){
				switch (type){
					case 1:
						player.modifyCashShopCurrency(1,-needNum);
						break;
					case 2:
						player.modifyCashShopCurrency(2,-needNum);
						break;
					case 3:
						player.loseMesos(needNum);
						break;
					case 4:
						gainHyPay(-needNum)
						break;
					default:
						player.loseItem(type,needNum);
						break;
				}
				if(finalItems[random1][2] <= laba)
					player.gainGachaponItem("["+title+"抽獎]",finalItems[random1][0],finalItems[random1][1],1);
				else
					player.gainItem(finalItems[random1][0],finalItems[random1][1]);
				npc.say("抽取成功！獲得#v"+finalItems[random1][0]+"# x "+finalItems[random1][1]);
			}else{
				npc.say("無法抽取物品，請清理背包");
			}
			
		}else{
			npc.say("您的"+title+"不足！無法抽取");
			break;
		}
	}else{
		break;
	}
}



function getHyPay(type) {
    var sql = "select * from hypay where accname = '" + getAccountName() + "'";
    var push = player.customSqlResult(sql);
    if (push.size() > 0) {
        var result = push.get(0);
        if (type == 1) {
            var pay = result.get("pay");
        } else if (type == 2) {
            var pay = result.get("payUsed");
        } else if (type == 3) {
            var pay = result.get("payReward");
        }
    } else {
        player.customSqlInsert("INSERT INTO `hypay` (`accname`, `name`) VALUES ('" + getAccountName() + "', '" + player.getName() + "')");
        return getHyPay(1);
    }

    return pay;
}
function getAccountName() {
    var i = -1;
    var sql = "select name,id from accounts where id=" + player.getAccountId() + " order by name limit 1;";
    var push = player.customSqlResult(sql);
    if (push.size() > 0) {
        var result = push.get(0);
        var name = result.get("name");
    }

    return name;
}

function gainHyPay(count) {
    var sql = "update hypay set pay =pay+? where accname = '" + getAccountName() + "';";   
    player.customSqlUpdate(sql, count);
}