/*     
 *  
 *  
 *  功能:Custom Draw Chair
 *  
 *  @author NautMS 
 */

/* global cm */

var status = -1;
var psrw = Array(
Array(2430092, 1),//
Array(2430093, 1),//
Array(2430138, 1),//
Array(2430149, 1),//
Array(2430201, 1),//
Array(2430202, 1),//
Array(2430203, 1),//
Array(2430225, 1),//
Array(2430260, 1),//
Array(2430262, 1),//
Array(2430263, 1),//
Array(2430271, 1),//
Array(2430272, 1),//
Array(2430506, 1),//
Array(2430507, 1),//
Array(2430508, 1),//
Array(2430718, 1),//
Array(2430719, 1),//
Array(2430794, 1),//
Array(2430932, 1),//
Array(2430933, 1),//
Array(2430934, 1),//
Array(2430935, 1),//
Array(2430936, 1),//
Array(2430937, 1),//
Array(2430939, 1),//
Array(2430948, 1),//
Array(2431133, 1),//
Array(2431134, 1),//
Array(2431135, 1),//
Array(2431136, 1),//
Array(2431137, 1),//
Array(2431353, 1),//
Array(2431392, 1),//
Array(2431393, 1),//
Array(2431424, 1),//
Array(2431426, 1),//
Array(2431452, 1),//
Array(2431462, 1),//
Array(2431464, 1),//
Array(2431473, 1),//
Array(2431542, 1),//
Array(2431733, 1),//
Array(2431745, 1),//
Array(2431764, 1),//
Array(2431765, 1),//
Array(2431799, 1),//
Array(2431883, 1),//
Array(2431898, 1),//
Array(2432003, 1),//
Array(2432006, 1),//
Array(2432007, 1),//
Array(2432008, 1),//
Array(2432015, 1),//
Array(2432030, 1),//
Array(2432031, 1),//
Array(2432078, 1),//
Array(2432085, 1),//
Array(2432100, 1),//
Array(2432105, 1),//
Array(2432106, 1),//
Array(2432110, 1),//
Array(2432149, 1),//
Array(2432151, 1),//
Array(2432172, 1),//
Array(2432218, 1),//
Array(2432295, 1),//
Array(2432309, 1),//
Array(2432431, 1),//
Array(2432433, 1),//
Array(2432449, 1),//
Array(2432487, 1),//
Array(2432496, 1),//
Array(2432498, 1),//
Array(2432500, 1),//
Array(2432518, 1),//
Array(2432552, 1),//
Array(2432580, 1),//
Array(2432582, 1),//
Array(2432645, 1),//
Array(2432653, 1),//
Array(2432733, 1),//
Array(2432735, 1),//
Array(2432751, 1),//
Array(2432806, 1),//
Array(2432820, 1),//
Array(2432821, 1),//
Array(2432992, 1),//
Array(2432994, 1),//
Array(2432995, 1),//
Array(2432996, 1),//
Array(2432997, 1),//
Array(2432998, 1),//
Array(2432999, 1),//
Array(2433000, 1),//
Array(2433001, 1),//
Array(2433002, 1),//
Array(2433003, 1),//
Array(2433051, 1),//
Array(2433053, 1),//
Array(2433292, 1),//
Array(2433293, 1),//
Array(2433460, 1),//
Array(2433461, 1),//
Array(2433497, 1),//
Array(2433511, 1),//
Array(2433735, 1),//
Array(2433736, 1),//
Array(2433805, 1),//
Array(2433809, 1),//
Array(2433811, 1),//
Array(2433836, 1),//
Array(2433876, 1),//
Array(2433881, 1),//
Array(2433946, 1),//
Array(2434077, 1),//
Array(2434079, 1),//
Array(2434082, 1),//
Array(2434083, 1),//
Array(2434127, 1),//
Array(2434142, 1),//
Array(2434143, 1),//
Array(2434163, 1),//
Array(2434235, 1),//
Array(2434236, 1),//
Array(2434275, 1),//
Array(2434277, 1),//
Array(2434377, 1),//
Array(2434379, 1),//
Array(2434477, 1),//
Array(2434515, 1),//
Array(2434517, 1),//
Array(2434649, 1),//
Array(2434690, 1),//
Array(2434728, 1),//
Array(2434735, 1),//
Array(2434737, 1),//
Array(2434761, 1),//
Array(2434967, 1),//
Array(2435036, 1),//
Array(2435089, 1),//
Array(2435091, 1),//
Array(2435185, 1),//
Array(2435203, 1),//
Array(2435205, 1),//
Array(2435441, 1),//
Array(2435442, 1),//
Array(2435476, 1),//
Array(2435517, 1),//
Array(2435553, 1),//
Array(2435730, 1),//
Array(2435732, 1),//
Array(2435842, 1),//
Array(2435843, 1),//
Array(2435844, 1),//
Array(2435845, 1),//
Array(2435986, 1),//
Array(2436030, 1),//
Array(2436031, 1),//
Array(2436079, 1),//
Array(2436080, 1),//
Array(2436081, 1),//
Array(2436126, 1),//
Array(2436168, 1),//
Array(2436185, 1),//
Array(2436232, 1),//
Array(2436292, 1),//
Array(2436472, 1),//
Array(2436524, 1),//
Array(2436525, 1),//
Array(2436526, 1),//
Array(2436597, 1),//
Array(2436599, 1),//
Array(2436610, 1),//
Array(2436613, 1),//
Array(2436648, 1),//
Array(2436715, 1),//
Array(2436716, 1),//
Array(2436728, 1),//
Array(2436730, 1),//
Array(2436739, 1),//
Array(2436759, 1),//
Array(2436778, 1),//
Array(2436780, 1),//
Array(2436837, 1),//
Array(2436839, 1),//
Array(2436957, 1),//
Array(2437026, 1),//
Array(2437040, 1),//
Array(2437042, 1),//
Array(2437046, 1),//
Array(2437048, 1),//
Array(2437123, 1),//
Array(2437125, 1),//
Array(2437240, 1),//
Array(2437259, 1),//
Array(2437273, 1),//
Array(2437468, 1),//
Array(2437487, 1),//
Array(2437497, 1),//
Array(2437520, 1),//
Array(2437623, 1),//
Array(2437695, 1),//
Array(2437699, 1),//
Array(2437706, 1),//
Array(2437719, 1),//
Array(2437721, 1),//
Array(2437738, 1),//
Array(2437794, 1),//
Array(2437799, 1),//
Array(2437809, 1),//
Array(2437811, 1),//
Array(2437881, 1),//
Array(2437923, 1),//
Array(2437950, 1),//
Array(2438136, 1),//
Array(2438137, 1),//
Array(2438138, 1),//
Array(2438139, 1),//
Array(2438340, 1),//
Array(2438346, 1),//
Array(2438373, 1),//
Array(2438380, 1),//
Array(2438382, 1),//
Array(2438408, 1),//
Array(2438409, 1),//
Array(2438475, 1),//
Array(2438486, 1),//
Array(2438488, 1),//
Array(2438493, 1),//
Array(2438494, 1),//
Array(2438549, 1),//
Array(2438598, 1),//
Array(2438638, 1),//
Array(2438640, 1),//
Array(2438657, 1),//
Array(2438670, 1),//
Array(2438715, 1),//
Array(2438718, 1),//
Array(2438727, 1),//
Array(2438728, 1),//
Array(2438729, 1),//
Array(2438730, 1),//
Array(2438731, 1),//
Array(2438743, 1),//
Array(2438745, 1),//
Array(2438882, 1),//
Array(2438886, 1),//
Array(2438917, 1),//
Array(2439036, 1),//
Array(2439073, 1),//
Array(2439136, 1),//
Array(2439144, 1),//
Array(2439145, 1),//
Array(2439151, 1),//
Array(2439175, 1),//
Array(2439177, 1),//
Array(2439211, 1),//
Array(2439266, 1),//
Array(2439278, 1),//
Array(2439295, 1),//
Array(2439329, 1),//
Array(2439372, 1),//
Array(2439406, 1),//
Array(2439443, 1),//
Array(2439486, 1),//
Array(2439488, 1),//
Array(2439490, 1),//
Array(2439550, 1),//
Array(2439666, 1),//
Array(2439667, 1),//
Array(2439675, 1),//
Array(2439696, 1),//
Array(2439714, 1),//
Array(2439804, 1),//
Array(2439906, 1),//
Array(2439908, 1),//
Array(2630152, 1),//
Array(2630160, 1),//
Array(2630231, 1),//
Array(2630232, 1),//
Array(2630233, 1),//
Array(2630234, 1),//
Array(2630300, 1) //

        );
var rand = Math.floor(Math.random() * psrw.length);

var selection;



       selection = npc.askYesNo("#e#b欢迎来到坐骑联盟！\r\n这里可以抽取到各种精美的坐骑：\r\n#v2438598##v2438638##v2438640##v2438657##v2438670##v2438715##v2438718##v2438727##v2438728##v2438729##v2438730##v2438731##v2438743##v2438745##v2438882##v2438886##v2438917##v2439036##v2439073##v2439136##v2439144##v2439145##v2439151##v2439175##v2439177##v2439211##v2439266##v2439278##v2439295##v2439329##v2439372##v2439406##v2439443##v2439486##v2439488##v2439490##v2439550##v2439666##v2439667##v2439675##v2439696##v2439714##v2439804##v2439906##v2439908##v2630152##v2630160##v2630231##v2630232##v2630233#\r\n#b点击是即抽取，#r消耗5万点券\r\n");

        if (selection == 1) {
            var itemID = psrw[rand][0];
            var number = psrw[rand][1];
            if (player.getCashShopCurrency(1) < 50000) {
                npc.say("你没有10万点券");
            } else if (!player.canGainItem(itemID, number)) {
                npc.say("你保证你背包有足够空位.");
            } else {
				var item;
				item = player.gainGachaponItem("椅子抽奖", itemID, number, 13);
                player.modifyCashShopCurrency(1, -50000); //减少1个使用的情迷道具
				npc.broadcastWeatherEffectNotice(202,"天呐~这位土豪"+ player.getName() + "  抽取了" + getName(itemID) + "",60000);
				//npc.broadcastWeatherEffectNotice(200,"天呐~这位土豪"+ player.getName() + "  ",60000);
                npc.say("获取了 " + "#v" + itemID + "#" + "#z" + itemID + "# " + number + "个");
                
                //cm.broadcastDropMessage(0x27, "『椅子抽奖』 :      玩家 " + cm.getPlayer().getName() + "豪无人性，在椅子随机商店抽到了极品椅子");
            }
        }

function getName(itemid){
	var Item = player.makeItemWithId(itemid);
	if(Item==null){
		return null;
	}
	return Item.getName();
}