// Created by Jackson
// Quest ID:17636
// [凯梅尔兹共和国] 海盗王普赛依是谁


npc.sayNextS("我说莱文,普赛依是谁");
npc.sayNext("嗯?你竟然不知道 #r海盗王普赛依#k?");
npc.sayNextS("哎,你不是忘记了我是从别的地方来的了吧。");
npc.sayNext("嗯。你来到这里时间不长,不知道也是正常的。如果你有兴趣的话要听我说说吗?", 9390203);
npc.sayNext("凯梅尔兹不是以贸易为主而是以渔业为主的国家,这个我已经跟你说过了吧。", 9390203);
npc.sayNextS("是的,那个已经听说了。");
npc.sayNext("是的。从那时起至今凯梅尔兹沿岸一直受海盗骚扰。那些家伙小群小群地来抢掠。", 9390203);
npc.sayNext("可是,凯梅尔兹正式开始做贸易的同时为了减小受海盗的迫害有组织性的利用了这一点。", 9390203);
npc.sayNext("开始的时候还是有效果的。但是,海盗们也许也觉得再那样下去可不行,于是就以最厉害的海盗为中心团结起来,结果形成一个庞大的海盗团。", 9390203);
npc.sayNextS("那最厉害的海盗就是那叫普赛依的家伙吗?");
npc.sayNext("就是那样。结果回到了原点。", 9390203);
npc.completeQuest();
player.gainExp(953667);