// Created by Jackson
// Quest ID:17672
// [凯梅尔兹共和国] 洗脱嫌疑


npc.sayNextE("这人说的话都是事实。", 9390205);
npc.sayNextE("啊,这不是..克莱尔你怎么到这儿来了..!!", 9390206);
npc.sayNextE("原来是班·特来敏的女儿克莱尔啊。");
npc.sayNextE("是的,您好吗。首领大人。", 9390205);
npc.sayNextE("你怎么会来这里?你现在不是在海本王国留学...", 9390206);
npc.sayNextE("我的事情日后在另作禀报,父亲。首领大人,这人说的话全部都是事实。我也在一旁听得真真切切的,西温想陷害这几位的事实。", 9390205);
npc.sayNextE("那是事实吗?");
npc.sayNextE("是的,是事实。我还被他们绑架,多亏这几位的帮助才逃脱出来的。", 9390205);
npc.sayNextE("绑,绑架??岂,岂有此理...", 9390206);
npc.sayNextE("请镇静。特来敏。谢谢你重要的证言,克莱尔小姐。多亏了你救了两位差点儿枉受冤屈的年轻人。班·特来敏。你认为呢?你不会连你女儿的话都不相信了吧?");
npc.sayNextE("呃呃..好吧。先就那样吧。克莱尔!你跟我来!", 9390206);
npc.sayNextE("那么我就告辞了。下次再见。", 9390205);
npc.completeQuest();
player.gainExp(1058907);