// Created by Jackson
// Quest ID:17656
// [凯梅尔兹共和国] 与狼共舞（1）


npc.sayNext("即使知道了我是谁好像也不能改变各位的处境啊。");
npc.sayNextS("虽然是那样,但也得搞清楚是谁帮助了我们呀,不是吗。");
npc.sayNext("那就这样吧。如果你告诉我你是谁,我给你双倍的谢礼。", 9390202);
npc.sayNext("吼哦..那可真是很有吸引力哦。可是你现在有能力支付那笔金额吗?");
npc.sayNext("呃..其实现在眼前是有点困难..好像只能给你一半的金额。", 9390202);
npc.sayNext("好吧。其实我是...");
if (npc.askYesNoS("等会!!我感到这附近有很重的杀气!是狼群!快做好准备!!")) {
        npc.startQuest();
        npc.sayNext("这里有狼群??先赶紧消灭掉吧!得把女性的安全放在第一位!", 9390202);
} else {
        npc.say("在干嘛呢?现在还有什么这理由那理由的!赶快准备啊!", 9390202);
}