// Created by Jackson
// Quest ID:17635
// [凯梅尔兹共和国] 海上贸易的破坏者


npc.sayNext("啊, #h0#你休息好了吗?我感觉还是有点累。看你的脸色,好像你的疲劳也没有完全消失呢。");
npc.sayNextS("嗯,我还好啦。也因为这地方比较陌生,还没熟悉。");
npc.sayNext("统帅!大事不好了!", 9390217);
npc.sayNext("什么大事。又出了什么事?");
npc.sayNextS("(好像又出了什么事情... 要听听吗?)");
npc.sayNext("这次又是什么事?", 9390203);
npc.sayNext("据说,我们派去罗萨进行贸易的船只,受到了普赛依的攻击!!", 9390217);
npc.sayNext("什么?!该死的 #r普赛依#k又来捣乱!!", 9390203);
npc.sayNext("这次的损害好像比之前都要大。", 9390217);
npc.sayNext("应该是的吧。因为那是去罗萨的商船。唉!");
npc.sayNext("这究竟是第几次受害已经算不清了。难道不该想个什么对策吗。", 9390202);
npc.sayNextS("(那个叫普赛依的家伙又是谁。我得去问问。说不定又会有我能帮得上忙的事情。)");
npc.completeQuest();
player.gainExp(953667);
