// Created by Jackson
// Quest ID:17603
// [凯梅尔兹共和国] 伟大的(?) 探险家帕尔巴特


npc.sayNextE("请问你是探险家帕尔巴特吗？", true);
npc.sayNextE("你看见了我还不知道吗？冒险岛世界最伟大的探险家帕尔巴特在你面前你都认不出来，最近的年轻人真是……哎……！", 9390200);
npc.sayNextE("(……似乎是个性格很让人棘手的人啊。)", true);
npc.sayNextE("你是要去凯梅尔兹吧？", 9390200);
npc.sayNextE("是的……没错……", true);
npc.sayNextE("你打算怎么去呢？", 9390200);
npc.sayNextE("啊……？那个……探险家您不是准备了船只……", true);
npc.sayNextE("当然，我，伟大的帕尔巴特准备了船只。所以说，你打算怎么办呢？", 9390200);
npc.sayNextE("难道不是您……带我去吗……？", true);
npc.sayNextE("你这笨蛋，到底有没有耳朵啊！！！我的意思是，我把你带到凯梅尔兹，你会给我什么回报！\r\n因为那个老学究的委托，我准备了去凯梅尔兹的船，#e但是，你不应该详细地说一下你要做什么来作为代价吗？！#n", 9390200);
npc.sayNextE("(……老学究说的是南哈特吗……如果我回到圣地，我一定要让女皇教训一下南哈特！！)", true);
npc.sayNextE("这个嘛……抱歉啊，我现在没准备什么东西，但是我以后一定会好好地报答你的。赌上女皇的名誉。", true);
if (npc.askYesNoE("啧啧……所以说最近的年轻人都一样……你也和那个只是嘴上厉害的老学究没什么不一样！算了，你先坐上去吧。我会遵守约定，把你送到凯梅尔兹，你以后可别忘了回报哦！你得知道，我帕尔巴特亲自来给你驾船，一定会把你平安送到，这可是你的荣幸！\r\n#b(接受时立刻前往凯梅尔兹。)", 9390200)) {
        // Response is Yes
        npc.completeQuest();
        npc.rememberMap("UNITY_PORTAL");
        player.changeMap(865090003);
} else {
        npc.sayE("喂！你到了现在才这样可不行啊！我好不容易才准备好了船呢！", 9390200);
}