// Created by Jackson
// Quest ID:17637
// [凯梅尔兹共和国] 这次的事也由我来解决吧


npc.sayNext("首领,交给我的话,我就去击退普赛依。");
npc.sayNext("嗯?你吗?你和阿库旁多战斗回来都还没过多久呢", 9390203);
npc.sayNextS("(是的。说得对。)");
npc.sayNext("但是海上贸易不是我们最核心的最重要的部分嘛");
npc.sayNext("正因如此才更那个。当然你出色地阻挡了阿库旁多,但是普赛依跟阿库旁多小混混们可不一样。", 9390203);
npc.sayNextS("(对的。莱文还需要再修炼修炼...)");
npc.sayNext("可,可是..就是那样!我和#h0#一起去。#h0#的能力相当优秀一定能起到很大帮助的。");
npc.sayNextS("(嗯？可是，这家伙干嘛连我也...！！)");
npc.sayNext("又想借他人之手吗!!像你这样的家伙终究是没有发展可能的!!每次期待你会有所表现的时候就立刻让我感到失望!!", 9390203);
npc.sayNextS("(呃,怎么又是这种情况...吉尔伯特首领的话也有他的道理,可是这对我来说也是一个机会。)");
npc.sayNextS("首领,我和莱文一起去。");
npc.sayNext("上一次也是接受了你的帮助。这次要凭我们自己的力量来完成。", 9390203);
npc.sayNextS("上次我也说过了,虽然是友邦国家,但这次我作为莱文的朋友也想拜托你。");
npc.sayNext("嗯..如果这么说的话让我考虑考虑。", 9390203);
npc.startQuest();