/*  This is mada by yanran     
 *  
 *  脚本任务：[妖精学院艾利涅]第一个线索
 *  
 */

let selection = npc.askAccept("总觉得有个地方非常可疑。要去调查一下吗？");
if (selection == 1) {
        npc.sayNextS("#v4033828#\r\n\r\n（发现了未知的演出剧本。要稍微读一下吗？）", false);
        npc.sayNextS("[妖精的剧本]\r\n\r\n~第3章~\r\n\r\n帷幕升起，响起悲壮的音乐。\r\n\r\n幻影：（面对观众）啊啊，悲痛已经浸染了这个世界。你，恶毒的黑魔法师的军团长！我以怪盗的名义发誓，你将永无安宁之日。我怪盗幻影要取走的最后一件东西，既不是宝石，也不是美术品，而是你那不值钱的贱命。", false);
        npc.sayNextS("……？读读其他几页吧。", false);
        text = "[妖精的剧本]\r\n\r\n战神：（豪迈地）光之守护者啊，你赶快去吧！这里有我守着，就算敌人如海啸般涌来，也休想过我这关。\r\n夜光法师：（感叹地）以神之名义来讲，这天下再也找不到像你这么勇猛的战士了！你的勇猛可比天高。用你那斩杀了无数千数万敌人的武器消灭黑魔法师吧。\r\n\r\n灯光暗了下来，弗里德和双弩精灵在舞台的一侧登场。\r\n\r\n弗里德：喔，精灵女王啊！在您那灿烂光辉的魅力面前，连凶猛的野兽都会俯首称臣！能与你站在同一战场上，是我无上的荣幸。\r\n双弩精灵：你，龙神啊！让我们一起消灭黑魔法师吧。我们的战斗就如同离弦之箭一般，已经打响了。"
        npc.sayNextS(text, false);
        npc.sayNextS("孩子们怎么会有这种剧本……总之，先拿给库迪，看看他怎么说。\r\n（和#b#p1500013##k对话吧。）", false);
        if (player.canGainItem(4033828, 1)) {
                if (!player.hasItem(4033828, 1)) {
                        player.gainItem(4033828, 1);
                }
                npc.startQuest();
                //player.completeQuest(32111, 1500000);
        } else {
                npc.say("请确保你的其他栏有足够的空间。");
        }
} else {
        npc.say("好的，那么你先到处看下。");
}