/*  This is mada by yanran     
 *  
 *  脚本任务：[妖精学院艾利涅]库迪的提议
 *  
 */

npc.sayNext("你认为你能找到失踪的孩子吗？你打算怎么做？");
npc.sayNextS("#b我想看看孩子们住的房间。", false);
npc.sayNext("你认为你能在他们的东西里找到一些线索吗？那可能真的有用...");
npc.sayNext("你只是想从我们这里偷东西！伊瓦纳校长，我们不能听这些狡猾的陌生人的话！", 1500002);
npc.sayNext("我并没有完全信任他们，但这些学生的安全必须是我们的重中之重。我们别无选择，只能给他们留些余地。");
npc.sayNext("#b#h ##k. 我会准许你搜查学院。你只能住在二楼和三楼的宿舍。而且一定要小心。这所学院建有许多防御设施来抵御入侵者，考虑到目前的情况，我觉得没有必要让他们停止活动。");
npc.sayNext("我已经盯上你了，局外人。", 1500002);
npc.say("我们会找到那些珍贵的孩子，不管用什么方法！我在二楼见。\r\n#b(去艾林仙女学院二楼，见见小考蒂。)", 1500000);
npc.completeQuest();