/*  This is mada by yanran    
 *  
 *  功能：脚本任务：[妖精学院艾利涅]校长伊瓦纳的误会
 *  
 *  @Author yanran
 */

npc.sayNext("你还在这里。还有什么要讨论的吗？");
npc.sayNext("校长，你不能相信这个局外人！人类只会给我们谎言和蹩脚的借口。", 1500002);
npc.sayNextS("#b我以为你是一个聪明理性的人。在作出任何判断之前，我们应该分析事实。");
npc.sayNext("五个孩子一下子消失得无影无踪！你还需要什么其他的事实？这个绑架了他们，故事结束了！", 1500002);
npc.sayNextS("#b那么，你有证据证明库迪是罪魁祸首吗？");
npc.sayNext("你叫库迪的人已经多次被赶出这些地方，但他继续回来，无视我们的愿望。他一直在我们森林里进行秘密实验！", 1500002);
npc.sayNext("他一直在计划这个！这是完美的犯罪。在他终于从我们眼皮底下偷走孩子们之前，他来侦察了好几个星期！他知道我们有很多员工外出度假，后来我发现他在犯罪现场闲逛。他一定有罪！", 1500002);
npc.sayNextS("#b( 库迪真的策划了绑架五个孩子吗？他太小了！) ");
npc.sayNext("你的愿望是找到最合理的解释。我向你介绍，我们的首要主题是最理性的解释。我们必须审问他。");
npc.sayNextS("#b(他们太难过了，除了库迪，没有人会被视为嫌疑犯。最好和他谈谈...)");
npc.startQuest();