/*  This is mada by Yanran    
 *  
 *  功能：[啾啾岛]弥补缺失的那2%的味道
 *  
 *  @Author Yanran
 */

npc.sayNext("旅行者，多亏有你去搜集这些材料，我们才能完成料理。", 3003160);
npc.sayNext("先尝尝味道吧~", 3003160);
npc.sayNextS("话说…为什么只有我自己在忙着搜集材料啊…？", false);
npc.sayNextS("总之，猴姐、小鸡们，你们幸苦了。\r\n那我先尝尝味道吧！", false);
npc.sayNextS("吧嗒吧嗒....", false);
npc.sayNext("你不要只顾着吃，说说食物的味道啊！", 3003162);
npc.sayNext("怎么样？怎么样？穆托会喜欢吗？", 3003163);
npc.sayNextS("嗯....好吃！真的…很好吃，可是…！", false);
npc.sayNext("可是…？", 3003160);
npc.sayNextS("总觉得... #r缺少2%的#k味道…该怎么说呢，好像…太过#b清淡#k了？", false);
npc.sayNextS("我给穆托的三明治有种... #r垃圾食品#k的感觉，感觉吃下去后会有害健康的…那种味道。", false);
npc.sayNext("我也尝一口....\r\n嗯.... 我明白你在说什么了。", 3003160);
npc.sayNext("我还是第一次做这么大的失误，所以…#b味道没有掌握好#k...", 3003160);
npc.sayNextS("时间紧迫，我们先把这个拿过去吧？跟顶级大厨舔舔约定的时间已经所剩不多了。", false);
npc.sayNext("穆托的口味…跟小孩子差不多... 小孩子是不可能喜欢这么清淡的食物的...", 3003160);
npc.sayNextS("那该怎么办呢…？事已至此，应该没法添加那种#r刺激的味道#k了吧...", false);
npc.sayNext("不，方法并不是没有。", 3003160);
npc.sayNext("可是，猴姐，#r那样#k...太危险了…！", 3003163);
npc.sayNextS("究竟是…什么方法啊…？", false);
npc.sayNext("那是... 将#r呲溜树果实#k磨碎后放进去。", 3003160);
npc.sayNextS("啊…那这算不上是什么难事啊？我现在就去摘那果实！那#r呲溜树果实树#k在哪里？", false);
npc.sayNext("#r呲溜树#k只生长在呲溜森林最深处... 不过问题是.... #r呲溜树#k并不是普通的树...", 3003160);
npc.sayNext("#r呲溜树#k是非常强大的... #r食人树#k... 很难搜集#r呲溜果#k的原因就在于此...", 3003160);
npc.sayNext("就算是再强大的旅行者…也不能冒着生命危险去摘果实吧…？", 3003160);
npc.sayNext("不行吧…？", 3003162);
npc.sayNext("不行吧…？", 3003163);
npc.sayNext("不行吧…？", 3003164);
npc.sayNextS("哎…我必须要去啊。我…去去就回...", false);
npc.sayNext("勇士…让你去做这么危险的事……真的很抱歉... 还有...", 3003160);
npc.sayNextS("请不要担心，我很强的！（嫣：为了啾啾岛第一枚神秘徽章，豁出去吧！）", false);
npc.sayNext("不是啦... 呲溜果#b一定要连蒂#k一起摘下来…那里是…最好吃的...", 3003160);
npc.sayNextS("我知道了...", false);
npc.startQuest();