/*  This is mada by Yanran    
 *  
 *  功能：[啾啾岛]寻找艾尔谷的美味&amp;lt;1&gt;
 *  
 *  @Author Yanran
 */

npc.sayNext("嗅嗅~嗯~现在闻起来已经很不错了呢？", 3003163);
npc.sayNextS("是吧？只要在这上面放上面包，应该就能拿给穆托了。", false);
npc.sayNext("哎呀~ 旅行者你真是的~ 你忘记了#b最重要的东西#k~", 3003163);
npc.sayNextS("最重要的东西？那是什么？", false);
npc.sayNext("是#b海鲜#k啊，还缺了#b海鲜#k~\r\n缺了#b海鲜#k的料理还能被称为料理吗？", 3003163);
npc.sayNextS("已经放了肉饼了…还要放海鲜饼？那味道会很奇怪吧？", false);
npc.sayNext("旅行者，我什么时候说#b我想放海鲜饼#k了？", 3003163);
npc.sayNextS("啊…对了…你的性格比较暴躁...\r\n好的... 我们放海鲜吧…需要我去搜集什么呢？", false);
npc.sayNext("嗯~你真乖~旅行者，没想到你这么听话啊？哈哈", 3003163);
npc.sayNext("你只要去狩猎#b绿色猫鱼#k和#b蓝色猫鱼#k，搜集#i4034950:##z4034950:##i4034951:##z4034951:##k就行了~", 3003163);
npc.sayNext("嗯~你去先搜集大概20个吧！\r\n还有，艾尔谷流淌着激流像旅行者你这种#b不会飞的人#k就只能#b游泳了#k~当然如果你不会#b游泳#k…那就只能死…不，那你可能会遇到危险~", 3003163);
npc.sayNextS("嗯？你们会飞？", false);
npc.sayNext("哎呀~旅行者你也真是的~这么短的翅膀，怎么飞啊~你是在跟我开玩笑嘛？哈哈哈", 3003163);
npc.sayNextS("很…很抱歉，我去去就回。", false);
npc.startQuest();