status = -1;
var itemList = Array(
	//物品ID    获得概率数字越大概率越大
	Array(2591216, 500),//闪光的阿卡伊勒灵魂结晶
	Array(2591176, 500),//强大的扎昆灵魂结晶
	Array(2591177, 500),//闪光的扎昆灵魂结晶
	Array(2591215, 500),//强大的阿卡伊勒灵魂结晶
	Array(2591666, 500),//闪光的觉醒希拉灵魂结晶
	Array(2591665, 500),//强大的觉醒希拉灵魂结晶
	Array(2591247, 500),//闪光的希拉灵魂结晶
	Array(2591246, 500),//强大的希拉灵魂结晶
	Array(2591146, 500),//强大的品克缤灵魂结晶
	Array(2591145, 500),//华丽的品克缤灵魂结晶
	Array(2591185, 500),//闪光的希纳斯灵魂结晶
	Array(2591184, 500),//强大的希纳斯灵魂结晶
	Array(2591278, 500),//闪光的麦格纳斯灵魂结晶
	Array(2591277, 500),//强大的麦格纳斯灵魂结晶
	Array(2591466, 500),//闪光的斯乌灵魂结晶
	Array(2591465, 500),//强力的斯乌灵魂结晶
	Array(2591597, 500),//闪光的路西德灵魂结晶
	Array(2591596, 500),//强力的路西德灵魂结晶
	Array(2591647, 500),//闪光的威尔灵魂结晶
	Array(2591646, 500),//强力的威尔灵魂结晶
	Array(2591138, 500),//闪光的班·雷昂灵魂结晶
	Array(2591137, 500),//强大的班·雷昂灵魂结晶
	Array(2591442, 500),//闪光的半半灵魂结晶
	Array(2591441, 500),//强力的半半灵魂结晶
	Array(2591450, 500),//闪光的血腥女王灵魂结晶
	Array(2591449, 500),//强力的血腥女王灵魂结晶
	Array(2591458, 500),//闪光的贝伦灵魂结晶
	Array(2591457, 500),//强力的贝伦灵魂结晶
	Array(2591434, 500),//闪光的皮埃尔灵魂结晶
	Array(2591433, 500),//强力的皮埃尔灵魂结晶
	Array(2591216, 500),//闪光的阿卡伊勒灵魂结晶
	Array(2591176, 500),//强大的扎昆灵魂结晶
	Array(2591177, 500),//闪光的扎昆灵魂结晶
	Array(2591215, 500),//强大的阿卡伊勒灵魂结晶
	Array(2591666, 500),//闪光的觉醒希拉灵魂结晶
	Array(2591665, 500),//强大的觉醒希拉灵魂结晶
	Array(2591247, 500),//闪光的希拉灵魂结晶
	Array(2591246, 500),//强大的希拉灵魂结晶
	Array(2591146, 500),//强大的品克缤灵魂结晶
	Array(2591145, 500),//华丽的品克缤灵魂结晶
	Array(2591185, 500),//闪光的希纳斯灵魂结晶
	Array(2591184, 500),//强大的希纳斯灵魂结晶
	Array(2591278, 500),//闪光的麦格纳斯灵魂结晶
	Array(2591277, 500),//强大的麦格纳斯灵魂结晶
	Array(2591466, 500),//闪光的斯乌灵魂结晶
	Array(2591465, 500),//强力的斯乌灵魂结晶
	Array(2591597, 500),//闪光的路西德灵魂结晶
	Array(2591596, 500),//强力的路西德灵魂结晶
	Array(2591647, 500),//闪光的威尔灵魂结晶
	Array(2591646, 500),//强力的威尔灵魂结晶
	Array(2591138, 500),//闪光的班·雷昂灵魂结晶
	Array(2591137, 500),//强大的班·雷昂灵魂结晶
	Array(2591442, 500),//闪光的半半灵魂结晶
	Array(2591441, 500),//强力的半半灵魂结晶
	Array(2591450, 500),//闪光的血腥女王灵魂结晶
	Array(2591449, 500),//强力的血腥女王灵魂结晶
	Array(2591458, 500),//闪光的贝伦灵魂结晶
	Array(2591457, 500),//强力的贝伦灵魂结晶
	Array(2591434, 500),//闪光的皮埃尔灵魂结晶
	Array(2591433, 500),//强力的皮埃尔灵魂结晶
	Array(2591163, 500),//
	Array(2591202, 500),//
	Array(2591659, 500),//
	Array(2591233, 500),//
	Array(2591087, 500),//
	Array(2591088, 500),//
	Array(2591264, 500),//
	Array(2591427, 500),//
	Array(2591590, 500),//
	Array(2591640, 500),//
	Array(2591086, 500),//
	Array(2591619, 500),//
	Array(2591400, 500),//
	Array(2591409, 500),//
	Array(2591418, 500),//
	Array(2591391, 500)
);

var chance = Math.floor(Math.random() * 600);
var finalitem = Array();
for(var i = 0; i < itemList.length; i++) {
	if(itemList[i][1] >= chance) {
		finalitem.push(itemList[i]);
	}
}

if(finalitem.length != 0) {
	var item;
	var random = new java.util.Random();
	var finalchance = random.nextInt(finalitem.length);
	var itemId = finalitem[finalchance][0];
	var item = player.gainGachaponItem("灵魂结晶",itemId, 1,  1);
	if(item != -1) {

		player.loseItem(npc.getItemId(), 1);
		npc.say("你获得了 #b#t" + itemId + "##k X 1 。");
	} else {
		im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
	}
} else {
	im.sendOk("今天的运气可真差，什么都没有拿到。");
	player.loseItem(npc.getItemId(), 1);
}