status = -1;

//51121006 灵魂之怒 最终伤害提高30% 最终伤害+30%
//1311015  交叉锁链 最终伤害提高20% 最终伤害+20%
//65121004 灵魂凝视 暴击伤害+45%
//5320008  超级猴子魔法  力敏智运提高 60%
//15121005 急速领域 攻击速度+2

//11101022 月光洒落 攻击段数*2 暴击几率+20% 攻击伤害降低40%
//5321054  散弹炮   攻击段数*3 攻击伤害降低55%

//22001012 魔法盾   受到的伤害降低85% 降低部分由MP替代
//4201011  金钱盾   受到的伤害降低50% 降低部分由金币替代
//61121009 水盾     伤害降低30%
//31211003 驱邪     伤害降低30%
//61121009 强健护甲 伤害降低30%
//21101005 生命吸收 每次攻击吸取生命值上限1%的HP
//31211004 恶魔恢复 最大生命值增加25% 每4秒恢复5%生命值 
//400011066 钢铁之躯  不会被击退和击飞
//5821009 极速领域	消耗魔量，在一定时间内使全体队员的攻击速度提高2级。
player.useSkillEffect(400011109, 30);

player.useSkillEffect(151121041, 30);
//player.useSkillEffect(151111001, 30);
player.useSkillEffect(400001037, 30);
player.useSkillEffect(151111002, 30);
player.useSkillEffect(151111003, 30);
player.useSkillEffect(151121042, 30);
player.useSkillEffect(1311015, 30);
player.useSkillEffect(21101005, 30);




