status = -1;
/*
player.useSkillEffect(400011109, 30);

player.useSkillEffect(151121041, 30);
player.useSkillEffect(400001037, 30);
player.useSkillEffect(151111002, 30);
player.useSkillEffect(151111003, 30);
player.useSkillEffect(151121042, 30);
player.useSkillEffect(1311015, 30);
player.useSkillEffect(21101005, 30);


player.useSkillEffect(21101005, 30);
player.useSkillEffect(21101005, 30);
player.useSkillEffect(21101005, 30);
	
*/
//51121006 灵魂之怒 最终伤害提高30% 最终伤害+30%
//1311015  交叉锁链 最终伤害提高20% 最终伤害+20%
//65121004 灵魂凝视 暴击伤害+45%
//5320008  超级猴子魔法  力敏智运提高 60%
//15121005 急速领域 攻击速度+2

//11101022 月光洒落 攻击段数*2 暴击几率+20% 攻击伤害降低40%
//5321054  散弹炮   攻击段数*3 攻击伤害降低55%

//22001012 魔法盾   受到的伤害降低85% 降低部分由MP替代
//4201011  金钱盾   受到的伤害降低50% 降低部分由金币替代
//61121009 水盾     伤害降低30%
//31211003 驱邪     伤害降低30%
//61121009 强健护甲 伤害降低30%
//21101005 生命吸收 每次攻击吸取生命值上限1%的HP
//31211004 恶魔恢复 最大生命值增加25% 每4秒恢复5%生命值 
//400011066 钢铁之躯  不会被击退和击飞
//5821009 极速领域	消耗魔量，在一定时间内使全体队员的攻击速度提高2级。
//
var skill = Array(
	
	Array("米哈尔", 5112, 5321054),
	Array("神之子", 10112, 5321054,1121054,5121009),
	Array("奇袭者", 1512, 61121009, 5321054,1311015,400051013,15121054,400051007),

	Array("虎影", 16412, 5321054,164121041,400041048),
	Array("阴阳", 4212, 5321054,1311015,2121004,400011066),
	Array("炼狱黑客", 6312, 5321054,31211003),
	Array("冲锋队长", 512, 61121009),
	Array("隐月", 2512, 5321054,25121133,400051010),
	Array("圣经", 15212, 11101022, 61121009), 
	Array("火毒", 212, 5321054), 
	Array("龙神", 2217, 5321054), 
	Array("英雄", 112, 400001039,400001040,400001041,5321054,400011001,400011073,1121054,400011000,23121004), 
	
	Array("拳天", 17512,5321054,175121042,400051088,400051086), 
	Array("战神", 2112, 5321054, 61121009,1311015,400011000,33121054,21110016),
	Array("主教", 232, 61121009, 5321054),
	Array("侠盗", 422, 11101022),
	Array("唤灵法师", 3212, 5321054, 22001012, 400011066),
	Array("剑豪", 4112, 400001039,400001040,400001041,5321054,61121009, 5821009),
	Array("超能力", 14212, 5321054, 4201011, 5821009),
	Array("龙的传人", 572, 61121009),
	Array("箭神", 322, 400031015,5321054,400031055),
	Array("船长", 522, 5321054,1311015,65121004),
	Array("神射手", 312, 61121009,400031028,1311015,5321054),
	Array("夜光法师", 2712, 5321054, 2121004,20040219),
	Array("尖兵", 3612, 61121009,5321054),
	Array("圣骑士", 122, 61121009,5321054,1311015),
	Array("火炮", 532, 61121009),
	Array("幻影", 2412, 400001039,400001040,400001041,1311015, 5321054),
	Array("机械师", 3512, 5321054,35121055,400051009),
	Array("恶魔复仇者", 3122, 1311015,5321054,1121054),
	Array("影魂异人", 15512, 5321054, 61121009,400051334,400051036),
	Array("魔链", 6412, 11101022, 61121009),
	Array("爆莉萌天使", 6512,65121053,65121054,5321054),
	Array("冰雷魔导士", 222, 5321054,4331002,1311015,36111006,4111002,14111000,5121010,2221004),
	Array("暗影双刀", 434, 400001039,400001040,400001041,1121054,11101022, 1311015),
	Array("恶魔猎手", 3112, 11101022,1121054),
	Array("夜行者", 1412, 1311015,14111024,400041008,14121054,14121055,14121056,400011066,65121004),
	Array("隐士", 412, 61121009, 21101005,11101022,400041001), //11101022
	Array("爆破手", 3712, 5321054,37121054),
	Array("风灵使者", 1312, 61121009, 5321054,1311015,3221054),
	Array("豹弩游侠", 3312, 1311015,21101005,5321054,),
	Array("狂龙", 6112, 11101022,400011118),
	Array("魂骑士", 1112,5321054, 61121009,400011005),
	Array("炎术士", 1212, 5321054),
	Array("古迹猎人", 332, 400001039,400001040,400001041,5321054, 1311015,21101005),
	Array("黑骑士", 132, 11101022),
	Array("双弩", 2312, 21101005, 5321054),
	Array("林之灵", 11212, 11101022,4201011),
	
	Array("御剑骑士", 15112, 400001039,400001040,400001041,400011109,151121042,1311015,21101005)
	
	

);

var job = player.getJob();
var name = "";
var id = "";
if(map.getId() == 910000000) {
	npc.say("不能在市场开启BUFF");

} else {
	for(var i = 0; i < skill.length; i++) {
		if(job == skill[i][1]) {
			//职业匹配上了
			//使用BUFF
			name = skill[i][0];
			for(var j = 2; j < skill[i].length; j++) {
				//if(player.getSkillLevelskill(skill[i][j])>0){
					player.useSkillEffect(skill[i][j], 30);
				//}
				id += "#s" + skill[i][j] + "#";
			}

		}
	}
	//10310
	if(player.getPQLog("秘籍") < 1) {
		player.addPQLog("秘籍");
		npc.say("你的职业是：#r" + name + " #k \r\n你获得了你的职业专属BUFF:" + id + "\r\n让你在床上更强大了~\r\n");
		
	}
}