status = -1;
var itemList = Array(
//500 这一行 越小  几率就越小
Array(2591631, 400, 1, 1),//伟大的奈奈灵魂结晶
Array(2591630, 400, 1, 1),//伟大的嘟嘟灵魂结晶
Array(2591629, 400, 1, 1),//伟大魂魔灵魂结晶
Array(2591629, 400, 1, 1),//伟大魂魔灵魂结晶
Array(2591561, 400, 1, 1),//伟大的奈奈灵魂结晶
Array(2591552, 400, 1, 1),//伟大的嘟嘟灵魂结晶
Array(2591485, 400, 1, 1),//伟大的赤虎灵魂
Array(2591484, 400, 1, 1),//伟大的黄龙灵魂
Array(2591676, 400, 1, 1),//伟大的敦凯尔灵魂结晶
Array(2591659, 400, 1, 1),//伟大的觉醒希拉灵魂结晶
Array(2591640, 400, 1, 1),//伟大的威尔灵魂结晶
Array(2591619, 400, 1, 1),//伟大的帕普拉图斯灵魂结晶
Array(2591590, 400, 1, 1),//伟大的路西德灵魂
Array(2591581, 400, 1, 1),//伟大的戴米安灵魂结晶
Array(2591572, 400, 1, 1),//伟大的戴米安灵魂结晶
Array(2591517, 400, 1, 1),//伟大乌鲁斯之魂
Array(2591427, 400, 1, 1),//伟大的斯乌灵魂结晶
Array(2591296, 400, 1, 1),//伟大的毛莫灵魂结晶
Array(2591264, 400, 1, 1),//伟大的麦格纳斯灵魂结晶
Array(2591088, 400, 1, 1),//伟大的希纳斯灵魂结晶
Array(2049116, 800, 50, 1),//强化混沌卷
Array(2049116, 800, 50, 1),//强化混沌卷
Array(4031764, 400, 30, 1),//超自然报告
Array(4031764, 350, 40, 1),//超自然报告
Array(4031764, 300, 50, 1),//超自然报告
Array(4000124, 500, 80, 1),//内存卡
Array(4001006, 500, 1000, 1),//火焰羽毛
Array(4000672, 500, 500, 1),//火石头
Array(4000645, 500, 500, 1),//飘飘猪脖子肉
Array(4000627, 500, 500, 1),//钉头锤
Array(4000133, 500, 500, 1),//海贼发动机
Array(2049323, 500, 20, 1),//高级无损卷轴
Array(2049323, 500, 20, 1),//高级无损卷轴
Array(2049323, 500, 20, 1),//高级无损卷轴
Array(3994979, 800, 5, 1),//进击的巨人抽奖球
Array(4310238, 800, 50, 1),//绝对味觉币
Array(4310238, 800, 50, 1),//绝对味觉币
Array(4031997, 800, 200, 1),//国庆纪念币
Array(4031997, 800, 300, 1),//国庆纪念币
Array(4031997, 800, 500, 1),//国庆纪念币
Array(2048749, 800, 20, 1),//永远的火花
Array(2630404, 100, 1, 1),//20级神秘徽章自选箱子
Array(2439292, 200, 1, 1),//18级神秘徽章自选箱子
Array(2630372, 300, 1, 1),//15级神秘徽章自选箱子
Array(2614079, 550, 2, 1),//1000W极限的突破石头
Array(2614079, 550, 2, 1),//1000W极限的突破石头
Array(2614079, 550, 2, 1),//1000W极限的突破石头
Array(2614079, 550, 2, 1),//1000W极限的突破石头
Array(2614079, 550, 2, 1),//1000W极限的突破石头
Array(2614069, 500, 1, 1),//5000万极限突破石100%
Array(2614069, 500, 1, 1),//5000万极限突破石100%
Array(2614068, 500, 1, 1),//3000万极限突破石100%
Array(2614068, 500, 1, 1),//3000万极限突破石100%
Array(2614068, 500, 1, 1),//3000万极限突破石100%
Array(2430761, 500, 1, 1),//传说武器箱子
//Array(2630627, 150, 1, 1),//神秘防具自选箱
Array(2630627, 100, 1, 1),//神秘防具自选箱
//Array(2630626, 200, 1, 1),//神秘武器自选箱
Array(1012632, 20, 1, 1),//失控机械标记
Array(1022278, 20, 1, 1),//蕴藏魔力的眼罩
Array(1122430, 20, 1, 1),//痛苦根源
Array(1132308, 20, 1, 1),//梦幻腰带
Array(1113306, 20, 1, 1),//巨大恐惧戒指
Array(1032316, 20, 1, 1),//船长姿态耳环
Array(1202193, 100, 1, 1),//轮回碑石\r\n
Array(2430885, 600, 1, 1),//FFN自选防具\r\n
Array(2430885, 600, 1, 1),//FFN自选防具\r\n
Array(2431938, 600, 1, 1),//FFN武器箱\r\n
Array(1182136, 500, 1, 1),//MX-131徽章
Array(1672069, 100, 1, 1),//女武神之心
Array(1122296, 50, 1, 1),//死神的项链
Array(2432069, 180, 1, 1),//暴君防具交换券
Array(2432069, 150, 1, 1),//暴君防具交换券
Array(3992025, 800, 10, 1),//圣诞大星
Array(2049610, 800, 30, 1),//还原不可以交易 成功率100%椅子
Array(4023026, 500, 5, 1),//紫火
Array(4023026, 500, 5, 1),//紫火
Array(4023025, 500, 3, 1),//金火
Array(4023025, 500, 3, 1),//金火
Array(4036457, 500, 1, 1),//黑火
Array(4036457, 500, 1, 1),//黑火
Array(4000000, 500, 3000, 1),//蓝蜗牛壳
Array(4000016, 500, 3000, 1),//红蜗牛壳
Array(4034848, 500, 5, 1),//光辉钻石
Array(4001332, 250, 1, 1),//紫色蜡笔
Array(4001331, 500, 2, 1),//蓝色蜡笔
Array(4001330, 500, 2, 1),//青色蜡笔
Array(4001329, 500, 2, 1),//绿色蜡笔
Array(4001328, 500, 2, 1),//黄色蜡笔
Array(4001327, 500, 2, 1),//橙色蜡笔
Array(4001326, 500, 2, 1),//红色蜡笔
Array(2049389, 400, 1, 1),//星之力20星强化券
Array(2049387, 800, 1, 1),//星之力18星强化券
Array(2049389, 400, 1, 1),//星之力20星强化券
Array(2049387, 800, 1, 1),//星之力18星强化券
Array(2432206, 500, 3, 1),//玫瑰花园箱子
Array(2432206, 500, 3, 1),//玫瑰花园箱子
Array(2435824, 500, 2, 1),//V箱子
Array(2430675, 500, 1, 1),//贪婪箱子
Array(2430675, 500, 1, 1),//贪婪箱子
Array(2435824, 500, 2, 1),//V箱子
Array(2431142, 500, 3, 1),//第一季箱子
Array(2431142, 500, 3, 1)//第一季箱子
);

var total=player.getAmountOfItem(npc.getItemId());
let number = npc.askNumber("请输入要开启的数量，当前你身上拥有个数为："+total+" 个",1,1,20);

if(number<=total){

	var ddd=1;
	while(ddd<=number){
		ddd++;
		var chance = Math.floor(Math.random() * 500);
		var finalitem = Array();
		for (var i = 0; i < itemList.length; i++) {
			if (itemList[i][1] >= chance) {
				finalitem.push(itemList[i]);
			}
		}
			
		var random = new java.util.Random();
		var finalchance = random.nextInt(finalitem.length);
		var itemId = finalitem[finalchance][0];
		var quantity = finalitem[finalchance][2];
		var notice = finalitem[finalchance][3];
		var item = player.gainGachaponItem("快乐源泉",itemId, quantity,  notice);
			
		player.loseItem(2436298, 1);
	

	}
}else{
	npc.say("你没有那么多#v"+npc.getItemId()+"# 你目前最大开启数量为 ： "+total);
}

 