status = -1;
var itemList = Array(
	//物品ID    获得概率数字越大概率越大
	Array(1142500, 100), // 神秘班·雷昂的恶梦 // (无描述)
	Array(1142501, 100), // 神秘阿卡伊勒的恶梦 // (无描述)
	Array(1142502, 100), // 神秘希拉的恶梦 // (无描述)
	Array(1142503, 100), // 神秘扎昆的恶梦 // (无描述)
	Array(1142504, 100), // 神秘暗黑龙王的恶梦 // (无描述)
	Array(1142505, 100), // 神秘之门研究者 // (无描述)

	// 图腾
	Array(1202023, 600), // 真·乔图腾 // 聚集了乔的强烈灵魂的强力图腾。
	Array(1202024, 600), // 金·乔图腾 // 根据乔的样子所做的黄金图腾。
	Array(1202025, 600), // 银·乔图腾 // 根据乔的样子所做的银图腾。
	Array(1202026, 600), // 木·乔图腾 // 根据乔的样子所做的木图腾。
	Array(1202027, 600), // 真·海丽蜜图腾 // 聚集了海丽蜜的强烈灵魂的强力图腾。
	Array(1202028, 300), // 图腾。
	Array(1202029, 300), // 腾。
	Array(1202030, 300), //腾。
	Array(1202031, 300), // 腾。
	Array(1202032, 300), // 。
	Array(1202033, 300), // 
	Array(1202034, 300), // 
	Array(1202035, 300), // 力图腾。
	Array(1202036, 300), // 图腾。
	Array(1202037, 300), // 腾。
	Array(1202038, 300), // 
	Array(1202039, 300), // 
	Array(1202040, 300), // 
	Array(1202041, 300), // 
	Array(1202042, 300), // 
	Array(1202083, 300), // 
	Array(1202084, 300), //
	Array(1202085, 300), // 
	Array(1202086, 300), // 
	//Array(1202098, 600),  // 
	Array(1202099, 600), // 
	Array(1202100, 300), // 
	Array(1202101, 300), // 
	Array(1202102, 300), //
	Array(1202103, 300), // 
	Array(1202104, 300), // 黄色便当图腾 // 升级6次的图腾.
	Array(1202105, 300), // 橘黄色便当图腾 // 升级7次的图腾.
	Array(1202106, 300), // 真正的便当图腾 // 升级8次的图腾.
	Array(1202107, 300), // 
	Array(1202108, 300), // 真深蓝色便当图腾 // 升级1次的图腾.
	Array(1202109, 300), // 真紫色便当图腾 // 升级2次的图腾.
	Array(1202110, 300), // 真绿色便当图腾 // 升级3次的图腾.
	Array(1202111, 300), // 真红色便当图腾 // 升级4次的图腾.
	Array(1202112, 300), // 真蓝色便当图腾 // 升级5次的图腾.
	Array(1202113, 300), // 真黄色便当图腾 // 升级6次的图腾.
	Array(1202114, 300), // 真橘黄色便当图腾 // 升级7次的图腾.
	Array(1202115, 300), // 真正的便当图腾 // 升级8次的图腾.
	Array(1202094, 300), // 王魔女图腾 // 表现出班主任王美女真正恐怖之处的图腾
	Array(1202095, 300), // 王美女图腾 // 表现出班主任王美女深藏不露之美的图腾
	Array(1202096, 300), // 王微笑图腾 // 表现出班主任王美女多情一面的图腾
	Array(3010552, 3), // 喵喵的免费拥抱, 3), // 看上去很善良的猫咪。感觉像跟人拥抱一样的猫咪椅子。每10秒HP恢复50，MP恢复50。
	Array(3010553, 3), // 邪恶羊椅子, 3), // 可怕的羊。不要随便喂它。每10秒HP恢复50，MP恢复50。
	Array(3010554, 3), // 粉色手柄, 3), // 梦想进入游戏排名的少女的梦想，粉红色的游戏手柄椅子。每10秒HP恢复50，MP恢复50。
	Array(3010555, 3), // 深夜猫头鹰, 3), // 寂静森林中的猫头鹰，还有我。每10秒HP恢复50，MP恢复50。
	Array(3010556, 3), // 皮肤皇后椅子, 3), // 不要害羞。专为在皮肤保养方面决不妥协的你准备的椅子。每10秒HP恢复50，MP恢复50。
	Array(3010557, 3), // 睡觉小鸟椅子, 3), // 坐在天真的小鸟们中间，和它们一起打盹吧。每10秒HP恢复50，MP恢复50。
	Array(3010558, 3), // 泡泡浴椅子, 3), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
	Array(3010559, 3), // 龙蛋, 3), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。

	// ------ 150级武器 ------
	Array(1402196, 2),
	Array(1432167, 2),
	Array(1452205, 2),
	Array(1462193, 2),
	Array(1472214, 2),
	Array(1332225, 2),
	Array(1342082, 2),
	Array(1362090, 2),
	Array(1382208, 2),
	Array(1372177, 2),
	Array(1212063, 2),
	Array(1403036, 2),
	Array(1242060, 2),
	Array(1232057, 2),
	Array(1522094, 2)
);

var chance = Math.floor(Math.random() * 600);
var finalitem = Array();
for(var i = 0; i < itemList.length; i++) {
	if(itemList[i][1] >= chance) {
		finalitem.push(itemList[i]);
	}
}

if(finalitem.length != 0) {
	var item;
	var random = new java.util.Random();
	var finalchance = random.nextInt(finalitem.length);
	var itemId = finalitem[finalchance][0];
	var item = player.gainGachaponItem("祖母绿抽奖礼包",itemId, 1,  1);
	if(item != -1) {

		
		player.loseItem(npc.getItemId(), 1);
		npc.say("你获得了 #b#t" + itemId + "##k X 1 。");
	} else {
		npc.say("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
	}
} else {
	npc.say("今天的运气可真差，什么都没有拿到。");
	player.loseItem(npc.getItemId(), 1);
}