status = -1;
var itemList = Array(
	//物品ID    获得概率数字越大概率越大
	
Array(2049100, 500), //混沌卷轴60%
Array(2048052, 500), //宠物装备攻击力卷轴 40%
Array(2048052, 500), //宠物装备魔力卷轴 40%
Array(5064000, 500), //防爆卷轴
Array(2040811, 500), //手套攻击诅咒卷轴
Array(2040807, 500), //手套攻击诅咒卷轴
Array(2340000, 500), //祝福卷轴
Array(2046319, 500), //饰品魔力卷轴
Array(2040814, 500), //手套魔力诅咒卷轴70%
Array(2040815, 500), //手套魔力诅咒卷轴30%
Array(2046006, 500), //宠物装备攻击力卷轴
Array(2046007, 500), //宠物装备魔法攻击力卷轴
Array(2049300, 500), //高级装备强化卷轴
Array(2049700, 500), //A级潜能卷轴
Array(2049752, 500), //S级潜能卷轴 30%
Array(2046008, 500), //盾牌攻击诅咒卷轴30%
Array(2046009, 500), //盾牌魔力诅咒卷轴30%
Array(2040852, 500), //品克缤手套攻击力卷轴
Array(2040853, 500), //品克缤手套攻击力卷轴
Array(2049132, 500), //惊人混沌卷轴30%
Array(2046109, 500), //白医卷轴—仙
Array(2046108, 500), //白医卷轴—神

Array(3700031, 500), //见习猎人资格证
Array(3700032, 500), //B级猎人资格证
Array(3700033, 500), //A级猎人资格证
Array(3700034, 500), //S级猎人资格证
Array(3700035, 500), //甜蜜情人节！
Array(3700036, 500), //情人节的糖果真甜
Array(3700037, 500), //枫树管理员
Array(3700039, 500), //打架王
Array(3700040, 500), //复仇者
Array(3700041, 500), //拥有虚弱魅力的人
Array(3700042, 500), //斗士
Array(3700043, 500), //最强斗士
Array(3700044, 500), //我最受欢迎
Array(3700045, 500), //我也很受欢迎
Array(3700046, 500), //我也挺受欢迎
Array(3700047, 500), //角斗士
Array(3700048, 500), //平定战场的人
Array(3700049, 500), //与末日风暴同在的
Array(3700053, 500), //中秋动物农场
Array(3700056, 500), //落火
Array(3700057, 500), //谁会成为猪呢
Array(3700058, 500), //告别尤茨游戏菜鸟水平
Array(3700059, 500), //坚持尤茨游戏
Array(3700060, 500), //尤茨特殊人才
Array(3700061, 500), //武陵巨熊
Array(3700062, 500), //神木村飞龙
Array(3700063, 500), //班·雷昂狮子
Array(3700064, 500), //克里塞巨人
Array(3700065, 500), //万神殿英雄
Array(3700066, 500), //乌山老虎
Array(3700067, 500), //奥尔卡双胞胎
Array(3700068, 500), //射手村老鹰
Array(3700073, 500), //开路先锋
Array(3700074, 500), //熊的力量
Array(3700075, 500), //尼浩玛
Array(3700076, 500), //哭哭狸
Array(3700077, 500), //光舞 
Array(3700079, 500), //我是动作英雄
Array(3700080, 500), //这才是高手
Array(3700081, 500), //欢迎任何人来和我对决 
Array(3700082, 500), //不要放弃
Array(3700083, 500), //冒险岛酷暑
Array(3700084, 500), //夏天就该吃冰激凌
Array(3700085, 500), //拼图收藏家
Array(3700086, 500), //今天满勤
Array(3700087, 500), //喜欢红色
Array(3700088, 500), //恶魔复仇者成就达成
Array(3010000, 500), //休闲椅
Array(3010001, 500), //蓝色木椅
Array(3010002, 500), //绿色时尚转椅2430781
Array(3010003, 500), //红色时尚转椅
Array(3010004, 500), //黄蓝休闲椅
Array(3010005, 500), //红蓝休闲椅
Array(3010006, 500), //黄色时尚转椅
Array(3010007, 500), //粉色海豹靠垫
Array(3010008, 500), //蓝色海豹靠垫
Array(3010009, 500), //榻榻凳
Array(3010010, 500), //白色海豹靠垫
Array(3010012, 500), //剑士 宝座
Array(3010013, 500), //悠长假期
Array(3010014, 500), //月亮弯
Array(3010016, 500), //黑色海豹靠垫
Array(3010017, 500), //金色海豹靠垫
Array(3010018, 500), //椰子树沙滩椅
Array(3010019, 500), //寿司椅
Array(3010021, 500), //暖暖桌
Array(3010024, 500), //玩具粉熊椅
Array(3010025, 500), //5周年枫叶纪念凳
Array(3010026, 500), //恶灵附身的心动蓝蜗牛椅子
Array(3010028, 500), //海盗的俘虏
Array(1162025, 500), //粉色圣杯
Array(1162025, 500), //粉色圣杯
Array(1162025, 500), //粉色圣杯
Array(1162025, 500), //粉色圣杯
Array(1162025, 500), //粉色圣杯
Array(3010151, 500), //无人岛椅子
Array(3010152, 500), //黄三角帐篷椅
Array(3010073, 500), //baby品克缤
Array(3010034, 500), //悠长假期(红色)
Array(3010035, 500), //悠长假期(蓝色)
Array(3010036, 500), //浪漫秋千
Array(3010037, 500), //猪猪凳
Array(3010038, 500), //空气沙发
Array(3010039, 500), //黑色海狗靠垫
Array(3010040, 500), //蝙蝠椅
Array(3010041, 500), //骷髅王座
Array(3010043, 500), //魔女的飞扫把
Array(3010044, 500), //同一红伞下
Array(3010045, 500), //寒冰椅子
Array(3010046, 500), //红龙椅
Array(3010047, 500), //蓝龙椅
Array(3010048, 500), //圣诞树椅子
Array(3010049, 500), //雪房子
Array(3010050, 500), //公主凳
Array(3010051, 500), //沙漠兔子1靠垫
Array(3010052, 500), //沙漠兔子2靠垫
Array(3010053, 500), //兔子纪念版椅子
Array(3010054, 500), //呼噜呼噜床
Array(3010055, 500), //冰雪糕丸子椅
Array(3010057, 500), //血色玫瑰
Array(3010058, 500), //世界末日
Array(3010059, 500), //心动蓝蜗牛的零食王座
Array(3010060, 500), //初心凳
Array(3010061, 500), //枫树下
Array(3010062, 500), //竹凳
Array(3010063, 500), //月亮星星抱枕椅
Array(3010064, 500), //棕色砂兔抱枕椅
Array(3010065, 500), //粉红海滩遮阳椅
Array(3010066, 500), //深蓝色绒毛沙发
Array(3010067, 500), //红色设计师椅
Array(3010068, 500), //露水椅子
Array(3010069, 500),  //大黄风
// 图腾
Array(1202023, 600), // 真·乔图腾 // 聚集了乔的强烈灵魂的强力图腾。
Array(1202024, 600), // 金·乔图腾 // 根据乔的样子所做的黄金图腾。
Array(1202025, 600), // 银·乔图腾 // 根据乔的样子所做的银图腾。
Array(1202026, 600), // 木·乔图腾 // 根据乔的样子所做的木图腾。
Array(1202027, 600), // 真·海丽蜜图腾 // 聚集了海丽蜜的强烈灵魂的强力图腾。
Array(1202028, 300), // 图腾。
Array(1202029, 300), // 腾。
Array(1202030, 300), //腾。
Array(1202031, 300), // 腾。
Array(1202032, 300), // 。
Array(1202033, 300), // 
Array(1202034, 300), // 
Array(1202035, 300), // 力图腾。
Array(1202036, 300), // 图腾。
Array(1202037, 300), // 腾。
Array(1202038, 300), // 
Array(1202039, 300), // 
Array(1202040, 300), // 
Array(1202041, 300), // 
Array(1202042, 300), // 
Array(1202083, 300), // 
Array(1202084, 300), //
Array(1202085, 300), // 
Array(1202086, 300), // 
//Array(1202098, 600),  // 
Array(1202099, 600), // 
Array(1202100, 300), // 
Array(1202101, 300), // 
Array(1202102, 300), //
Array(1202103, 300), // 
Array(1202104, 300), // 黄色便当图腾 // 升级6次的图腾.
Array(1202105, 300), // 橘黄色便当图腾 // 升级7次的图腾.
Array(1202106, 300), // 真正的便当图腾 // 升级8次的图腾.
Array(1202107, 300), // 
Array(1202108, 300), // 真深蓝色便当图腾 // 升级1次的图腾.
Array(1202109, 300), // 真紫色便当图腾 // 升级2次的图腾.
Array(1202110, 300), // 真绿色便当图腾 // 升级3次的图腾.
Array(1202111, 300), // 真红色便当图腾 // 升级4次的图腾.
Array(1202112, 300), // 真蓝色便当图腾 // 升级5次的图腾.
Array(1202113, 300), // 真黄色便当图腾 // 升级6次的图腾.
Array(1202114, 300), // 真橘黄色便当图腾 // 升级7次的图腾.
Array(1202115, 300), // 真正的便当图腾 // 升级8次的图腾.
Array(1202094, 300), // 王魔女图腾 // 表现出班主任王美女真正恐怖之处的图腾
Array(1202095, 300), // 王美女图腾 // 表现出班主任王美女深藏不露之美的图腾
Array(1202096, 300), // 王微笑图腾 // 表现出班主任王美女多情一面的图腾
Array(3010552, 3), // 喵喵的免费拥抱, 3), // 看上去很善良的猫咪。感觉像跟人拥抱一样的猫咪椅子。每10秒HP恢复50，MP恢复50。
Array(3010553, 3), // 邪恶羊椅子, 3), // 可怕的羊。不要随便喂它。每10秒HP恢复50，MP恢复50。
Array(3010554, 3), // 粉色手柄, 3), // 梦想进入游戏排名的少女的梦想，粉红色的游戏手柄椅子。每10秒HP恢复50，MP恢复50。
Array(3010555, 3), // 深夜猫头鹰, 3), // 寂静森林中的猫头鹰，还有我。每10秒HP恢复50，MP恢复50。
Array(3010556, 3), // 皮肤皇后椅子, 3), // 不要害羞。专为在皮肤保养方面决不妥协的你准备的椅子。每10秒HP恢复50，MP恢复50。
Array(3010557, 3), // 睡觉小鸟椅子, 3), // 坐在天真的小鸟们中间，和它们一起打盹吧。每10秒HP恢复50，MP恢复50。
Array(3010558, 3), // 泡泡浴椅子, 3), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
Array(3010559, 3), // 龙蛋, 3), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。

	// ------ 150级武器 ------
Array(2022956, 500), //火红玫瑰
Array(5121003, 500), //参鸡汤
Array(5121004, 500), //松糕  
Array(5121005, 500), //韩果  
Array(5121006, 500), //小魔女  
Array(5121007, 500), //圣诞树铃铛  
Array(5121008, 500), //祝你生日快乐  
Array(5121009, 500), //火红玫瑰  
Array(5121010, 500), //浪漫樱花  
Array(5121015, 500), //雪孩子  
Array(5121016, 500), //巧克力糖果  
Array(5121020, 500), //喜洋洋  
Array(5121025, 500), //2010胜利祈愿 
Array(5122000, 500), //熊宝宝
Array(2210120, 500), //希拉变身药水
Array(2210121, 500), //麦格纳斯变身药水
Array(2210122, 500), //班·雷昂变身药水
Array(2210123, 500), //阿卡伊勒变身药水
Array(2210123, 800), //阿卡伊勒变身药水
Array(2022530, 50)  //迎春花花语
);

var chance = Math.floor(Math.random() * 600);
var finalitem = Array();
for(var i = 0; i < itemList.length; i++) {
	if(itemList[i][1] >= chance) {
		finalitem.push(itemList[i]);
	}
}

if(finalitem.length != 0) {
	var item;
	var random = new java.util.Random();
	var finalchance = random.nextInt(finalitem.length);
	var itemId = finalitem[finalchance][0];
	//player.dropMessage(1,itemId);
	if(itemId>0){
		var item = player.gainGachaponItem("祖母绿抽奖礼包",itemId, 1,  1);
		if(item != -1) {

			player.loseItem(npc.getItemId(), 1);
			npc.say("你获得了 #b#t" + itemId + "##k X 1 。");
		} else {
			npc.say("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
		}
	}else{
		npc.say("今天的运气可真差，什么都没有拿到。");
	}
	
} else {
	npc.say("今天的运气可真差，什么都没有拿到。");
	player.loseItem(npc.getItemId(), 1);
}