



var itemList=Array(
	// 1004812, //- 神秘之影海盜帽 等级要求：200
	// 	1004811, //- 神秘之影盜賊帽 等级要求：200
	// 	1004810, //- 神秘之影弓手帽 等级要求：200
	// 	1004809, //- 神秘之影法師帽 等级要求：200
	// 	1004808, //- 神秘之影戰士帽 等级要求：200
	// 	1053067, //- 神秘之影海盜套服 等级要求：200
	// 	1053066, //- 神秘之影盜賊套服 等级要求：200
	// 	1053065, //- 神秘之影弓手套服 等级要求：200
	// 	1053064, //- 神秘之影法師套服 等级要求：200
	// 	1053063 ,//- 神秘之影戰士套服 等级要求：200
	// 	1152200,//- 神秘之影海盜肩膀 等级要求：200
	// 	1152199,//- 神秘之影盜賊肩膀 等级要求：200
	// 	1152198,//- 神秘之影弓手肩膀 等级要求：200
	// 	1152197,//- 神秘之影法師肩膀 等级要求：200
	// 	1152196,//- 神秘之影戰士肩膀 等级要求：200
	// 	1082699,//- 神秘之影海盜手套 等级要求：200
	// 	1082698,//- 神秘之影盜賊手套 等级要求：200
	// 	1082697,//- 神秘之影弓手手套 等级要求：200
	// 	1082696,//- 神秘之影法師手套 等级要求：200
	// 	1082695,//- 神秘之影戰士手套 等级要求：200
	// 	1102944,//- 神秘之影海盜披風 等级要求：200
	// 	1102943,//- 神秘之影盜賊披風 等级要求：200
	// 	1102942,//- 神秘之影弓手披風 等级要求：200
	// 	1102941,//- 神秘之影法師披風 等级要求：200
	// 	1102940,//- 神秘之影戰士披風 等级要求：200
	// 	1073162,//- 神秘之影海盜鞋子 等级要求：200
	// 	1073161,//- 神秘之影盜賊鞋子 等级要求：200
	// 	1073160,//- 神秘之影弓手鞋子 等级要求：200
	// 	1073159,//- 神秘之影法師鞋子 等级要求：200
	// 	1073158, //- 神秘之影戰士鞋子 等级要求：200
	// 	1113211, //- 神秘之影戰士鞋子 等级要求：200
	// 	1113306,
	// 	1032316,
	// 	1022195,
	// 	1012414,
	// 	1122259,
	// 	1032201,
	// 	1113056,
		1113302,
		1113302
);
	var txt="请选择你需要的装备:\r\n";
	for(var i=0;i<itemList.length;i++){
		txt+="#L"+itemList[i]+"##v"+itemList[i]+"##t"+itemList[i]+"##l\r\n";
	}
	let itemid=npc.askMenuS(txt);
	var toDrop = player.makeItemWithId(itemid); // 生成一个Equip类
	toDrop.setStr(toDrop.getStr()+30); //装备力量
	toDrop.setDex(toDrop.getDex()+30); //装备敏捷
	toDrop.setInt(toDrop.getInt()+30); //装备智力
	toDrop.setLuk(toDrop.getLuk()+30); //装备运气
	toDrop.setPad(toDrop.getPad()+30); //物理攻击
	toDrop.setMad(toDrop.getMad()+30); //魔法攻击
	if(toDrop.getRUC()<3){
		toDrop.setRUC(0);
	}else{
		toDrop.setRUC(toDrop.getRUC()-3);
	}
	toDrop.setViciousHammer(2);
	toDrop.setCUC(3);
	player.gainItem(toDrop);
	player.loseItem(npc.getItemId(),1);
