let banItems = Array(
	//手动ban物品
	5000964,
	1113220, 
	1053159, 
	1112001, 
	1112918, //羁绊之翼
	1112965, //梦境蝴蝶
	1102963, //羁绊之翼
	1003843, //奇怪的狐狸面具
	1082553, //红色十字架手套
	1032234, //蓝色桃心耳环
	1012553, //咬紧牙关的面罩
	1702472, //万圣节的命运
	1102724, //黑暗天使羽翼
	1102723, //光明天使羽翼
	2438391,
	1033000,
	1115014, //MVP对话框戒指（钻石）
	1115102, //MVP名片戒指（钻石）
	1115012, //MVP对话框戒指（白银） 等级要求：0
	1115013, //MVP对话框戒指（黄金） 等级要求：0
	1115100, //MVP名片戒指（白银） 等级要求：0
	1115101, //MVP名片戒指（黄金） 等级要求：0
	1102965, //萤火虫之舞 等级要求：0
	1112244, //蝙蝠聊天戒指
	1004472, //饿狼传说帽子
	1102604, //蒼穹之翼
	1112966, //灵魂密友友情戒指
	1112968, //灵魂密友友情戒指
	1102873, //永恒初心者
	1102872,//闪耀初心者
	1802682,
	5000094,
	1802082,
	1102872//闪耀初心者
);
var itemId=npc.askNumber("#r#e请输入选定的点装代码，部分的代码不允许选择；\r\n你将会获得全属性333的自选点装一件;",0,1000000,2000000);


var item = player.makeItemWithId(itemId); // 生成一个Equip类 luxide 1033000

if(banItems.indexOf(itemId) != -1){
	npc.say("该装备已被管理员拉入小黑屋，不可购买！",9010061);
}else if(null == item){
	npc.say("您输入的代码不存在，请重新输入",9010061);
}else{
	if(item.getSN()!=-1){
		if(!player.canGainItem(itemId,1)){
			npc.say("请清理背包",9010061);	
		}else if(parseInt(item.getDataId()/100000)==18){
			npc.say("不可以选择宠物时装~");
		}else{
			item.setStr(177); //装备力量
			item.setDex(177); //装备敏捷
			item.setInt(177); //装备智力
			item.setLuk(177); //装备运气
			item.setPad(177); //物理攻击
			item.setMad(177); //魔法攻击
			item.setTitle("会员特权定制");
			player.gainItem(item);
			player.loseItem(npc.getItemId(),1);
			npc.say("购买成功!欢迎继续选购！",9010061);
		}
	
	}else{
		npc.say("您输入的不是现金装备代码！请重新输入",9010061);
	}

}

	
