/**
* 箱子选择道具 CC 835456564 
**/

//送的物品
let items = Array( 
 1582017,
 1212115, //埃苏莱布斯双头杖
 1222109, //埃苏莱布斯灵魂手铳
 1232109, //埃苏莱布斯亡命剑
 1402251, //埃苏莱布斯宽大刀
 1242116, //埃苏莱布斯能量剑
 1262017, //埃苏莱布斯ESP限制器
 1302333, //埃苏莱布斯军刀
 1312199, //埃苏莱布斯战斧
 1322250, //埃苏莱布斯战锤
 1332274, //埃苏莱布斯屠龙斩
 1342101, //埃苏莱布斯之刃
 1362135, //埃苏莱布斯折叠手杖
 1372222, //埃苏莱布斯短杖
 1382259, //埃苏莱布斯长杖
 1412177, //埃苏莱布斯大斧
 1422184, //埃苏莱布斯大锤
 1432214, //埃苏莱布斯穿透矛
 1442268, //埃苏莱布斯巨灵开山斧
 1452252, //埃苏莱布斯弓
 1462239, //埃苏莱布斯弩
 1472261, //埃苏莱布斯复仇斗拳
 1482216, //埃苏莱布斯拳甲
 1492231, //
 1522138, //
 1532144, //
 1552110, //
 1252093,
 1272016,
 1282016,
 1542108
);

let boxId = 2437178;//箱子ID


let ss = "#b消耗#v"+boxId+"#,可选择获得道具:\r\n#n"
for(let i = 0 ; i < items.length;i++){
	ss += "#L"+i +"##r #v"+items[i]+"# #z"+items[i]+"# x 1 #l\r\n"
}

let selected = npc.askMenu(ss);

ss = "您是否确定获取#v"+items[selected]+"# x 1";
let YN = npc.askYesNo(ss);
if(YN == 1){
	if(player.canGainItem(items[selected],1)){
		if(player.hasItem(boxId,1)){
			player.gainItem(items[selected],1);
			player.loseItem(boxId,1);
			npc.say("兑换成功");
		}else{
			npc.say("你没有#v"+boxId+"#");
		}
	}else{
		npc.say("请清理背包！");
	}
}else{
	npc.say("不想兑换吗？下次再见。");
}