var itemList = Array(
	1212129, //创世双头杖
	1222122, //创世灵魂手铳
	1232122, //创世亡命剑
	1242139, //创世聚能锁链剑
	1242141, //创世聚能锁链剑
	1252106, //创世权杖
	1262051, //创世ESP限制器
	1272040, //创世锁链
	1282040, //创世魔力手套
	1292022, //创世扇
	1302355, //创世军刀
	1312213, //创世斧
	1322264, //创世锤
	1332289, //创世短刀
	1362149, //创世手杖
	1372237, //创世短杖
	1382274, //创世长杖
	1402268, //创世双手剑
	1412189, //创世双手战斧
	1422197, //创世双手锤
	1432227, //创世枪
	1442285, //创世长戟
	1452266, //创世弓
	1462252, //创世弩
	1472275, //创世斗拳
	1482232, //创世拳爪
	1492245, //创世手铳
	1522152, //创世双弩枪
	1532157, //创世攻城炮
	1542128, //创世武士刀
	1552130, //创世扇子
	1582044, //创世机甲枪
	1592022 //创世远古弓
);

var text = "";
for(var i = 0; i < itemList.length; i++) {
	text += "#L" + i + "##v" + itemList[i] + "##z" + itemList[i] + "##l\r\n";
}
let selection = npc.askMenuS("请选择你想要的武器\r\n\r\n" + text);

var itemid = itemList[selection];

var item = player.gainGachaponItem("【创世武器自选】", itemid, 1, 3);
if(item > 0) {
	player.loseItem(npc.getItemId(), 1);
	npc.say("恭喜您，获得了#b#z" + itemid + "# X 1");
} else {
	npc.say("请清理背包~~");
}