/*  This is mada by yanran     
 *  
 *  脚本任务：调查纸条 男生
 *  
 */

var txt = Array(
        "大笨蛋，哈哈，考试每次得0分。",
        "我好想强奸嫣然啊，这个事情千万不能让副校长知道。",
        "昨天打死了一个人，尸体丢到了湖里，希望他飘的远远的，不然就完蛋了。",
        "总之，#ho#肯定不会知道。",
        "听说#ho#赌球熟了很多钱……",
        "听说嫣然跟#ho#强经常搞基，这不会是真的吧？",
        "最喜欢看骂人小姐姐的直播了。",
        "#ho#今天把武器砸爆了，我简直笑死了。",
        "……嗯？嫣然是不是又偷懒了，我要去告诉副校长。",
        "#e#b我的秘密物品已经安全的藏在书桌下了，千万不能被副校长发现。#n",
        "困死了，什么时候才下课？",
        "刚看到影子跑了过去……告诉你，影子是一个人名。",
        "……洛洛小姐姐萌死了，真想捏她的小脸蛋。"
        );
var getOne1 = Math.floor(Math.random() * txt.length);
if (getOne1 != 9) {
        npc.sayNext(txt[getOne1], 1500029);
        npc.sayNextS("总之，这只是一张很普通的纸条。");
} else if (getOne1 == 9) {
        npc.sayNext(txt[9], 1500029);
        if (player.isQuestStarted(32110)) {
                npc.sayNextS("书桌下，秘密物品……这应该能成为线索。和#e#b魔法师库迪#n#k对话吧。");
                player.startQuest(32133, 1500000, "1");
        } else {
                npc.sayNextS("总之，这只是一张很普通的纸条。");
        }
}