/*
 * AuroMS MapleStory server emulator written in Java
 * Copyright (C) 2018 Kent
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/* global npc, player, map */

var jobData = new Array(

        Array("炼狱黑客1转", 6300 , 6003,10),
        Array("炼狱黑客2转", 6310 , 6300,30),
        Array("炼狱黑客3转", 6311 , 6310,60),
        Array("炼狱黑客4转", 6312 , 6311,100),

        Array("拳天（一转）", 17500 , 17000,10),
        Array("拳天（二转）", 17510 , 17500,30),
        Array("拳天（三转）", 17511 , 17510,60),
        Array("拳天（四转）", 17512 , 17511,100),


        Array("御剑骑士（一转）", 15100 , 15002,10),
        Array("御剑骑士（二转）", 15110 , 15100,30),
        Array("御剑骑士（三转）", 15111 , 15110,60),
        Array("御剑骑士（四转）", 15112 , 15111,100),

        Array("古迹猎人(1转)", 301, 0, 10,3),
        Array("古迹猎人(2转)", 330, 301, 30,3),
        Array("古迹猎人(3转)", 331, 330, 60,3),
        Array("古迹猎人(4转)", 332, 331, 100,3),
        
        Array("影魂异人", 15500, 15001, 10),
        Array("影魂异人(2转)", 15510, 15500, 30),
        Array("影魂异人(3转)", 15511, 15510, 60),
        Array("影魂异人(4转)", 15512, 15511, 100),

        Array("圣晶使徒", 15200, 15000, 10),
        Array("圣晶使徒(2转)", 15210, 15200, 30),
        Array("圣晶使徒(3转)", 15211, 15210, 60),
        Array("圣晶使徒(4转)", 15212, 15211, 100),

        Array("虎影(1转)", 16400, 16000, 10),
        Array("虎影(2转)", 16410, 16400, 30),
        Array("虎影(3转)", 16411, 16410, 60),
        Array("虎影(4转)", 16412, 16411, 100),

        Array("魔链影士", 6400, 6002, 10),
        Array("魔链影士(2转)", 6410, 6400, 30),
        Array("魔链影士(3转)", 6411, 6410, 60),
        Array("魔链影士(4转)", 6412, 6411, 100),

        Array("双刀入门", 400, 0, 10, 1),
        Array("见习刀客", 430, 400, 20, 1),
        Array("双刀客", 431, 430, 30, 1),
        Array("双刀侠", 432, 431, 45, 1),
        Array("血刀", 433, 432, 60, 1),
        Array("暗影双刀", 434, 433, 100, 1),

        Array("海盗（炮手）", 501, 0, 10, 2),
        Array("火炮手（二转）", 530, 501, 30, 2),
        Array("毁灭炮手（三转）", 531, 530, 60, 2),
        Array("神炮王", 532, 531, 100, 2),

        Array("龙的传人（一转）", 508, 0, 10, 10),
        Array("龙的传人（二转）", 570, 508, 30, 10),
        Array("龙的传人（三转）", 571, 570, 60, 10),
        Array("龙的传人（四转）", 572, 571, 100, 10),

        Array("战士", 100, 0, 10),
        Array("剑客", 110, 100, 30),
        Array("勇士", 111, 110, 60),
        Array("英雄", 112, 111, 100),

        Array("准骑士", 120, 100, 30),
        Array("骑士", 121, 120, 60),
        Array("圣骑士", 122, 121, 100),

        Array("枪战士", 130, 100, 30),
        Array("龙骑士", 131, 130, 60),
        Array("黑骑士", 132, 131, 100),

        Array("魔法师", 200, 0, 10),
        Array("火毒法师", 210, 200, 30),
        Array("火毒巫师", 211, 210, 60),
        Array("火毒魔导士", 212, 211, 100),
        Array("冰雷法师", 220, 200, 30),
        Array("冰雷巫师", 221, 220, 60),
        Array("冰雷魔导士", 222, 221, 100),
        Array("牧师", 230, 200, 30),
        Array("祭司", 231, 230, 60),
        Array("主教", 232, 231, 100),

        Array("弓箭手", 300, 0, 10),
        Array("猎人", 310, 300, 30),
        Array("射手", 311, 310, 60),
        Array("神射手", 312, 311, 100),

        Array("弩弓手", 320, 300, 30),
        Array("游侠", 321, 320, 60),
        Array("箭神", 322, 321, 100),

        Array("飞侠", 400, 0, 10),
        Array("刺客", 410, 400, 30),
        Array("无影人", 411, 410, 60),
        Array("隐士", 412, 411, 100),

        Array("侠客", 420, 400, 30),
        Array("独行客", 421, 420, 60),
        Array("侠盗", 422, 421, 100),
        Array("海盗", 500, 0, 10),

        Array("拳手", 510, 500, 30),
        Array("斗士", 511, 510, 60),
        Array("冲锋队长", 512, 511, 100),

        Array("火枪手", 520, 500, 30),
        Array("大副", 521, 520, 60),
        Array("船长", 522, 521, 100),
        /*骑士团联盟-------------------*/
        Array("魂骑士（一转）", 1100, 1000, 10),
        Array("魂骑士（二转）", 1110, 1100, 30),
        Array("魂骑士（三转）", 1111, 1110, 60),
        Array("魂骑士（四转）", 1112, 1111, 100),

        Array("炎术士（一转）", 1200, 1000, 10),
        Array("炎术士（二转）", 1210, 1200, 30),
        Array("炎术士（三转）", 1211, 1210, 60),
        Array("炎术士（四转）", 1212, 1211, 100),

        Array("风灵使者（一转）", 1300, 1000, 10),
        Array("风灵使者（二转）", 1310, 1300, 30),
        Array("风灵使者（三转）", 1311, 1310, 60),
        Array("风灵使者（四转）", 1312, 1311, 100),

        Array("夜行者（一转）", 1400, 1000, 10),
        Array("夜行者（二转）", 1410, 1400, 30),
        Array("夜行者（三转）", 1411, 1410, 60),
        Array("夜行者（四转）", 1412, 1411, 100),

        Array("奇袭者（一转）", 1500, 1000, 10),
        Array("奇袭者（二转）", 1510, 1500, 30),
        Array("奇袭者（三转）", 1511, 1510, 60),
        Array("奇袭者（四转）", 1512, 1511, 100),
        /*骑士团联盟-------------------*/

        Array("战神（一转）", 2100, 2000, 10),
        Array("战神（二转）", 2110, 2100, 30),
        Array("战神（三转）", 2111, 2110, 60),
        Array("战神（四转）", 2112, 2111, 100),

        Array("双弩精灵（一转）", 2300, 2002, 10),
        Array("双弩精灵（二转）", 2310, 2300, 30),
        Array("双弩精灵（三转）", 2311, 2310, 60),
        Array("双弩精灵（四转）", 2312, 2311, 100),

        Array("幻影（一转）", 2400, 2003, 10),
        Array("幻影（二转）", 2410, 2400, 30),
        Array("幻影（三转）", 2411, 2410, 60),
        Array("幻影（四转）", 2412, 2411, 100),

        Array("夜光法师（一转）", 2700, 2004, 10),
        Array("夜光法师（二转）", 2710, 2700, 30),
        Array("夜光法师（三转）", 2711, 2710, 60),
        Array("夜光法师（四转）", 2712, 2711, 100),
        /*恶魔联盟--------------------------*/
        Array("恶魔猎手（一转）", 3100, 3001, 10),
        Array("恶魔猎手（二转）", 3110, 3100, 30),
        Array("恶魔猎手（三转）", 3111, 3110, 60),
        Array("恶魔猎手（四转）", 3112, 3111, 100),

        Array("恶魔复仇者（一转）", 3101, 3001, 10),
        Array("恶魔复仇者（二转）", 3120, 3101, 30),
        Array("恶魔复仇者（三转）", 3121, 3120, 60),
        Array("恶魔复仇者（四转）", 3122, 3121, 100),
        /*恶魔联盟--------------------------*/

        /*反抗者联盟--------------------------*/
        Array("豹弩游侠（一转）", 3300, 3000, 10),
        Array("豹弩游侠（二转）", 3310, 3300, 30),
        Array("豹弩游侠（三转）", 3311, 3310, 60),
        Array("豹弩游侠（四转）", 3312, 3311, 100),

        Array("唤灵斗师（一转）", 3200, 3000, 10),
        Array("唤灵斗师（二转）", 3210, 3200, 30),
        Array("唤灵斗师（三转）", 3211, 3210, 60),
        Array("唤灵斗师（四转）", 3212, 3211, 100),

        Array("机械师（一转）", 3500, 3000, 10),
        Array("机械师（二转）", 3510, 3500, 30),
        Array("机械师（三转）", 3511, 3510, 60),
        Array("机械师（四转）", 3512, 3511, 100),

        Array("爆破手（一转）", 3700, 3000, 10),
        Array("爆破手（二转）", 3710, 3700, 30),
        Array("爆破手（三转）", 3711, 3710, 60),
        Array("爆破手（四转）", 3712, 3711, 100),
        /*反抗者联盟--------------------------*/

        /*尖兵联盟--------------------------*/
        Array("尖兵（一转）", 3600, 3002, 10),
        Array("尖兵（二转）", 3610, 3600, 30),
        Array("尖兵（三转）", 3611, 3610, 60),
        Array("尖兵（四转）", 3612, 3611, 100),
        /*尖兵联盟--------------------------*/

        /*米哈尔联盟--------------------------*/
        Array("米哈尔（一转）", 5100, 5000, 10),
        Array("米哈尔（二转）", 5110, 5100, 30),
        Array("米哈尔（三转）", 5111, 5110, 60),
        Array("米哈尔（四转）", 5112, 5111, 100),
        /*米哈尔联盟--------------------------*/


        Array("狂龙战士（一转）", 6100, 6000, 10),
        Array("狂龙战士（二转）", 6110, 6100, 30),
        Array("狂龙战士（三转）", 6111, 6110, 60),
        Array("狂龙战士（四转）", 6112, 6111, 100),

        Array("爆莉萌天使（一转）", 6500, 6001, 10),
        Array("爆莉萌天使（二转）", 6510, 6500, 30),
        Array("爆莉萌天使（三转）", 6511, 6510, 60),
        Array("爆莉萌天使（四转）", 6512, 6511, 100),

        Array("隐月（一转）", 2500, 2005, 10),
        Array("隐月（二转）", 2510, 2500, 30),
        Array("隐月（三转）", 2511, 2510, 60),
        Array("隐月（四转）", 2512, 2511, 100),

        Array("剑豪（一转）", 4100, 4001, 10),
        Array("剑豪（二转）", 4110, 4100, 30),
        Array("剑豪（三转）", 4111, 4110, 60),
        Array("剑豪（四转）", 4112, 4111, 100),

        Array("阴阳师（一转）", 4200, 4002, 10),
        Array("阴阳师（二转）", 4210, 4200, 30),
        Array("阴阳师（三转）", 4211, 4210, 60),
        Array("阴阳师（四转）", 4212, 4211, 100),
        
        Array("超能力者（一转）", 14200, 14000, 10),
        Array("超能力者（二转）", 14210, 14200, 30),
        Array("超能力者（三转）", 14211, 14210, 60),
        Array("超能力者（四转）", 14212, 14211, 100),

        Array("龙神（一转）", 2210, 2001, 10),
        Array("龙神（二转）", 2212, 2210, 30),
        Array("龙神（三转）", 2216, 2212, 60),
        Array("龙神（四转）", 2217, 2216, 100)
);
var flag = false;
var text = "请选择您要转职的职业：\r\n";
var subjob = player.getSubJob();
for (var i = 0; i < jobData.length; i++) {
        if (subjob == 1) {
                if (player.getJob() == jobData[i][2] && jobData[i][4] == 1) {
                        text += "#L" + i + "#" + jobData[i][0] + "\r\n";
                        flag = true;
                }
        } else if (subjob == 2) {
                if (player.getJob() == jobData[i][2] && jobData[i][4] == 2) {
                        text += "#L" + i + "#" + jobData[i][0] + "\r\n";
                        flag = true;
                }
        } else {
                var subtype = null == jobData[i][4] ? 0 : jobData[i][4];
				
                if (player.getJob() == jobData[i][2] && subtype == subjob) {
                        text += "#L" + i + "#" + jobData[i][0] + "\r\n";
                        flag = true;
                }
        }
}
if (flag) {
        let sel = npc.askMenu(text);
        let ret = npc.askYesNo("您是否要转职为:" + jobData[sel][0] + "。");
        if (ret == 1) {
                if (player.getLevel() < jobData[sel][3]) {
                        npc.sayNext("对不起,您的等级不足" + jobData[sel][3] + "级。");
                } else {
                        player.setJob(jobData[sel][1]);
                        player.gainSp(3);
                        player.gainItem(2431305,1);
                        player.maxSkills();
                }
        }
} else {
        npc.sayNext("对不起,你现在已经不能转职。"+subjob);
}





        