var status = 0;
var aaa = "#fUI/UIWindow/AriantMatch/characterIcon/5#";
var ax3 = "#fMap/MapHelper.img/weather/thankyou/4#"; //小的红色的  //"#fEffect/ItemEff/1048001/0/0#";//雪花
var yun = "#fUI/UIWindow/Megaphone/2#"; ////红沙漏
var yun2 = "#fUI/UIWindow/Quest/icon8/0#"; ////蓝指标
var yun8 = "#fUI/UIWindow/MonsterBook/arrowLeft/normal/0#"; ////金左指标
var yun9 = "#fUI/UIWindow/MonsterBook/arrowRight/normal/0#"; ////金右指标
var yun4 = "#fUI/UIWindow/Quest/reward#"; ////奖励
//var xax = "#fEffect/CharacterEff/1112906/0/0#";
var xax = "#fMap/MapHelper.img/weather/thankyou/4#"; //小的红色的
var ttt = "#fUI/UIWindow/Quest/icon2/7#"; //"+ttt+"//美化1
var ttt2 = "#fUI/UIWindow/Quest/icon6/7#"; ////美化2
var ttt3 = "#fUI/UIWindow/Quest/icon3/6#"; //"+ttt3+"//美化圆
var ttt4 = "#fUI/UIWindow/Quest/icon5/1#"; //"+ttt4+"//美化New
var ttt5 = "#fUI/UIWindow/Quest/icon0#"; ////美化!
var ttt7 = "#fUI/Basic/BtHide3/mouseOver/0#"; //"+ttt6+"//美化会员
var ttt6 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var epp = "#fEffect/CharacterEff/1082312/0/0#"; //彩光
var eff = "#fCharacter/Weapon/01702523.img/48/straight/0/effect#"; //彩虹带
var tt1 = "#fUI/UIPVP.img/MiniMapIcon/star#"; //黄星星
var tt2 = "#fUI/UIPVP.img/MiniMapIcon/star#"; //黄星星
var tt3 = "#fUI/UIPVP.img/MiniMapIcon/star#"; //黄星星
var tz10 = "#fEffect/CharacterEff/1112903/0/0#"; //红心
var axx1 = "#fEffect/CharacterEff/1062114/1/0#"; //爱心
var eff = "#fEffect/CharacterEff/1112905/0/1#"; //
var epp = "#fEffect/CharacterEff/1082312/0/0#"; //彩光
var epp1 = "#fEffect/CharacterEff/1082312/2/0#"; //彩光1
var axx = "#fEffect/CharacterEff/1051294/0/0#"; //爱心
var xxx = "#fEffect/CharacterEff/1082565/2/0#"; //星系
var kkk = "#fEffect/CharacterEff/1112925/0/0#"; //蓝星
var ppp = "#fEffect/CharacterEff/1112907/4/0#"; //泡炮 
var epp3 = "#fEffect/CharacterEff/1112908/0/1#"; //彩光3
var tz9 = "#fEffect/CharacterEff/1042176/2/0#"; //爱心
var zs = "#fEffect/CharacterEff/1112946/2/0#"; //砖石粉
var zs1 = "#fEffect/CharacterEff/1112946/1/1#"; //砖石蓝
var dxxx = "#fEffect/CharacterEff/1102232/2/0#"; //星系
var tz = "#fEffect/CharacterEff/1082565/2/0#"; //兔子蓝
var tz1 = "#fEffect/CharacterEff/1082565/4/0#"; //兔子粉
var tz7 = "#fEffect/CharacterEff/1112900/3/1#"; //音符红
var tz8 = "#fEffect/CharacterEff/1112900/4/1#"; //音符绿
var tz88 = "#fEffect/CharacterEff/1112900/5/1#"; //音符绿!
var yun1 = "#fUI/UIWindow/Quest/icon7/10#"; ////红色圆
//var axx1= "#fEffect/CharacterEff/1112902/0/0#";  //蓝心
//var tz10 = "#fEffect/CharacterEff/1112925/0/1#";  //红心
var tz11 = "#fEffect/CharacterEff/1112904/0/0#"; //彩心
var tz12 = "#fEffect/CharacterEff/1112924/0/0#"; //黄星
var tz13 = "#fEffect/CharacterEff/1112925/0/0#"; //蓝星
var tz14 = "#fEffect/CharacterEff/1112926/0/0#"; //红星
var ltz41 = "#fMap/MapHelper.img/weather/birthday/5#"; //
var ltz42 = "#fMap/MapHelper.img/weather/birthday/2#"; //
var ltz43 = "#fMap/MapHelper.img/weather/lovelypartybear/7#";
var ltz44 = "#fMap/MapHelper.img/weather/lovelypartybear/6#";
var ltz45 = "#fMap/MapHelper.img/weather/lovelypartybear/3#"; //
var ltz46 = "#fMap/MapHelper.img/weather/thankyou/4#"; //小的红色的
var ltz39 = "#fMap/MapHelper.img/weather/lovelypartybear/7#"; //盒子
var ltz26 = "#fMap/MapHelper.img/weather/2011Haloween/6#"; //绿色蜡烛
var ltz27 = "#fMap/MapHelper.img/weather/2011Haloween/7#"; //红色蜡烛
var ltz37 = "#fMap/MapHelper.img/weather/lovelypartybear/3#"; //盒子
var ltz38 = "#fMap/MapHelper.img/weather/lovelypartybear/6#"; //盒子
var ltz50 = "#fUI/UIMiniGame.img/starPlanetRPS/heart#"; //红爱心
var tz15 = "#fEffect/CharacterEff/1112949/0/0#"; //花样音符
var tz16 = "#fEffect/CharacterEff/1112949/1/0#"; //花样音符
var tz17 = "#fEffect/CharacterEff/1112949/2/0#"; //花样音符
var tz18 = "#fEffect/CharacterEff/1112949/3/0#"; //花样音符
var tz19 = "#fEffect/CharacterEff/1112949/4/0#"; //花样音符
var tz20 = "#fEffect/CharacterEff/1114000/1/0#"; //红星花
var a1 = "#fEffect/CharacterEff/1003393/1/0#"; //黄色星星
var xg = "#fEffect/CharacterEff/1112901/0/1#"; //黄色星星
var hs = "#fEffect/CharacterEff/1114000/2/0#"; //红色闪光
var hsq = "#fEffect/CharacterEff/forceAtom/0/atom/1/parentAtom/1#"; //红色球
var ax = "#fEffect/CharacterEff/1112906/0/1#"; //黄色星星
var ax2 = "#fEffect/CharacterEff/1112903/1/1#"; //黄色星星
var d1 = "#fUI/UIWindowBT.img/WorldMap/NoticeIcon/0#"; //信封
var lscb = "#fMap/MapHelper.img/weather/starPlanet/3#";
var hscb = "#fMap/MapHelper.img/weather/starPlanet/2#";
var lscba = "#fMap/MapHelper.img/weather/starPlanet2/3#";
var hdj = "#fMap/MapHelper.img/weather/knitsWithWarmWinter/9#";
var hwtext = new Array("人长得漂亮不如活得漂亮！", "当裤子失去皮带，才懂得什麽叫做依赖。", "烟不听话，所以我们'抽烟'。", "你发怒一分钟，便失去60秒的幸福。", "当男人遇见女人，从此只有纪念日，没有独立日。", "路见不平一声吼，吼完继续往前走。", "幸福是个比较级，要有东西垫底才感觉得到。", "知识就像内裤，看不见但很重要", "作为失败的典型，你实在是太成功了", "女人喜欢长得坏坏的男人，不是喜欢长坏了的男人", "跌倒了，爬起来再哭", "你若流泪，先湿的是我的心", "让未来到来，让过去过去", "我自横刀向天笑，笑完之后去睡觉", "别跟我谈感情，谈感情伤钱", "孤单是一个人的狂欢，狂欢是一群人的孤单", "姐不是收破烂的，做不到让你随喊随到", "我不是草船，你的贱别往我这发", "你的矮是终身的，我的胖却是暂时的", "別在无聊的时候來找我，不然显得我是多余的", "姐不是电视机，不要老是盯着姐看", "即使你已名花有主、我也要移花接木", "心里只有你一个频道 最可恨的是还没有广告", "给你最大的报复，就是活的比你幸福", "要不是老师说不能乱扔垃圾，不然我早把你扔出去", "没有癞蛤蟆，天鹅也会寂寞", "我是光棍我可耻，我给国家浪费纸", "人生没有如果，只有后果和结果", "你那么有钱 为什么不让鬼来推磨？", "别把人和狗相提并论，狗最起码忠诚", "生活嘛，就是生下来，活下去", "当你披上了婚纱 我也披上了袈裟", "趁着年轻把能干的坏事都干了吧，没几年了", "我人生只会两件事 1这也不会 2 那也不会", "出租车司机，司机中的战斗机，噢耶! ", "思想有多远，你就给我滚多远!", "人生最大的悲哀是青春不在,青春痘却还在。", "最简单的长寿秘决:保持呼吸，不要断气~", "打死我也不说，你们还没使美人计呢!", "不要和我比懒,我懒得和你比", "我不是个随便的人 我随便起来不是人", "不怕虎一样的敌人，就怕猪一样的队友", "老虎不发威 你当我是HELLO KITTY！", "吃自助最高境界：扶墙进，扶墙出。", "爷爷都是从孙子走过来的……", "夏天就是不好，穷的时候我连西北风都没得喝", "没什么事就不要找我，有事了更不要找我。", "我想早恋，可是已经晚了……", "钱可以解决的问题都不是问题。", "天哪，我的衣服又瘦了！", "不吃饱哪有力气减肥啊？", "连广告也信，读书读傻了吧？", "人怕出名猪怕壮，男怕没钱女怕胖。", "如果有钱也是一种错，我情愿一错再错", "命运负责洗牌，但是玩牌的是我们自己！", "好好活着，因为我们会死很久!", "人又不聪明，还学人家秃顶！", "我总在牛a与牛c之间徘徊。", "不怕被人利用，就怕你没用。", "鄙视我的人这么多，你算老几? ", "秀发去无踪，头屑更出众！", "春色满园关不住，我诱红杏出墙来。", "问世间情为何物？一物降一物", "bmw是别摸我，msn是摸死你", "女为悦己者容,男为悦己者穷！ ", "念了十几年书，还是幼儿园比较好混");
var item;
var chibang = Array(
	1103096,
	1102695,
	1103219,
	1103310,
    1103182,
	1102992, //星座的影子
	1103248,
	1102039, //透明披风
	1100001, //拿破仑披风
	1100000, //拿破仑披风-男款
	1102005, //小天使翅膀
	1102006, //小恶魔翅膀
	1103131,
	1103181,
	1103183,
	1103210,
	1103231,
	1103151,
	1102671,
	1103240,
	1102007, //黄星星披风
	1102008, //蓝星星披风
	1102009, //红星星披风
	1102010, //黑星星披风
	1102019, //太极披风
	1102020, //乌龟背壳
	1102044, //红色机器翅膀
	1102045, //蓝色机器翅膀
	1102058, //恶魔之翼
	1102059, //圣天使之翼
	1102060, //蝴蝶夫人结
	1102065, //圣诞披风
	1102066, //邪魔披风
	1102067, //老虎尾巴
	1102068, //魔鬼翅膀
	1102069, //粉翼
	1102070, //蓝色报童包
	1102072, //草绿郊游包
	1102073, //粉红郊游包
	1102074, //闪闪发光的蝴蝶翼
	1102075, //蝙蝠翅膀
	1102076, //报纸披风
	1102077, //鸭绒被
	1102091, //彩虹风筝
	1102092, //玩具熊
	1102093, //心心气球
	1102094, //猴子尾巴
	1102095, //比耶莫特的翅膀
	1102096, //夏其尔的翅膀
	1102097, //亚努斯的翅膀
	1102098, //升官发财
	1102107, //火箭炮
	1102108, //恶魔尾巴
	1102110, //松鼠尾巴
	1102111, //大象气球
	1102112, //垂耳兔
	1102137, //花蘑菇气球
	1102138, //天使背囊
	1102141, //小企鹅气球
	1102142, //火焰披风
	1102144, //老僧人披肩
	1102148, //熔岩披风
	1102149, //冰凌披风
	1102150, //吸血鬼披风
	1102151, //迷路的小猫咪
	1102152, //黑骷髅海盗旗
	1102153, //红色荧光蝴蝶翼
	1102154, //扎昆爪爪
	1102155, //小狗狗松儿
	1102156, //风度围脖
	1102157, //傀儡枷锁
	1102158, //孔雀羽毛
	1102159, //HELLO MONKEY 气球
	1102160, //猴子披风
	1102164, //摇滚电吉他
	1102169, //蓝色天使背囊
	1102175, //可爱小绵羊披风
	1102184, //圣诞天使之翼
	1102186, //乖猫猫双肩包
	1102187, //金色狐狸尾巴
	1102188, //银色狐狸尾巴
	1102196, //点点星光围巾
	1102197, //报喜鸟披风
	1102199, //玲珑彩灯
	1102202, //异界披风
	1102203, //超强力火箭炮
	1102204, //浪漫玫瑰
	1102208, //囧水灵
	1102210, //蜜蜂尾巴
	1102213, //品克缤的小尾巴
	1102214, //品克缤气球
	1102215, //气球串
	1102216, //狗狗尾巴
	1102217, //九尾披风
	1102218, //仙女飘飘
	1102222, //死神披风
	1102223, //炫彩星星披风
	1102224, //小绵羊披风
	1102225, //嫦娥披风
	1102229, //小熊熊披风
	1102230, //企企雪橇披风
	1102232, //小王子的星星
	1102233, //雪娃娃披风
	1102238, //灰蒙蒙猫尾巴
	1102239, //暗影双刀披风
	1102242, //胡克的船长披风
	1102245, //太阳披风
	1102249, //奥兹魔法披风
	1102253, //紫色之翼
	1102254, //豹弩游侠披风
	1102255, //唤灵斗师披风
	1102258, //玩具熊气球
	1102261, //音符围脖
	1102267, //我的朋友九尾狐尾巴
	1102270, //风和日丽
	1102271, //可爱巧克力棒气球
	1102272, //魔术师披风
	1102274, //刺柏刀
	1102285, //晴天娃娃(粉色)
	1102286, //晴天娃娃(天蓝色)
	1102287, //晴天娃娃(淡黄色)
	1102288, //背背雪人
	1102290, //落英飞天丝带
	1102292, //闪耀彩虹
	1102293, //羁绊束缚之翼
	1102296, //夜叉尾巴(黑色)
	1102300, //派对舞会灯
	1102301, //旅行者披风
	1102307, //新·夏其尔的翅膀
	1102308, //新·比耶莫特的翅膀
	1102309, //新·亚努斯的翅膀
	1102310, //精灵披风
	1102319, //传说心跳气球
	1102323, //传说小可爱气球
	1102324, //传说双层气球
	1102325, //紫天使羽翼
	1102326, //蓝天使羽翼
	1102336, //炼金师的披风
	1102338, //小蜜蜂翅膀
	1102343, //军团长的披风
	1102344, //精灵王的披风
	1102349, //发光精灵翅膀
	1102350, //粉红微笑胖鬼怪
	1102353, //自由的翅膀
	//1102354, //粉嫩披风
	1102355, //怪盗幻影披风
	1102356, //天使祖母绿
	1102357, //漂亮品克缤气球
	1102358, //圆圆水晶魔球
	1102359, //胖胖雪人气球
	1102367, //精灵精神披风
	1102368, //落英飞天丝带
	1102373, //露西娅披风
	1102374, //飞行小猴披风
	1102376, //粉色旋律翅膀
	1102377, //普赛克时空
	1102378, //普赛克旋律
	1102380, //我的朋友青蛙酱
	1102381, //皇家公爵翅膀
	1102385, //路易斯四翼天使
	1102386, //诺克斯四翼天使
	1102387, //海龙尾巴
	1102388, //炎龙尾巴
	1102389, //金色天使
	1102390, //银色天使
	1102391, //小蜜蜂翅膀
	1102392, //西式风情披风
	1102419, //露西娅披风
	1102420, //星尘披肩
	1102421, //圆滚滚的微笑柠檬
	1102450, //天使光芒之翼
	1102451, //黑暗光芒之翼
	1102452, //精灵光芒之翼
	1102453, //树妖
	1102461, //粉嫩披风
	1102465, //银河牛仔披风
	1102466, //高贵之神
	1102487, //夜光法师四翼天使
	1102488, //蛋糕杯气球
	1102491, //阳光明媚
	1102496, //超级蜜蜂妖精翅膀
	1102501, //[MS特价]我的朋友九尾狐尾巴
	1102503, //猫咪洛丽塔披风
	1102508, //考拉披风
	1102510, //猫尾莎啦啦
	1102511, //圣洁四翼天使
	1102512, //黑暗力量披风
	1102531, //僵尸猎人披风
	1102532, //光芒智天使
	1102537, //星尘披肩
	1102542, //胡克的船长披风
	1102543, //奥兹魔法披风
	1102544, //信天翁披风
	1102545, //信天翁披风
	1102546, //蓝色幻想之翼
	1102547, //粉色幻想之翼
	1102548, //绿色幻想之翼
	1102549, //管家的猫咪
	1102550, //绿宝石翅膀
	1102551, //蓝宝石翅膀
	1102554, //鬼娃娃之翼
	1102555, //大天使的翅膀
	1102564, //天衣无缝
	1102572, //格拉泰斯光芒之翼
	1102574, //小鸡叽叽叽
	1102575, //路易斯四翼天使
	1102576, //诺克斯四翼天使
	1102577, //银色天使
	1102582, //GM队长的露西娅披风
	1102583, //宝宝龙波比
	1102587, //安琪莉可的光环
	1102588, //黑暗光芒之翼
	1102589, //精灵光芒之翼
	1102591, //口袋怪物胜利者披风
	1102592, //蝙蝠魔气球
	1102593, //浮漾的棒球
	//1102601, //兹博伊双手剑
	//1102604, //蒼穹之翼
	1102605, //暗炎赎罪者
	1102608, //超级巨星水晶魔球
	1102609, //粉色旋律翅膀
	1102610, //普赛克时空
	1102611, //普赛克旋律
	1102615, //熊宝宝发条
	1102616, //拉比斯之精气
	1102617, //拉兹丽之精气
	1102619, //喜欢冰的小企鹅
	1102620, //我的烟火秀
	1102621, //啰嗦扩音器
	1102622, //时间旅行者的怀表
	1102624, //天王星光芒之翼
	1102625, //蜗牛披风
	1102630, //浪漫四翼天使
	1102631, //万圣节幻影披风
	1102632, //岩炎赎罪披风
	1102643, //金色之翼
	1102644, //粉色光芒之翼
	1102646, //烈焰之翼
	1102650, //隐月狐尾
	1102651, //小熊猫尾巴
	1102652, //松鼠尾巴
	1102653, //兔尾巴
	1102654, //狗狗尾巴
	1102655, //熊熊尾巴
	1102656, //动物尾巴6
	1102657, //动物尾巴7
	1102658, //动物尾巴8
	1102659, //真·高贵之神
	1102665, //雪之女神围脖
	1102667, //寻找满月
	1102668, //夜天使之翼
	1102669, //壕
	1102671, //肃清者的荆翼
	1102672, //唠叨话喇叭
	1102673, //僵尸新娘披风
	1102674, //小小寿司团
	1102675, //糖果甜甜蝴蝶结
	1102676, //摇摆猫咪酱
	1102682, //未来天使注射器
	1102683, //兔兔熊背包
	1102684, //未来医生听诊器
	1102685, //熊宝宝披风
	1102688, //双色砰砰炮
	1102690, //柴郡猫的狐狸围脖
	1102692, //小小寿司团
	1102694, //迷你迷你绿水灵
	1102697, //红色蜻蜓翅膀
	1102698, //翠绿之翼
	1102699, //岩浆之翼
	1102700, //蓝色光芒之翼
	1102702, //红色蝴蝶羽翼
	1102703, //蓝色蝴蝶羽翼
	1102704, // 精灵翅膀
	1102705, //背着海鸥去旅行
	1102706, //极光音符披风
	1102707, //蓝色梦想海螺
	1102708, //粉色梦想海螺
	1102709, //双色糖果翅膀
	1102712, //梦寐不忘度假胜地
	1102723, //光明天使羽翼
	1102724, //黑暗天使羽翼
	1102725, //亲亲宝贝海獭
	1102726, //胡萝卜披风
	1102729, //蝴蝶之恋羽翼
	1102730, //闪耀光芒之翼
	1102747, //可爱熊猫
	1102748, //兔熊野营背包
	1102749, //五彩星星气球
	1102754, //群鸟之星
	1102755, //星光点点气球
	1102756, //微笑玉米斗篷
	1102757, //巴尼兔心形气球
	1102758, //小天使翅膀
	1102759, //滴溜溜朋友们
	1102761, //奢华羊绒斗篷
	1102766, //暴走斯乌黑色火焰
	1102767, //奥尔卡的吊瓶
	1102772, //幽灵披风
	1102773, //幽灵披风
	1102778, //棒棒糖披风
	1102779, //黄金光之翼
	1102780, //与艾伦同在
	1102781, //与三笠同在
	1102782, //与阿尼同在
	1102783, //与萨莎同在
	1102784, //与赫里斯塔同在
	1102785, //与利威尔同在
	1102786, //从巨人处逃走
	1102787, //调查兵团披风
	1102788, //与阿明同在披风
	1102789, //白熊围巾
	1102798, //海蓝光之翼
	1102800, //暖棉棉披风
	1102801, //银色的狼披风
	1102807, //金鱼披风
	1102808, //啵啵鼠气球
	1102809, //死亡华尔兹
	1102811, //雪花飘飘
	1102812, //决战！暴雪！
	1102813, //肩膀上的布兰奇
	1102815, //福袋
	1102816, // 闪亮小叮当
	1102818, //星星幻想披风
	1102819, //小淘气披风
	1102820, //朦胧的夜晚
	1102822, //花语
	1102823, //双色梦幻之翼
	1102824, //双色幻想之翼
	1102827, //王的披风
	1102831, //高飞
	1102835, //海贼团披风 
	1102836, //薄荷喵漫游仙境
	1102837, //盗梦空间
	1102841, //爱莉丝的泡泡
	1102842, //菠萝斜挎包
	1102844, //鼠鼠和兔兔
	1102845, //蓝嘟嘟熊披风
	1102847, //莲花学院守护魂火
	1102848, //重力场
	1102853, //满月清辉披风
	1102857, // 传说中的鱼人
	1102858, //永恒时间齿轮 
	1102859, //蓝色雪花飘飘
	1102861, //乌鲁斯之光
	1102863, //BIU小彩虹
	1102864, //蔬果纷飞 
	1102865, //乌云盖顶
	1102868, //蝙蝠兄弟披风
	1102869, //花瓣飘飘
	1102870, //深夜黑棺
	1102874, //花精灵翅膀
	1102875, //失忆的外星人
	1102876, //自嗨时间
	1102877, //蓝色海军愉悦心情
	1102884, //保罗熊披风
	1102888, //龙神龙披风
	1102890, //皇家双弩精灵披风
	1102892, //神秘幻影披风
	1102894, //寒冰战神披风
	1102896, //正直夜光法师披风
	1102898, //秘密隐月披风
	1102900, //粉嫩雪花
	1102901, //美的冒泡
	1102902, //跳动的心
	1102903, //香蕉猴子气球
	1102905, //阳光普照
	1102906, //黑色奈落的后背拥抱
	1102907, //冰花之翼
	1102908, //冬日雪人披风
	1102910, //冰凌雪绒花
	1102912, //妖异的火焰
	1102913, //月光蝴蝶
	1102914, //蓝色蝴蝶之舞
	1102915, //缪斯的蝴蝶精灵
	1102916, //亲亲宝贝玩具披风
	1102917, //天使饼干背包
	1102918, //燃烧光环
	1102919, //小鸭鸭部队
	1102920, //春天的气息
	1102926, //鲨鱼尾巴
	1102927, //喵咪围巾
	1102928, //粉红蝴蝶精灵
	1102929, //全黑的恶魔
	1102930, //雨滴滴滴
	1102932, //阿丽莎的翅膀
	1102933, //阿丽莎之花翼
	1102934, //雪精灵
	1102935, //北风那个吹
	1102936, //森林的低语
	1102937, //动物总动员披风
	1102938, //幻想中的海滩
	1102939, //中式祥云披风
	1102945, //我的喵脚印
	1102947, //New天使祖母绿
	1102949, //纯粹之翼
	1102950, //彩虹气泡
	1102951, //冰淇淋之友
	1102952, //
	1102953, //镰鼬尾巴
	1102954, //猫头鹰披风
	1102955, //月兔铃音
	1102956, //灵魂歌手披风
	1102957, //锁链公主披风
	1102958, //夜蝙蝠披风
	1102959, //永恒之梦
	1102960, //紫色之梦
	1102961, //不要太热闹
	//1102962, //羁绊之翼
	1102964, //轻盈的心动
	1102965, //萤火虫之舞
	1102967, //万圣节幻影
	1102968, //冰封之翼
	1102969, //今日天气 : 晴
	1102970, //今日天气 : 雨
	1102971, //今日天气 : 雷
	1102972, //冬木翅膀
	1102973, //凌晨的宝石
	1102974, //小星光水波
	1102975, //怪猫气球
	1102976, //星星糖粉
	1102977, //鸡大神的祝福
	1102978, //圣诞闪耀
	1102981, //爱心蝴蝶结披风
	1102982, //涅槃火焰翅膀
	1102983, //雪月花伞
	1102984, //白夜叉披风
	1102988, //雪花的低语
	1102991, //极地探险背囊
	1102992, //星座的影子
	1102994, //我的喵脚印
	1102995, //超星魔导披风
	1102998, //蓬松小尾巴
	1102999, //淘气彩虹
	1103000, //火箭爆竹芯披风
	1103002, //守望者披风
	1103003, //爱心羽翼
	1103004, //搞怪斗篷
	1103007, //恶魔的背包
	1103008, //潘多拉披风
	1103009, //雪之铃兰披风
	1103010, //快乐的心情
	1103011, //埃尔达的溪流
	1103012, //大侦探助手黄蘑菇
	1103013, //樱桃香气
	1103014, //幼苗满盆
	1103015, //拿破仑披风
	1103018, //蓝色波涛
	1103019, //花叶的歌颂
	1103020, //宇宙伙伴
	1103021, //无限之翼
	1103022, //冒险星系披风
	1103023, //梦境羽翼
	1103024, //甜蜜人生
	//1103025, //超越披风
	1103026, //森林密语披风
	1103027, //潜水必备
	1103028, //灵魂的重量披风
	1103029, //一滴滴
	1103030, //来玩吧披风
	1102832,
	1103031, //雪莉的庭院
	1103033, //柠檬披风
	1103034, //夏日花精灵披风
	1103035, //去郊游的日子
	1103036, //流星许愿
	1103037, //羽毛信使披风
	1103038, //魔神披风(女)
	1103039, //黑影披风
	1103040, //就是喜欢你喵披风
	1103041, //浪花翅膀
	1103042, //魔神披风(男)
	1103043, //平衡喵尾巴
	1103044, //会动的猫尾巴
	1103045, //花朵猫咪气球
	1103046, //黑暗军师披风
	1103047, //ExcavationDog
	1103048, //黄色忠犬尾巴
	1103049, //粉色萌犬尾巴
	1103050, //金色共鸣
	1103051, //纯金发条娃娃
	1103052, //天使格蕾
	1103053, //血色烙印
	1103054, //红色刻印
	1103152, //甜甜雪花
	1103126, //迷雾小夜曲
	1103128, //迷雾小夜曲
	1103129, //迷雾幻想曲
	1103127, //迷雾幻想曲
	1103055, //魔法乐章
	1103056, //彩蝶飞舞披风
	1103057, //纯白大蝴蝶结
	1103058, //巴尼兔斗篷(女)
	1103060, //软软粉熊脚印
	1103061, //软软蓝熊熊脚印
	1103065, //卡德娜复仇之翼
	1103066, //爆怒
	1103067, //梦想的束缚
	1103068, //软绵绵披风
	1103072, //暖融融披风
	1103075, //哦我的船长
	1103076, //喜洋洋围脖
	1103077, //皇家卫队披风
	1103078, //极地探险背囊
	1103079, //梅花朵朵开
	1103080, //霸气满溢的披风
	1103081, //狗狗祝福披风
	1103082, //心花怒放披风
	1103083, //春之景拍摄中
	1103084, //约会大作战(男)
	1103085, //约会大作战(女)
	1103087, //被巧克力环绕
	1103092, //毛绒绒大尾巴
	1103093, //周年快乐
	1103098, //清爽丝带（女）
	1103099, //清爽丝带（男）
	1103100, //无上至尊羽翼
	1103108, //艾尔达披风
	1103111, //15周年披风
	1103148, //艾尔达披风
	1103236, //艾尔达披风
	1103252, //艾尔达披风
	1103235, //艾尔达披风
	1103243, //艾尔达披风
	1103117, //艾尔达披风
	1103193, //艾尔达披风
	1103212, //艾尔达披风
	1102946, //艾尔达披风
	1103206 //艾尔达披风
);


		var selStr = "#e  " + ltz42 + " " + ltz43 + " " + ltz44 + " " + ltz45 + " #r翅膀进化 " + ltz45 + " " + ltz44 + " " + ltz43 + " " + ltz41 + "#n#k#n#k\r\n\r\n";
		selStr += "" + hdj + " #d#e欢迎使用翅膀进阶系统：#n#k\r\n\r\n";
		selStr += "#L0#" + lscb + "  #d1). 翅膀进阶 " + lscb + "#k#l\r\n";
		selStr += "#L1#" + lscba + " #r2). 领取翅膀 " + lscba + "#k#l\r\n";
		selStr += "#L2#" + hscb + " #b3). 满级翅膀美化 " + hscb + "#k#l\r\n";
		let selection=npc.askMenuS(selStr);
		var item =player.getInventorySlot(6,1);
		if(selection==0){
			if(item== null) {
					
					npc.say("请把初级翅膀放在装备栏的第一个格子");
			}else if(item.getDataId()==1102729 ||item.getDataId()==1102451 ||item.getDataId()==1102575 ||item.getDataId()==1102572 ||item.getDataId()==1102624||item.getDataId()==1102724 ||item.getDataId()==1102723 ||item.getDataId()==1102798 ){
				
					player.runScript("cbjh");
					
			} else {
				npc.say("#b未查询到您有初阶段翅膀,无法让您使用翅膀进阶功能#k\r\n\r\n" + aaa + "\r\n- #d#e进阶翅膀说明#k#n\r\n\r\n#b1). 请点击领取翅膀领取初阶翅膀。\r\n#r2). 请把要进阶的翅膀放在背包第一格。");
				
			}
		}else if(selection==1){
			if(player.getPQLog("初阶段翅膀") <2 && player.canGainItem(1102729,1) ) {
					player.gainGachaponItem("初级翅膀领取",1102729, 1,1);
					player.addPQLog("初阶段翅膀",1,999);
					
					npc.say(" #b成功领取了初阶段翅膀一个。请妥善保管每次进阶的翅膀。下次再无法从我这里领取初级翅膀了。");
					
				} else {
					npc.say("#b您已经领取过。或者背包已满。#k\r\n\r\n\r\n- #d#e进阶翅膀说明#k#n\r\n\r\n#b1). 请点击领取翅膀领取初阶翅膀。\r\n#r2). 请把要进阶的翅膀放在背包第一格。");
					
				}
		}else if(selection==2){
			var txt = "";
			txt += "#r当您的翅膀升级到满级的时候可以来我这里更换造型#k\r\n\r\n" + hdj + "\r\n";
			txt += "- #d#e请注意：#k#n\r\n\r\n";
			txt += "#b1). 满级翅膀要放在第一个格子。\r\n";

			npc.askYesNo(txt);
			if(item==null){
				npc.say("请把翅膀放在第一格");
			}else if(item.getTitle()!="火焰羽毛7阶"){
				npc.say("请确定您的翅膀是否升到了满级或者物品是否正确");
			}else{
				var txt = "#r请选择您要更换的翅膀造型：#k\r\n";
				for(var i = 0; i < chibang.length; i++) {
					txt += "#L" + i + "# #v" + chibang[i] + "##z" + chibang[i] + "#  #l\r\n";
				}
				let sel =npc.askMenuS(txt);
				
				item.setItemId(chibang[sel]);
				player.updateItem(1,item);
				npc.say("翅膀造型更换成功");
				
			}
			
			
		}