var status = -1;

var 影子币 = Array(
	Array(1132174, 650), //暴君西亚戴斯腰带 - (无描述)
	Array(1132175, 650), //暴君赫尔梅斯腰带 - (无描述)
	Array(1132176, 650), //暴君凯伦腰带 - (无描述)
	Array(1132177, 650), //暴君利卡昂腰带 - (无描述)
	Array(1132178, 650), //暴君阿尔泰腰带 - (无描述)
	Array(1102481, 650), //暴君西亚戴斯披风 - (无描述)
	Array(1102482, 650), //暴君赫尔梅斯披风 - (无描述)
	Array(1102483, 650), //暴君凯伦披风 - (无描述)
	Array(1102484, 650), //暴君利卡昂披风 - (无描述)
	Array(1102485, 650), //暴君阿尔泰披风 - (无描述)
	Array(1082543, 650), //暴君西亚戴斯手套 - (无描述)
	Array(1082544, 650), //暴君赫尔梅斯手套 - (无描述)
	Array(1082545, 650), //暴君凯伦手套 - (无描述)
	Array(1082546, 650), //暴君利卡昂手套 - (无描述)
	Array(1082547, 650), //暴君阿尔泰手套 - (无描述)
	Array(1072743, 650), //暴君西亚戴斯靴 - (无描述)
	Array(1072744, 650), //暴君赫尔梅斯靴 - (无描述)
	Array(1072745, 650), //暴君凯伦靴 - (无描述)
	Array(1072746, 650), //暴君利卡昂靴 - (无描述)
	Array(1072747, 650) //暴君阿尔泰靴 - (无描述)
);
var 贝勒币 = Array(
	Array(1113075, 1800), //最高级贝勒德戒指1800个贝勒德币兑换, 650),//, 650),//, 650),//, 650),//
	Array(1032223, 1800), //最高级贝勒德耳环1800个贝勒德币兑换, 650),//, 650),//, 650),//, 650),//
	Array(1132246, 1800), //最高级贝勒德刻印腰带1800个贝勒德币兑换, 650),//, 650),//, 650),//, 650),//
	Array(1122267, 1800), //最高级贝勒德刻印吊坠1800个贝勒德币兑换, 650),//, 650),//, 650),//, 650),//
	Array(1113074, 800), //高级贝勒德戒指800个贝勒的币兑换, 650),//, 650),//, 650),//
	Array(1122266, 800), //高级贝勒德刻印吊坠800个贝勒的币兑换, 650),//, 650),//, 650),//, 650),//
	Array(1032222, 800), //高级贝勒德耳环800个贝勒的币兑换
	Array(1132245, 800) //高级贝勒德刻印腰带800个贝勒的币兑换, 650),//, 650),//, 650),//, 650),//
);
var 困难 = Array(
	
	Array(1214018, 300),
	Array(1282017, 300),
	Array(1272017, 300),
	Array(1482221, 300),
	Array(1212120, 300),
	Array(1222113, 300),
	Array(1232113, 300),
	Array(1242121, 300),
	Array(1252098, 300),
	Array(1262039, 300),
	Array(1302343, 300),
	Array(1312203, 300),
	Array(1322255, 300),
	Array(1332279, 300),
	Array(1342104, 300),
	Array(1362140, 300),
	Array(1372228, 300),
	Array(1382265, 300),
	Array(1402259, 300),
	Array(1412181, 300),
	Array(1422189, 300),
	Array(1432218, 300),
	Array(1442274, 300),
	Array(1472265, 300),
	Array(1492235, 300),
	Array(1452257, 300),
	Array(1522143, 300),
	Array(1532150, 300),
	Array(1542117, 300),
	Array(1552119, 300),
	Array(1582023, 300),
	Array(1592020, 300),
	Array(1004808, 300),
	Array(1004809, 300),
	Array(1004810, 300),
	Array(1004811, 300),
	Array(1004812, 300),
	Array(1102940, 300),
	Array(1102942, 300),
	Array(1102941, 300),
	Array(1102943, 300),
	Array(1102944, 300),
	Array(1073158, 300),
	Array(1073159, 300),
	Array(1073160, 300),
	Array(1073161, 300),
	Array(1073162, 300),
	Array(1082695, 300),
	Array(1082696, 300),
	Array(1082697, 300),
	Array(1082698, 300),
	Array(1082699, 300),
	Array(1152196, 300),
	Array(1152197, 300),
	Array(1152198, 300),
	Array(1152200, 300),
	Array(1152199, 300),

	Array(1053063, 300),
	Array(1053064, 300),
	Array(1053065, 300),
	Array(1053066, 300),
	Array(1053067, 300),
	
);
//物品ID 价格
var 传说币商店 = Array(
	Array(3992025, 100),
	Array(2046171, 60),
	Array(2046910, 60),
	Array(2046909, 60),
	Array(2048746, 100),
	Array(2049025, 40),
	Array(2340000, 15),
	Array(2049116, 15)
);
//物品ID 价格
var 超自然商店 = Array(
	Array(3992025, 6),
	Array(2048746, 6),
	Array(2049323, 2),
	Array(2614078, 12),
	Array(2432206, 18),
	Array(2435824, 24),
	Array(2430675, 42),
	Array(4001326, 30),
	Array(4001327, 30),
	Array(4001328, 30),
	Array(4001329, 30),
	Array(4001330, 30),
	Array(4001331, 30),
	Array(4001332, 180),
	Array(1202193, 360),
	Array(2049388, 48),
	Array(2049389, 60),
	Array(2049399, 66)
);
//物品ID 价格
var 神秘魔力结晶商店 = Array(
	Array(2048749, 15), 
	Array(3994979, 50), 
	Array(2049604, 66), 
	Array(3992025, 88), 
	Array(4023026, 100), 
	Array(2614079, 218), 
	Array(2435824, 300), 
	Array(2430675, 600), 
	Array(4023025, 888),  
	Array(2439395, 1588), 
	Array(2630753, 1588), 
	Array(2439265, 1588), 
	Array(2630381, 1588	), 
	Array(2049389, 1600), 
	Array(4036457, 2500), 
	Array(2614074, 2188), 
	Array(4001332, 3288)
);
var BOSSBI = Array(
	Array(1092113,5000),
Array(1162018,1500),
Array(1182006,350),
Array(1182011,400),
Array(1182151,250),
Array(1182156,600),
Array(1182175,300),
Array(1202133,1200),
Array(1202134,1300),
Array(1202135,1400),
Array(1202136,1500),
Array(1202137,1600),
Array(1202138,1700),
Array(1202139,1000),
Array(1202158,1350),
Array(1202160,1450),
Array(1202200,1000),
Array(1212080,5000),

Array(1214017,1500),
Array(1212115,1500),
Array(1213017,1500),
Array(1213034,5000),
Array(1222075,5000),
Array(1222109,1500),
Array(1232075,5000),
Array(1232109,1500),
Array(1242081,5000),
Array(1242116,1500),
Array(1252066,5000),
Array(1252093,1500),
Array(1262017,1500),
Array(1262030,5000),
Array(1272029,5000),
Array(1282029,5000),
Array(1302290,5000),
Array(1302333,1500),
Array(1312166,5000),
Array(1312199,1500),
Array(1322216,5000),
Array(1322250,1500),
Array(1332239,5000),
Array(1332274,1500),
Array(1342086,5000),
Array(1342101,1500),
Array(1362102,5000),
Array(1362135,1500),
Array(1372189,5000),
Array(1372222,1500),
Array(1382223,5000),
Array(1382259,1500),
Array(1402211,5000),
Array(1402251,1500),
Array(1412148,5000),
Array(1412177,1500),
Array(1422153,5000),
Array(1422184,1500),
Array(1432179,5000),
Array(1432214,1500),
Array(1442235,5000),
Array(1442268,1500),
Array(1452217,5000),
Array(1452252,1500),
Array(1462205,5000),
Array(1462239,1500),
Array(1472227,5000),
Array(1472261,1500),
Array(1482180,5000),
Array(1482216,1500),
Array(1492191,5000),
Array(1492231,1500),
Array(1522106,5000),
Array(1522138,1500),
Array(1532110,5000),
Array(1532144,1500),
Array(1542068,5000),
Array(1542108,1500),
Array(1552068,5000),
Array(1552110,1500),
Array(1582026,5000),
Array(1592019,1500),
Array(1592033,5000),
Array(2431938,1000),
Array(2432206,500),
Array(2530002,30),
Array(2614019,60),
Array(2614058,150),
Array(5062001,3),
Array(5062002,3),
Array(5062005,3),
Array(5062006,3),
Array(5062009,3),
Array(5062010,3),
Array(5062090,3)
);

var itemId = -1;
var points = -1;
var period = -1;
var 币种, 商品;
var xx = "#fEffect/CharacterEff/1082565/4/0#"; //兔子
var epp = "#fEffect/CharacterEff/1082312/0/0#"; //彩光

		var selStr = "" + epp + "" + epp + "" + epp + "" + epp + "\r\n";
		selStr += "#e#d          " + xx + "  货币商店中心" + xx + "\r\n";
		selStr += "" + epp + "" + epp + "" + epp + "" + epp + "\r\n";
		
		selStr += "\r\n#L0##r影子商团币商店#v4310059##l";
		selStr += "\t#L1##r贝勒德币商店#v4310097##l";
		selStr += "\r\n#L2#幻影BOSS币商店#v4310218##l";
		selStr += "\t#L3#枫叶传说货币商店#v4310028##l";
		selStr += "\r\n#L4#每日充值币商店#v4031764##l";
		selStr += "\t#L5#BOSS币商店#v4310143##l";
		selStr += "\t#L6#神秘魔力结晶商店#v4036518##l";
		selStr += "\t#L7#公测商店#v4310011##l";
		let selection =npc.askMenuS(selStr);
		 if(selection==1){
			npc.sendShop(504);
		}else if(selection==7){
			player.runScript("七夕兑换");
		}else{
			
		
			if(selection == 0) {
				币种 = 4310059;
				商品 = 影子币;
			} else if(selection == 1) {
				币种 = 4310097;
				商品 = 贝勒币;
			} else if(selection == 2) {
				币种 = 4310218;
				商品 = 困难;
			} else if(selection == 3) {
				币种 = 4310028;
				商品 = 传说币商店;
			} else if(selection == 4) {
				币种 = 4031764;
				商品 = 超自然商店;
			} else if(selection == 5) {
				币种 = 4310143;
				商品 = BOSSBI;
			}else if(selection == 6) {
				币种 = 4036518;
				商品 = 神秘魔力结晶商店;
			}
			var selStr = "-请选购商品:";
			for(var i = 0; i < 商品.length; i++) {
				selStr += "\r\n#L" + i + "##i" + 商品[i][0] + ":# #b#t" + 商品[i][0] + "##k 需要#r" + 商品[i][1] + "#k个#i" + 币种 + "##l";
			}
			var 序号 =npc.askMenuS(selStr);
			var number = npc.askNumber("请输入要兑换的数量",1,1,999);
			if(商品[序号][1]*number>6000){
				npc.say("单次消耗不能超过6000，防止系统出错");
			}else{
				if(player.hasItem(币种, 商品[序号][1]*number)) {
					player.loseItem(币种, 商品[序号][1]*number);
					player.gainItem(商品[序号][0], 1*number);
					npc.say("购买成功。");
				} else {
					npc.say("您的#v" + 币种 + "#不足" + 商品[序号][1] + "个.");
				}

			}
			
	}
