status = -1;
var itemList = [
	[1143026, 500, 1, 0, 0], //正义单手武器攻击力卷轴
	[3700440, 500, 1, 0, 0], //正义单手武器魔力卷轴
	[1143026, 500, 1, 0, 0], //正义单手武器攻击力卷轴
	[3700440, 500, 1, 0, 0], //正义单手武器魔力卷轴
	[1113194, 500, 1, 0, 0], //正义双手武器攻击力卷轴
	[1113193, 500, 1, 0, 0], //正义双手武器攻击力卷轴
	[1113192, 500, 1, 0, 0], //正向混沌卷轴
	[1113191, 500, 1, 0, 0], //正义混沌卷轴 50%
	[1113190, 500, 1, 0, 0], //正义混沌卷轴 30%
	[1113189, 500, 1, 0, 0], //正义混沌卷轴 20%
	[1672082, 500, 1, 0, 0], //惊人正义混沌卷轴 20%
	[1672076, 500, 1, 0, 0], //惊人正义混沌卷轴 20%
	[2614079, 500, 1, 0, 0], //惊人正义混沌卷轴 40%
	[2614078, 500, 1, 0, 0], //惊人正义混沌卷轴 60%
	[2614069, 300, 1, 0, 0], //惊人正义混沌卷轴 50%
	[2614068, 350, 1, 0, 0], //惊人正义混沌卷轴
	[2430761, 200, 1, 0, 0], //闪炫魔方碎片
	[2630627, 100, 1, 0, 0], //闪炫魔方碎片
	[2630626, 100, 1, 0, 0], //闪炫魔方碎片
	[3700506, 500, 1, 0, 0], //伤害皮肤
	[3018242, 500, 1, 0, 0], //神奇魔方
	[3018315, 500, 1, 0, 0], //神奇魔方
	[3018179, 500, 1, 0, 0], //神奇魔方
	[3700506, 500, 1, 0, 0], //神奇魔方
	[3018242, 500, 1, 0, 0], //高级神奇魔方
	[3018315, 500, 1, 0, 0], //高级神奇魔方
	[3018179, 500, 1, 0, 0], //高级神奇魔方
	[4001332, 350, 1, 0, 0], //高级神奇魔方
	[4001331, 500, 1, 0, 0], //惊人的神奇魔方
	[4001330, 500, 1, 0, 0], //惊人的神奇魔方
	[4001329, 500, 1, 0, 0], //惊人的神奇魔方
	[4001328, 500, 1, 0, 0], //惊人的神奇魔方
	[4001327, 500, 1, 0, 0], //白金神奇魔方
	[4001326, 500, 1, 0, 0], //白金神奇魔方
	[1012632, 50, 1, 0, 0], //白金神奇魔方
	[1022278, 50, 1, 0, 0], //白金神奇魔方
	[1122430, 50, 1, 0, 0], //超级神奇魔方
	[1132308, 50, 1, 0, 0], //超级神奇魔方
    [1032316, 50, 1, 0, 0],//终极神奇魔方
    [1113306, 50, 1, 0, 0],//终极神奇魔方
	[1202193, 200, 1, 0, 0], //超级神奇魔方
	[1182136, 600, 1, 0, 0], //超级神奇魔方
	[1672069, 200, 1, 0, 0], //终极神奇魔方
	[1162035, 800, 1, 0, 0], //终极神奇魔方
	[1122296, 500, 1, 0, 0], //终极神奇魔方
	[1202262, 900, 1, 0, 0], //终极神奇魔方
	[1202261, 900, 1, 0, 0], //大师附加神奇魔方
	[1202260, 900, 1, 0, 0], //大师附加神奇魔方
	[2432069, 300, 1, 0, 0], //大师附加神奇魔方
	[3992025, 800, 10, 0, 0], //大师附加神奇魔方
	[2049610, 800, 5, 0, 0], //怪怪方块
	[2049389, 600, 1, 0, 0], //怪怪方块
	[2049387, 800, 1, 0, 0], //怪怪方块
	[2049389, 600, 1, 0, 0], //祥龙单手武器攻击力卷轴99%
	[2049387, 800, 1, 0, 0], //祥龙单手武器魔法力卷轴99%
	[2432206, 500, 1, 0, 0], //祥龙双手武器攻击力卷轴99%
	[2435824, 500, 1, 0, 0], //宿命正义双手武器攻击力卷轴 100%
	[2430675, 500, 1, 0, 0], //宿命正义防具力量卷轴 100%
	[2430675, 500, 1, 0, 0], //宿命正义防具智力卷轴 100%
	[2435824, 500, 1, 0, 0], //宿命正义防具敏捷卷轴 100%
	[2431142, 500, 1, 0, 0], //宿命正义防具运气卷轴 100%
	[2431142, 500, 1, 0, 0], //宿命正义饰品力量卷轴 100%
];
weightList = [];

function getRewardItemId() {
	var itemId = 0;
	var quantity = 0;
	var notice = 0;
	var result = [];

	var t = -1,
		r = 0;
	for(var i = 0; i < itemList.length; i++) {
		var weight = itemList[i][1];
		var k = Math.log(Math.random()) / weight;
		if(k > t) {
			t = k;
			r = i;
		}
	}
	itemId = itemList[r][0];
	quantity = itemList[r][2];
	notice = itemList[r][3];
	itemList[r][4] = itemList[r][4] + 1;
	result.push(itemId, quantity, notice);
	return result;
}

let selection =npc.askMenuS("#L0#抽5次");
if(selection == 0) {
	var text ="";
	var txt="";
	for(var i = 0; i <= 4; i++) {
		var result = getRewardItemId();
		var itemId = result[0];
		var quantity = result[1];
		var notice = result[2];
		var name =player.makeItemWithId(itemId).getItemName();
		text+="你获得了 #v" + itemId + "# #r"+"#t" + itemId + "# #r"+" #k X #b"+quantity+"#k。\r\n";
		player.dropMessage(10, "恭喜你获得了 "+name+"  X1");
		
	} 
	npc.say(text);
}
/**
 * 返回一个大于等于a，小于b的整数
 */
function rand(a, b) {
	var re = ~~(Math.random() * (b - a)) + a;
	//cm.playerMessage(-5,re);
	return re;
}
/**
 * 返回以10为底数的a的对数
 */
function log10(a) {
	return Math.log(a) / Math.log(10)
}