status = -1;
var itemList = [
	 [2591631,400,1,0,0],//伟大的奈奈灵魂结晶
    [2591630,400,1,0,0],//正义单手武器魔力卷轴
    [2591629,400,1,0,0],//正义单手武器攻击力卷轴
    [2591485,400,1,0,0],//正义单手武器魔力卷轴
    [2591561,400,1,0,0],//正义双手武器攻击力卷轴
    [2591552,400,1,0,0],//正义双手武器攻击力卷轴
    [2591484,400,1,0,0],//正向混沌卷轴
    [2591676,400,1,0,0],//正义混沌卷轴 50%
    [2591659,400,1,0,0],//正义混沌卷轴 30%
    [2591640,400,1,0,0],//正义混沌卷轴 20%
    [2591619,400,1,0,0],//惊人正义混沌卷轴 20%
    [2591590,400,1,0,0],//惊人正义混沌卷轴 20%
    [2591581,400,1,0,0],//惊人正义混沌卷轴 40%
    [2591572,400,1,0,0],//惊人正义混沌卷轴 60%
    [2591517,400,1,0,0],//惊人正义混沌卷轴 50%
    [2591427,400,1,0,0],//惊人正义混沌卷轴
    [2430885,600,1,0,0],//惊人正义混沌卷轴 60%
    [2430885,600,1,0,0],//惊人正义混沌卷轴 50%
    [2431938,600,1,0,0],//惊人正义混沌卷轴
    [2591296,400,1,0,0],//闪炫魔方碎片
    [2591264,400,1,0,0],//闪炫魔方碎片
    [2591088,400,1,0,0],//闪炫魔方碎片
    [2048749,800,1,0,0],//闪炫魔方碎片
    [2630404,200,1,0,0],//闪炫魔方碎片
    [2630372,300,1,0,0],//闪炫魔方碎片
    [4031997,400,1,0,0],//闪炫魔方碎片
    [2049116,800,50,0,0],//伤害皮肤
    [2049116,800,50,0,0],//伤害皮肤
    [4031764,500,50,0,0],//神奇魔方
    [4031764,500,60,0,0],//神奇魔方
    [4031764,500,80,0,0],//神奇魔方
    [4000124,500,80,0,0],//神奇魔方
    [4001006,500,1000,0,0],//高级神奇魔方
    [4000672,500,500,0,0],//高级神奇魔方
    [4000645,500,500,0,0],//高级神奇魔方
    [4000627,350,500,0,0],//高级神奇魔方
    [4000133,500,500,0,0],//惊人的神奇魔方
    [2049323,500,20,0,0],//惊人的神奇魔方
    [2049323,500,20,0,0],//惊人的神奇魔方
    [2049323,500,20,0,0],//惊人的神奇魔方
    [3994979,800,5,0,0],//惊人的神奇魔方
    [4310238,800,50,0,0],//惊人的神奇魔方
    [4031997,800,200,0,0],//白金神奇魔方
    [4031997,800,300,0,0],//白金神奇魔方
    [4031997,800,500,0,0],//白金神奇魔方
    [2614079,500,2,0,0],//白金神奇魔方
    [2614079,500,2,0,0],//超级神奇魔方
    [2614079,500,2,0,0],//超级神奇魔方
    [2614079,600,2,0,0],//超级神奇魔方
    [2614079,600,2,0,0],//超级神奇魔方
    [2614069,300,1,0,0],//终极神奇魔方
    [2614069,300,1,0,0],//终极神奇魔方
    [2614068,350,1,0,0],//终极神奇魔方
    [2614068,350,1,0,0],//终极神奇魔方
    [1032316,200,1,0,0],//终极神奇魔方
    [1113306,200,1,0,0],//终极神奇魔方
    [2614068,350,1,0,0],//大师附加神奇魔方
    [2430761,500,1,0,0],//大师附加神奇魔方
    [2630627,500,1,0,0],//大师附加神奇魔方
    [2630626,500,1,0,0],//大师附加神奇魔方
    [1012632,100,1,0,0],//怪怪方块
    [1022278,100,1,0,0],//怪怪方块
    [1122430,100,1,0,0],//怪怪方块
    [1132308,100,1,0,0],//祥龙单手武器攻击力卷轴99%
    [1202193,400,1,0,0],//祥龙单手武器魔法力卷轴99%
    [1182136,500,1,0,0],//祥龙双手武器攻击力卷轴99%
    [1672069,500,1,0,0],//宿命正义双手武器攻击力卷轴 100%
    [1122296,500,1,0,0],//宿命正义防具力量卷轴 100%
    [2432069,500,1,0,0],//宿命正义防具力量卷轴 100%
    [2432069,500,1,0,0],//宿命正义防具力量卷轴 100%
    [3992025,600,10,0,0],//宿命正义防具智力卷轴 100%
    [2049610,800,30,0,0],//宿命正义防具敏捷卷轴 100%
    [4023026,800,5,0,0],//宿命正义防具运气卷轴 100%
    [4023026,500,5,0,0],//宿命正义饰品力量卷轴 100%
    [4023025,500,3,0,0],//宿命正义防具力量卷轴 100%
    [4023025,500,3,0,0],//宿命正义防具智力卷轴 100%
    [4036457,500,1,0,0],//宿命正义防具敏捷卷轴 100%
    [4036457,500,1,0,0],//宿命正义防具运气卷轴 100%
    [4000000,500,3000,0,0],//宿命正义饰品力量卷轴 100%
    [4000016,500,3000,0,0],//宿命正义防具力量卷轴 100%
    [4034848,500,5,0,0],//宿命正义防具智力卷轴 100%
    [4001332,500,1,0,0],//宿命正义防具敏捷卷轴 100%
    [4001331,500,2,0,0],//宿命正义防具运气卷轴 100%
    [4001330,500,2,0,0],//宿命正义饰品力量卷轴 100%
    [4001329,500,2,0,0],//宿命正义防具智力卷轴 100%
    [4001328,500,2,0,0],//宿命正义防具敏捷卷轴 100%
    [4001327,500,2,0,0],//宿命正义防具运气卷轴 100%
    [4001326,500,2,0,0],//宿命正义饰品力量卷轴 100%
    [2049389,600,1,0,0],//宿命正义防具智力卷轴 100%
    [2049389,600,1,0,0],//宿命正义防具敏捷卷轴 100%
    [2049387,800,1,0,0],//宿命正义防具运气卷轴 100%
    [2049387,800,1,0,0],//宿命正义饰品力量卷轴 100%
    [2432206,500,3,0,0],//宿命正义防具力量卷轴 100%
    [2432206,500,3,0,0],//宿命正义防具智力卷轴 100%
    [2435824,500,2,0,0],//宿命正义防具敏捷卷轴 100%
    [2430675,500,1,0,0],//宿命正义防具运气卷轴 100%
    [2430675,500,1,0,0],//宿命正义饰品力量卷轴 100%
    [2435824,500,2,0,0],//宿命正义防具力量卷轴 100%
    [2431142,500,3,0,0],//宿命正义防具智力卷轴 100%
    [2431142,500,3,0,0],//宿命正义防具敏捷卷轴 100%
];
weightList = [];

function getRewardItemId() {
	var itemId = 0;
	var quantity = 0;
	var notice = 0;
	var result = [];

	var t = -1,
		r = 0;
	for(var i = 0; i < itemList.length; i++) {
		var weight = itemList[i][1];
		var k = Math.log(Math.random()) / weight;
		if(k > t) {
			t = k;
			r = i;
		}
	}
	itemId = itemList[r][0];
	quantity = itemList[r][2];
	notice = itemList[r][3];
	itemList[r][4] = itemList[r][4] + 1;
	result.push(itemId, quantity, notice);
	return result;
}

let selection =npc.askMenuS("#L0#抽5次");
if(selection == 0) {
	var text ="";
	var txt="";
	for(var i = 0; i <= 4; i++) {
		var result = getRewardItemId();
		var itemId = result[0];
		var quantity = result[1];
		var notice = result[2];
		var name =player.makeItemWithId(itemId).getItemName();
		text+="你获得了 #v" + itemId + "# #r"+"#t" + itemId + "# #r"+" #k X #b"+quantity+"#k。\r\n";
		player.dropMessage(10, "恭喜你获得了 "+name+"  X1");
		
	} 
	npc.say(text);
}
/**
 * 返回一个大于等于a，小于b的整数
 */
function rand(a, b) {
	var re = ~~(Math.random() * (b - a)) + a;
	//cm.playerMessage(-5,re);
	return re;
}
/**
 * 返回以10为底数的a的对数
 */
function log10(a) {
	return Math.log(a) / Math.log(10)
}