/**
* 传送-QQ:739977676
**/
var dtb = "#fEffect/CharacterEff.img/1112949/3/0#"
var n = "#fEffect/CharacterEff.img/1003249/1/0#"
var i = "#fEffect/CharacterEff.img/1112900/3/1#"

let 戒指 = Array("#b瑪瑙戒指素材地圖",
		//地区ID
		Array("#r【升２階】#v4000027#", 105030100),
		Array("【升２階】#v4000028#", 105030200),
		Array("【升２階】#v4000046#", 105030300),
		Array("#b【升３階】#v4000070#", 200010111),
		Array("【升３階】#v4000071#", 200010121),
		Array("【升３階】#v4000072#", 200010131),
		Array("#r【升４階】#v4000288#", 250010500),
		Array("【升４階】#v4000282#", 250010500),
		Array("【升４階】#v4000289#", 250010503),
		Array("#b【升５階】#v4000357#", 261020600),
		Array("【升５階】#v4000359#", 261020200),
		Array("【升５階】#v4000360#", 261020100),
		Array("#r【升６階】#v4000238#", 240010800),
		Array("【升６階】#v4000241#", 240010400),
		Array("【升６階】#v4000242#", 240010500),
		Array("#b【升７階】#v4000268#", 240040400),
		Array("【升７階】#v4000269#", 240040400),
		Array("【升７階】#v4000270#", 240040400),
		Array("【升７階】#v4000273#", 240040600),
		Array("【升７階】#v4000274#", 240040600),
		Array("#r【升８階】#v4000444#", 270010100), 
        Array("【升８階】#v4000449#", 270020100), 
        Array("【升８階】#v4000454#", 270030100),
        Array("【升８階】#v4000152#", 220070400),
		Array("#b【升９階】#v4000643#", 271020000),
        Array("【升９階】#v4000644#", 271010300),
        Array("【升９階】#v4000645#", 271010400),
        Array("【升９階】#v4000829#", 273030000),
        Array("【升９階】#v4000830#", 273030100),
        Array("【升９階】#v4000831#", 273030300),
		Array("#r【升１０階】#v4000826#", 273020000),
        Array("【升１０階】#v4000827#", 273020200),
        Array("【升１０階】#v4000828#", 273020300),
        Array("【升１０階】#v4000832#", 273040000),
        Array("【升１０階】#v4000833#", 273040100),
        Array("【升１０階】#v4000834#", 273040300),
		Array("#b【升１１階】#v4000651#", 271030200),
        Array("【升１１階】#v4000649#", 271030100),
        Array("【升１１階】#v4000642#", 271010100),
        Array("【升１１階】#v4000653#", 271030400),
        Array("【升１１階】#v4000650#", 271030100),
		Array("#r【升１２階】#v4000654#", 271030500),
        Array("【升１２階】#v4000655#", 271030510),
        Array("【升１２階】#v4000656#", 271030520),
        Array("【升１２階】#v4000657#", 271030530),
        Array("【升１２階】#v4000658#", 271030540)
	   
	);
let 項鍊 = Array("#b瑪瑙戒指素材地圖",
        //地区ID
        Array("#r【升２階】#v4000023#", 101030200),
        Array("#r【升２階】#v4000013#", 101030100),
        Array("#r【升２階】#v4000007#", 101030000),
		Array("#b【升３階】#v4000059#", 200020000),
        Array("#b【升３階】#v4000060#", 200050000),
        Array("#b【升３階】#v4000061#", 200080000),
		Array("#r【升４階】#v4000069#", 211041600),
        Array("#r【升４階】#v4000079#", 211042100),
        Array("#r【升４階】#v4000080#", 211042100),
		Array("#b【升５階】#v4000032#", 103030100),
        Array("#b【升５階】#v4000297#", 251010403),
        Array("#b【升５階】#v4000296#", 251010402),
		Array("#r【升６階】#v4000226#", 240010000),
        Array("#r【升６階】#v4000228#", 240010000),
        Array("#r【升６階】#v4000227#", 240010000),
        Array("#r【升６階】#v4000229#", 240010100),
        Array("#r【升６階】#v4000230#", 240010100),
		Array("#b【升７階】#v4000363#", 261020401),
        Array("#b【升７階】#v4000364#", 261020400),
        Array("#b【升７階】#v4000365#", 261020400),
        Array("#b【升７階】#v4000361#", 261010103),
        Array("#b【升７階】#v4000354#", 261010101),
		Array("#r【升８階】#v4000445#", 270010200),
        Array("#r【升８階】#v4000450#", 270020200),
        Array("#r【升８階】#v4000455#", 270030200),
        Array("#r【升８階】#v4000151#", 220060400)
		
		//Array("瑪瑙項鍊1-2階材料 哼唱小道", 100020100),
		//Array("瑪瑙項鍊2-3階材料 漂漂豬海岸", 120000400),
		//Array("瑪瑙項鍊3-4階材料 雲彩公園Ⅰ", 200010000),
		//Array("瑪瑙項鍊4-5階材料 蟠桃果林", 250010500),
		//Array("瑪瑙項鍊4-5階材料 久老的濕地", 251010400),
		//Array("瑪瑙項鍊5-6階材料 龍的峽穀", 240040000),
		//Array("瑪瑙項鍊5-6階材料 主巢穴山峰", 240040600),
		//Array("瑪瑙項鍊6-7階材料 騎士團第1區域", 271030100),
		//Array("瑪瑙項鍊6-7階材料 騎士團第2區域", 271030200),
		//Array("瑪瑙項鍊6-7階材料 騎士團第3區域", 271030300),
		//Array("瑪瑙項鍊7-8階材料 灰風高原", 273030300),
		//Array("瑪瑙項鍊7-8階材料 崎嶇荒野", 273060100),
	
	);
	
let str = "\t\t  " + dtb + " #fs15##e#r瑪　瑙　傳　送#n " + dtb + "\r\n#fs12#";
	str += "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "" + i + "";
			//str += "#L999##r組隊中心#b#l#L998##r婚禮中心#b#l#L997##r家族任務#l#L7#轉蛋地圖\r\n\r\n"
			str += "#b#L1#瑪瑙戒指素材地圖#l\r\n\r\n#L2#瑪瑙項鍊素材地圖#l"
	let selected = npc.askMenu(str);

var text = "#b請選擇你要去的地方:"
switch (selected){
	case 1://城鎮
		for(let i = 1; i<戒指.length;i++){
		text += "\r\n#L"+i+"#"+戒指[i][0]+"#l"
		}
		let seleted1 = npc.askMenu(text);
		player.changeMap(戒指[seleted1][1]);
		break;
	case 2://練級
		for(let i = 1; i<項鍊.length;i++){
		text += "\r\n#r#L"+i+"#"+項鍊[i][0]+"#l"
		}
		seleted1 = npc.askMenu(text);
		player.changeMap(項鍊[seleted1][1]);
		break;
	case 3://素材
		for(let i = 1; i<素材.length;i++){
		text += "\r\n#r#L"+i+"#"+素材[i][0]+"#l"
		}
		seleted1 = npc.askMenu(text);
		player.changeMap(素材[seleted1][1]);
		break;
	case 4:
		player.runScript("魔王傳送")
		break;
	case 5:
		player.changeMap(993050400);
		break;
	case 6:
		player.changeMap(931000500);
		break;
	case 7:
		player.runScript("瑪瑙地圖")
		break;
	case 8:
		player.runScript("裝備附魔")
		break;
}
