/**
* 自选发型-新端脚本修改 几里 315342975 
**/

var item = 5150040;
//男生
 //男生
var manStyle =  [30030, 30020, 30000, 30310, 30330, 30060, 30150, 30410, 30210, 30140, 30120, 30200, 30180, 30190, 30210, 30260, 30460, 30470, 30490, 30570, 30590, 30790, 30830, 30850, 33000, 33060, 33150, 33240, 33250, 33380,33370,33460,33500,33510,33630,33640,33660,33980,35020,35090,35180,35220,35240,35290,35360,35430,35440,35510,35560,35650,35670,35760,35800,36010,36100,36290,36470,36510,36700,36710,36780,36830,36950,38440,40030,40050,40060,40260,40270,40350,40390,40490,40600,40640,40670,40710,40730,40740,40930,42060,42100,43280,43290,43300,43320,43330,43340,43740,43790,44140,44170,44780,44870,44870,45030,45050,45060,45090,45080,45100,45110,45120,45150,45220,46010,46040,46070,46090];

//女生
var womanStyle = [31050, 31040, 31000, 31150, 31310, 31300, 31160, 31100, 31410, 31030, 31080, 31070,34910,37240,38960,41840,42070,48030,47460,47430,47420,47410,47400,47370,47340,47310,47300,47290,47150,47100,47090,47080,47070,47060,47050,47000,46150,44840,44650,44590,44490,44470,44480,44430,44420,44400,44320,44290,44200,44030,43630,41950,41890,41860,41830,41840,41800,41750,41720,41670,41650,41640,41600,41580,41570,41560,41220,41200,41150,41140,41120,41100,40980,40970,40960,40930,40850,40760,40520,38860,38850,38830,38780,38750,38690,38640,38630,38620,38600,38580,38570,38560,38530,38520,38500,38480,38450,38320,38120,38080,38070,37930,37920,37860,37770,37740,37700,37690,37510,37320,37200,37190,37140,37130,37100,37060,37040,37030,34230,31990];
function getStyleChoices(gender, currentHair) {
    let color = currentHair % 10;
    let styles;
    if (gender == 0)
        styles = manStyle; //男生发型
    else if (gender == 1)
        styles = womanStyle; //女生发型
    for (let i = 0; i < styles.length; i++)
        if (npc.isHairValid(styles[i] + color)) //prefer current hair color
            styles[i] += color;
    return styles;
}
let res;
let isAngel = false;
let isBeta = false;
if (player.getJob() == 6001) {
    isAngel = npc.askAngelicBuster() != 0;
} else if (player.getJob() == 10112) {
    isBeta = npc.askMenu("请选择：\r\n#b#L0#神之子：阿尔法#l\r\n#L1#神之子：贝塔#l") != 0;
}

let selection = npc.askMenu("您好,请选择你需要的服务。\r\n#b#L0#自选发型（使用#v"+item+"#）");
switch (selection) {
    case 0:
        hairs = getStyleChoices(player.getGender(), player.getHair());
        res = npc.askAvatar("我能把你现在的发型变成全新的发型。你对现在的发型不厌倦吗?只要你有#b#t5150052##k,我就帮你换发型。慢慢挑选你想要的发型吧~", hairs, item, isAngel, isBeta);
        break;
}
selection = res[0];
let buy = res[1];

if (player.hasItem(item, 1)) {
    player.loseItem(item, 1);
    if(!isAngel){
        player.setHair(hairs[selection]);

    }else{
        player.setSubHair(hairs[selection]);
        

    }
    
    npc.sayNext("完成了,享受你的新发型吧!,如果造型没发生变化，小退即可哦");
}else {
    npc.sayNext("呃……你好像没有#v"+item+"#啊？很抱歉,没有#v"+item+"#的话,我不能给你做头发。");
}
