var dropItem = Array(
	//物品ID  概率      最小数量  最大数量
Array(2340000,299997,1,2),
Array(5062503,2999997,5,10),
Array(2431743,299997,1,1),
Array(1112784,600,1,1),
Array(2431741,2999997,1,1),
Array(5062024,299997,1,5),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(4310143,2999997,1,2),
Array(2614071,2400,1,1),
Array(2614053,3000,1,1),
Array(2048717,29997,1,1),
Array(2049604,299997,1,1),
Array(2614005,1800,1,1),
Array(2614053,10000,1,1),
Array(2614039,4500,1,1),
Array(2614058,299997,1,1),
Array(1132174,99,1,1),
Array(1102483,99,1,1),
Array(1072747,99,1,1),
Array(1082543,99,1,1),
Array(1072744,99,1,1),
Array(1072743,99,1,1),
Array(1102485,99,1,1),
Array(1102484,99,1,1),
Array(1072746,99,1,1),
Array(1082547,99,1,1),
Array(1072745,99,1,1),
Array(1082545,99,1,1),
Array(1102482,99,1,1),
Array(1132175,99,1,1),
Array(1082546,99,1,1),
Array(1132176,99,1,1),
Array(1132178,99,1,1),
Array(1102481,99,1,1),
Array(1132177,99,1,1),
Array(1082544,99,1,1),
Array(4036518,599999,1,2),
Array(4036518,599999,1,2),
Array(4036518,599999,1,2),
Array(4036518,599999,1,2),
Array(4036518,599999,1,2)

);

var txt="\r\n";
for(var i=0;i<dropItem.length;i++){
	var chance = Math.floor(Math.random() * 100000);
	txt+="#v"+dropItem[i][0]+"#随机到的点数为:"+chance+":";
	if(chance<=dropItem[i][1]){
		//添加物品
		var number=Math.floor(Math.random() * dropItem[i][3])+1;
		txt+="#r掉落 个数为:"+number+"#k\r\n";
		player.gainItem(dropItem[i][0],number);
		
	}else{
		txt+="#g没出#k\r\n";
	}
	
}
npc.say(txt);